{
  "metadata": {
    "title": "Gattaca",
    "director": "Andrew Niccol",
    "writer": "Andrew M. Niccol",
    "year": 1997,
    "genre": "Sci-Fi Drama",
    "totalScenes": 125,
    "extractionDate": "2026-01-16"
  },
  "scenes": [
    {
      "id": 1,
      "title": "INT. INCINERATOR. EARL Y MORNING.",
      "location": {
        "primary": "INCINERATOR. EARL Y MORNING.",
        "type": "int"
      },
      "text": "INT. INCINERATOR. EARL Y MORNING.\nA naked MAN. thirties. seen in profile. is crouched upon a metal \nfloor inside a small. brushed stainless steel tank. rubbing his \nskin raw with a wire brush. JEROME MORROW. \nHaving completed his scrupulous ablutions. Jerome arches his \nlean. frame through the small. oval door of the metal room \nwith practised ease. \n(CONTINUED) \n.. J \nCCNTINUED \nSecuring tl',e I:hick, fireproof · .... ~ndowed door behu'.d h~mselE, :-:e \nI:urns a SW~l:ch 1:0 release gas ~nl:o I:he vacal:ed chamber. 7he gas \n~nsl:anl:~y ignJ..l:es in · .... hal: 1S now revealed 1:0 be a g:\"eamJ..ng . \nmodern sl:ainless sl:eel cusl:om-made incineral:or. \nWe refocus on a MAGNIFIED CLOSE UP of his exfolial:ed flesh ~n \nthe incinerator as it blackens, curls and burns. \nJerome covers himself with a silk robe and steps into a pa~r of \nbackless slippers. "
    },
    {
      "id": 2,
      "title": "INT. EUGENE'S CONDOMINIUM. EARLY MORNING.",
      "location": {
        "primary": "EUGENE'S CONDOMINIUM. EARLY MORNING.",
        "type": "int"
      },
      "text": "INT. EUGENE'S CONDOMINIUM. EARLY MORNING.\nJEROME emerges from the incinerator room into a large, luxurious loft-style condo containing a bizarre assortment of equipment -\narranged somewhat like a product~on line. \nLong, scrupulously clean metal work benches are arranged along \none entire wall. Laid out on the benches in neat rows are I . \ndozens of plastic bags -some filled, some unfilled. Instrument, \non trays -various types of t'weezers, scissors and other less \nfamiliar utensils. Round, stainless steel containers filled \nwith hairs of differing lengths and other body matter. \nJEROME approaches another man slumped over one of the benches. \nEUGENE. He clutches an empty vodka bottle. He is snoring \nlightly -sleeping off I:he night before. As JEROME gently \nprises the bottle out of hlS hand, we are struck by the \nslmilarity of Eugene's face to Jerome's. \nJerome pulls Eugene's chair back from the desk with surprising \nease. A wheelchair - a modern, ergonomic design. Jerome wheels \n. ,Eugene to a bedroom and, with some difficulty, hauls the larger \n. 'man onto the bed, Through his alcoholic fog, Eugene feebly co­\noperates -his paralyzed legs a particular dead weight. \nAfter covering Eugene with a blanket, Jerome enters a bathroom \ncontaining a surgically-clean stainless steel basin, sink, \nshower and toilet. \nBeside the toilet stands a large, industrial-style stalnless \nsteel refrigerator. \nDonning protective gloves, Jerome opens the liquid-nitrogen \ncooled refrigerator. A cloud of condensed water vapor bil.lows \nout. Revealed inside the fridge are racks of labelled jars and \nsilicon pouches -some containing a yellowish liquid, some a \ndeep, red liquid. (CONTINUED) \nCONTlNUEO \nIn fr~nt of one of the jars is a handwritten shopping list -\n\"TRUFFLES, CIGS, VOCKA\". Jerome smiles to himself as he \nretr:eves the note along with one of the Jars. He checks the Jar's label. Satisfied with the date written there, he breaks \nthe seal and pours the contents into the clear, silicon pouch of \nan IV-like device lying on the steel bathroom counter. \nHe seals the pouch and checks the apparatus by open~ng the val'/e \non its fine tube and squirting a small quantity of the liqu~d \ninto the nearby toilet bowl, as one would test a syringe. We \nremain on Jerome's face as he reaches between his legs and \ninserts the pouch. \nReopening the refrigerator, Jerome slides out a tray contai'ning \nneat rows of slim, fingertip-sized plastic sachets filled with a \ndeep, red-colored liquid. He removes his gloves, selects one of \nthe sachets and carefully adheres the sachet to the pad at the \nend of his index finger. He prepares a second sachet for nis \nmiddle finger. Jerome then applies skin-colored cover-up makeup \nto the sachets, blending them in with the color of his fingers .. J \nJEROME, still dressed in hl.S robe, climbs a large,. spiral \nstaircase to the floor above. "
    },
    {
      "id": 3,
      "title": "INT. JEROME'S CONDOMINIUM. EARLY MORNING.",
      "location": {
        "primary": "JEROME'S CONDOMINIUM. EARLY MORNING.",
        "type": "int"
      },
      "text": "INT. JEROME'S CONDOMINIUM. EARLY MORNING.\nHe emerges at the top of the staircase into a similarly farge, \nloft-style condominium. Through the floor to ceiling window \nthat opens onto a balcony we see that dawn is only just starting \nto leak into the night sky. \nIn the bedroom JEROME removes a shirt from a drycleaning bag. \nPrinted on the bag -\"Confidentiality Guaranteed\". He emerges \n·.from his bedroom, dressed in a smart albeit unconventionally cut ··suit. He adjusts h~s t~e ln the mirror, careful not to disturb \nthe sachets attached to his fingertips. \nIN'!'. INVESTIGATOR'S POOL. MORNING. \nA lone MAN swims a ferocious lap of freestyle in what appears to \nbe a pool of enormous length -yet he never reaches the pool's \nend. We pull wider to reveal that the man is swimming against \nan artificial current in a pool barely larger than himself. \nAbruptly, the man stops and stands up -the fast-flowing currer \ninstantly stilled. We glimpse the face of INVESTIGATOR LUCAS \nThirties, he has a youthful yet rigid face. We have the \nirnpress~on that he does not swim for pleasure. \n.. EXT. C0NDCMINIUM CC::1E.EX. MORNI}IG. \n:t is still early as ~ERCME exits the building's underground \nparking garage in an irrrnaculate Studebaker Avanti and proceeds \ndown the long straight drlveway. He exchanges a wave · .... ith a \nGARDENER triImling a lawn. \nThe whir of the car's electric powered engine belies its \nconventional appearance. "
    },
    {
      "id": 4,
      "title": "EXT. GATTACA AEROSPACE CORPORATION. DAY.",
      "location": {
        "primary": "GATTACA AEROSPACE CORPORATION. DAY.",
        "type": "ext"
      },
      "text": "EXT. GATTACA AEROSPACE CORPORATION. DAY.\nJEROME's car exits a highway and turns up the sweeping r~ad \nleading to the parking lot of \"GATTACA AEROSPACE CORPORATION\". \nA sleek, modern, low-rise industrial compound boasting perfectly \nmanicured landscaped gardens. "
    },
    {
      "id": 5,
      "title": "INT. GATTACA AEROSPACE CORPORATION. DAY.",
      "location": {
        "primary": "GATTACA AEROSPACE CORPORATION. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA AEROSPACE CORPORATION. DAY.\nJEROME strides purposefully up to the entranceway wloth hundreds 1 \nof other GATTACA EMPLOYEES. He carries himself wi t·h a' certalon' I \narrogance, a cool detachment. All employees wear similarly . \nunconventionally-cut suits, short coiffed hair and robust tans. \nThe Gattaca employees are a seemingly equal split of men and \nwomen and a diverse range of ethnicities. \nThey filter through a row of channels supervised by SECURITY \nGUARDS. Each channel contalons a computerized security device, \nfeaturing a slim groove in which the employee places a finger \nunder the watchful eye of a Security Guard. \nJerome \nfinger \n'. finest gives a polite \nin the groove. \nof needles and nod to a Guard \nHis fingertip \na minute blood as he places his index \nis jabbed with the \nsample taken. \nThe blood specimen confirms Jerome's identity -an ID photograph \nappearing on a computer screen. \nOut of the corner of his eye, Jerome spies a young woman \nentering through the adjacent channel. She is also sneaking a \nglance in his direction -IRENE. Catching each other looking, \nthey both quickly avert thelor eyes. \nAs Jerome enters the computer facility of Gattaca Aerospace \nCorporatloon he furtively glances at the pin-prick puncture in \nhis fingertip sachet. \nSCME'IIHERE IN CEEP SP.;CE. \nA GATTACA spacecraft sk~=~s an asteroid. \nthe rock's grav~tational pull, the craft \nthe black void. Then act\"-,;:t ly the craft \nin mid-space, suddenly reverse d~rection \nagain -the spacecraft tak~ng a slightly o \nTaking advantage cf \nslingshots deeper lnto \nand the astero~d f=ee~e \nand proceed fO.Hard \nadjusted course. \nWe pull back to reveal that the journey is merely a highly \nrealistic graphic representatlon on a GATTACA computer screen \noperated by JEROME. \nAppearing simultaneously alongside the computer animation is a \nseemingly never-end~ng coL;.mn of computer instructions for th~s \ncelestial navigat~on -the lncomprehensible language of the \ncomputer programmer. \n140 *x20x08xSSx20x08xS$x20x08x$$x20{ \n150 *xOOxOOxOOxOOxOOxOOxOOxOOxOOxOO \n160 .xfexfexfexfexfexfexfexfexfexfe \nJerome. is transported -plott~ng a path thr'ough the heavens. 1 \nAs his fingers fly across the keys he does not once. take'h~s . \neyes from the scree~. . \nHis is one of hundreds of ergonomically-designed work stations, \narranged in ever-w~denlng clrcles in a huge, circular, well­\nappointed if antiseptic room. Each curved desk conta~ns a \ncomputer terminal consisting of a keyboard and a slim, \ntransparent screen behind wh~ch is seated a PROGRAMMER, \ndeSigning software for the aerospace agency. At the center of \nthe room is a donut-shaped command console, chairs facing \noutwards, from which operations are monitored. \nFloor to ceiling smoked-glass curved walls offer the only \n'.concession to nature - a tlnted view of a man-made, met~culously \n\"landscaped garden. \nJerome tears himself away from his screen and picks up a \ndiscreet mini-vac. He vacuums between the keys of his keyboard. \nDIRECTOR JOSEF, 50's, a shorter, official-looking man \napproaches. His assistant IRENE stands at his shoulder, \nDIREC'roR JOSEF \nYou keep your work station so clean, Jerome. \nJEROME \n--Next to Godliness, isn't that what they say? \nThe Director smlles at the notion and places a computer dlSC \non Jerome's desk. (CONTINUED I \nCONTINUED \nDIREC:DR JOSEF \nI reviewed your flight plan. Not one error \nIn a hundred thousand keystrokes. Phenomenal. \n(placing a hand on Jerome's shoulder) It's right that someone like you is taking us \nto the Belt. 7 \n(glancing to notification on Jerome's screen) \nYou have a substance test. \nThe Director briskly departs, Irene in tow. At a nearby work station, a painfully thin programmer, NAPOLEON, perks up at \nthe mention of the test. \nJerome merely shrugs and pretends to reach down and scratch his \nankle. However he surreptitiously produces one of Eugene's \ntransparent specimen bags from his sock. An EXTREME CLOSE UP \nreveals the bag'S contents -flakes of skin, hair follicles, \neyelashes, a fingernail. Cupping the bag in his hand to avoid \ndetection, Jerome sprinkles the fraudulent body matter over his \nkeyboard, desk surfaces and the floor around his work station. \nHe opens his desk drawer and casually sc'att'ers the remainder of \nthe bag. Finally he inspects a comb already laced with two \nhair follicles. \nJerome rises from his work station and makes his way towards the \ntestlng lab. "
    },
    {
      "id": 6,
      "title": "INT. GATTACA AEROSPACE CORPORATION -TESTING LABORATORY. DAY.",
      "location": {
        "primary": "GATTACA AEROSPACE CORPORATION -TESTING LABORATORY. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA AEROSPACE CORPORATION -TESTING LABORATORY. DAY.\nWhite-coated LAMAR, forties, buzzcut, a man's man, checks \nJEROME's eyes with an instrument. Satisfied with his \n. ,examination, he passes a transparent plastic container to \n. ,JEROME. Standing directly in front of the technician with his \nback to camera, Jerome opens his fly. A steady stream of urlne \nbegins to flow into the container from Jerome's hidden pouch. \nLAMAR \n(staring admiringly at the discharge) \nJerome ... never shy. Pisses on command. \nYou've got a beautiful cock. I ever told \nyou that, Jerome? \n(CONTINUED) 1· \nCONTINUE!) \nJERCME \n(deadpan as he continues to urinate) \nOnly every time I'm in here. a \nJerome hands the container to Lamar who seals and labels it ~s \nJerome refastens his trousers. \nLAMAR \nI see a lot of cocks. I speak from experience. \nYours is a beautiful example. Why didn't my \nfolks order a cock like that for me? \nLAMAR pours the urine sample into a high-tech device where it \nis instantly analyzed. The urine identifies Jerome while also \nregistering a negative drug reading. The computer reads \n\"VALID\" . \nLAMAR \n(walking Jerome to the door) \nIf everything goes to plan, this could be the \nlast time I see you for a while. 9ne week to \ngo. Please tell me you're the least bit excited. \nJEROME I'll tell you at the end of the week. \nJerome departs. "
    },
    {
      "id": 7,
      "title": "INT. GATTACA -RESTROOM. DAY. I",
      "location": {
        "primary": "GATTACA -RESTROOM. DAY. I",
        "type": "int"
      },
      "text": "INT. GATTACA -RESTROOM. DAY. I\nJEROME enters the restroom and glances at the toilet stalls. \nOnly three in the bank of twenty is occupied. He tarries at the \n',mirror above the uniform line of basins, unnecessarily \n\" reknotting his tie. \nA toilet flushes and a COLLEAGUE exits one of the stalls. He \nand Jerome exhange a nod. When the man has exited the restroom. \nJerome enters the man's vacated stall. "
    },
    {
      "id": 8,
      "title": "INT. GATTACA -TOILET STALL. DAY.",
      "location": {
        "primary": "GATTACA -TOILET STALL. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -TOILET STALL. DAY.\nJEROME immediately feels around the back of the toilet bowl and \ndetaches a secreted stainless steel container. \n(CONTINUED) \nCONTINUE):) \n~ith surprising swiftness and dexterity, Jerome removes an \nextremely fine contact lens from each eye and drops the pa~r \ninto the toilet bowl. He inserts two replacement lenses from \nthe container and reattaches it in its hiding place. \nJerome flushes the to~let and exits the stall. He checks ln the \nmirror that his new contact lenses are properly inserted. "
    },
    {
      "id": 9,
      "title": "INT. GATTACA -CORRIDOR. DAY.",
      "location": {
        "primary": "GATTACA -CORRIDOR. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -CORRIDOR. DAY.\nWalking back along one of the long, glass-walled corridors, \nJEROME becomes aware of a peculiar no~se in the complex -\nor to be more precise, a lack of noise. The incessant tapping \nof computer keys has st~lled. \nAs Jerome gazes through the glass walled corridor, we see the \nreflection of his face, deep in thought. \nJEROME (VO) \nThe most unre~rkable of events. Jerome \nMorrow, Navigator First Class, is only days \naway from a one year ~nned mission to 95·1 \nGaspra in che Oucer Asteroid Belt .. Nothing so \nunique in chaco Last year over one thousand \ncicizens from every walk of life embarked on \nsome space mission or ocher. Besides, \nselection for Jerome was vircually guaranteed \nat birch. He is blessed with all che physical \nand intelleccual gifts required for such an \narduous undercaking, a genetic quotient second \nto none. \nJerome's gaze drifts to the sky. \nJERONE (VO) \nNo, there is cruly nothing remarkable abouc \nthe progress of Jerome Morrow, except thac I \nam not Jerome Morrow. "
    },
    {
      "id": 10,
      "title": "EXT. BEACH. DUSK -THIRTY-ODD YEARS EARLIER.",
      "location": {
        "primary": "BEACH. DUSK -THIRTY-ODD YEARS EARLIER.",
        "type": "ext"
      },
      "text": "EXT. BEACH. DUSK -THIRTY-ODD YEARS EARLIER.\nA starry sky. The camera tilts down to find palm trees \nswaying against a setting sun. \nJERCME (VO) \nI was conceived in the Riviera:. Not the \nFrench Riviera. \n(CONTINUED) ·1 \n.. CONTINUED \nThe camera c.lts down further to find a Buick Riviera parked ln \na deserced beachfr~nt park~ng lot on a polluted stret~h ~t \nbeach. \n,,-ERCME (Va) \nThe Detroit '/ar~ecy . \nThrough the car's steamed windows we see Jerome's mother ~nd \nfather, MARIA and ANTONIO, early twenties, making love. \nJEROME (Va) \nThey used co say :hat a child conceived in love. \nhas a greater chance of happiness. They don't \nsay chat any mere. "
    },
    {
      "id": 11,
      "title": "INT. FAMILY PLANNING C~:NIC. DAY.",
      "location": {
        "primary": "FAMILY PLANNING C~:NIC. DAY.",
        "type": "int"
      },
      "text": "INT. FAMILY PLANNING C~:NIC. DAY.\nMARIA, wearing a medical gown, lies on an examining table, feet \nin stirrups. A NURSE, forties, wheels an instrument tray \ntowards her. Maria suddenly disengages her feet from t~e \n. stirrups and sWlng:; her legs of f the table. \nNURSE \n~~at are you do~ng? \nMARIA \n(shaking her head) \nI can't do thls. \nNURSE \n(misinterpreting the problem) \nI told you, the government pays. It's all \ntaken care 0 f . \nt-'.ARIA \nNo, you don't understand. I can 'C. \nThe nurse places a comfortlng hand on Maria's shoulder. \nNURSE \n(reassuring) \nThe doctor will give you something. \n1-' A>I. I A \n(removlng the hand, adamant) \nI'm not dOlng It. \n(CONTINUED I \n'\" ,:8NTIN\"'JED \nIt~/l\"g :0 ~Ke her see reasen) \nHoney I you I Ole :\":',ace ~ne m~stake--:'1 \nThe remark stings ~ar1a. \nNURSE \nIsoftenl\"g her tone) \n--I've read your profile. I don't \nknow about the father but you carry \nenough hereditary factors on your own. \nIpausel \nYou can have other :hildren. \nY.ARIA \nIholclr.g her swollen stomach protectively) \nNot like th~s ene. \nNURSE \nItry1ng to be diplomatic) \nHoney, look around you. ThE: world doesn't\" \nwant one Eke that one. \nMaria gets off the table and reaches for her clothes laying \nacross a chair. \nMARIA \nlirate) \nYou don't know what 1t will be! \nThe nurse watches Maria as she dresses, genuinely bewildered. \nNURSE \n(calling out to Maria as she disappears \nout of the door) \nThe child won't :hank you. "
    },
    {
      "id": 12,
      "title": "INT. DELIVERY ROOM. DAY.",
      "location": {
        "primary": "DELIVERY ROOM. DAY.",
        "type": "int"
      },
      "text": "INT. DELIVERY ROOM. DAY.\n'\"e focus on a crucifix dangling on a rosary. Tilting up we find \nthe rosary clasped between MARIA and ANTONIO's intertw1ned \nhands. \nJEROME ( VO) \nThose were early days--days when a priest \ncould still persuade someone to put their \nfaith in God's hands rather than those of \nthe local geneci.=lst. (CONTIUUED) \n:'2 \nCONTINUED \nBatr.ed 1:1 s· .... eat. Mar~a g~'Jes a final push on the deli\"Jery ~ab~e. \n'~~le still attached to his umbilica~ cord. the heel of the \n~~ORN BABY SOY ~s i~mediately pricked by a masked ~ru~SE. \nminute drop of blood is inserted into an analyz~ng mach~ne. • .... \nEven as the baby is put into Maria's arms. page after page of \ndata begins to appear on a monitor. pulsing warn~ng signals \nthroughout the spreadsheets. \nTwo assisting NURSES exchange a look. Antonio senses someth~ng \namiss. \nAtlTONIO \n;./hat·s wrong? \nJEROME (VO) \nOf course, there was nothing wrong with me. \nNoe so long ago· I would have been considered \na p.erfectly normal, healehy baby. Ten fingers, \nte,; toes. Thae was all ehae used-co maeeer. \nBue now my immediate well-bei'rig .was not the \nsale concern. \nAntonio turns his attent:on from his baby to the data appearing \non the monitor. We see individual items highlighted amongst the \ndata -\"NERVE CONDITION -PROBABILITY 60t\", :MANIC DEPRESSION -\n42t\", \"OBESITY\" -66t\". \"ATTENTION DEFICIT DISORDER -89t\"--\nJEROME (VO) \nMY destiny was mapped out before me--\nall my flaws, predispositions and \nsusceptibilities -most untreatable to \nthis day. Only minutes old, the date and \ncause of my death was alreadY known. \nAntonio focuses on a final highlighted item on the monitor's \nscreen, \"HEART DISORDER -99t -EARLY FATAL POTENTIAL.\". \n\"LIFE EXPECTANCY -33 YEARS\". \nNURSE \nThe name? \n(typing details in birth certificate) \nFor the cert~ficate. \nMARIA \nAntonio--\n(CONTINUED) \nI . CONTINUED \nANTONIO \n(correcl:. ing her) \n--No, Vincent Anl:.onio. \nWith a computer sl:.ylus he s~gns the nurse's handheld screen. "
    },
    {
      "id": 13,
      "title": "EXT. TRACT HOME -BACKYARD. DAY.",
      "location": {
        "primary": "TRACT HOME -BACKYARD. DAY.",
        "type": "ext"
      },
      "text": "EXT. TRACT HOME -BACKYARD. DAY.\n2-YEAR-OLD JEROME (REFERRED TO BY HIS GIVEN NAME OF ·VINCE:~'7· \nFOR MOST OF THE FOLLOWING FLASHBACK) running w~th a I:.oy rockel:. \nfalls more in clumsiness I:.han fal:.igue. MARIA suddenly wh~sks up \nI:.he I:.oddler. \nMARIA \n(hysterical) \nOh, Vincent, Vincenc., V~ncent ... I can't leI:. \nyou out my sighl:.. \nMaria frantically listens 1:.0 her young son's heartbeat. For \nhis part, Vincent appears surprised by the attention. Mar~~ \nplaces a porc.able oxygen mask. over Vincent's mouth. \nJEROME (VO) \nI was born Vincent Antonio Luca. And from \nan early age I came to think of myself as \nothers chought of me -chronically ill. \nEvery skinned knee and runny nose treated \nas if it were life-threatening. "
    },
    {
      "id": 14,
      "title": "INT. DAY CARE CENTER. DAY.",
      "location": {
        "primary": "DAY CARE CENTER. DAY.",
        "type": "int"
      },
      "text": "INT. DAY CARE CENTER. DAY.\n·.MARIA and ANTONIO drop off dark-haired, 2-YEAR-OLD VINCENT al:. a \n\"Day Care Cenc.er. \nJEROME (VO) \nAnd my parencs soon realized chat wherever \nI went, my genetic prophecy preceded me. \nNhile HEALTHY CHILDREN play outside on tricycles, clamber over \njungle-gyms and finger-pa~nt, the PRE-SCHOOL TEACHER shows \nVincenc. into a room where CHILDREN WITH OBVIOUS DISABILITIES \nsleep on mats. \nMaria wheels around and marches out of the center with Vincent \nin her arms. Antonio follows close behind, pleading with h~s \nwife to see sense. \n(CONTINUED) \n~-E.\"C,'1E (VO) \n~hey put orr having any more children \nunt~l they could afford not to gamble -\nto bring a ch~~d into the world in what \nhas become the \"natural\" way. "
    },
    {
      "id": 15,
      "title": "EXT. HOME. DAY.",
      "location": {
        "primary": "HOME. DAY.",
        "type": "ext"
      },
      "text": "EXT. HOME. DAY.\nANTONIO reluctantly shows off his spotless Buick Riviera to a \nprospective BUYER. \nJEROME (VO) \nIt meant selling the beloved Buick. \nThe two men haggle over the price while MARIA, holding VINCENT \nin her arms, looks on. Finally money and a pink slip are \nexchanged. \nJEROME (VO) \nMY father got a good price. \nthe only accident he'd ever \ncar was me. After all, \nhad in chat \nAs the BUYER drives away, Antonio shrugs to Maria to hide his \ndisappointment. "
    },
    {
      "id": 16,
      "title": "EXT. GENETIC COUNSELLI~G OFFICE BUILDING. DAY.",
      "location": {
        "primary": "GENETIC COUNSELLI~G OFFICE BUILDING. DAY.",
        "type": "ext"
      },
      "text": "EXT. GENETIC COUNSELLI~G OFFICE BUILDING. DAY.\nANTONIO, MARIA and 2-YEAR-OLD VINCENT exit a packed commuter \nbus and enter a Genetic Counselling office building bearing \nthe sign -\"PRO-CREATION\". "
    },
    {
      "id": 17,
      "title": "INT. GENETIC COUNSELLING OFFICE. DAY.",
      "location": {
        "primary": "GENETIC COUNSELLING OFFICE. DAY.",
        "type": "int"
      },
      "text": "INT. GENETIC COUNSELLING OFFICE. DAY.\nA GENETICIST stares lnto a high-powered microscope as ANTONIO, \nMARIA and 2-YEAR-OLD VINCENT are shown into the office by a \nNURSE. On the counter beside the Geneticist is a glass-doored \nindustrial refrigerator containing petri dishes arranged on \nracks several feet high. \nGENETICIST \n(to the nurse, without taking \nhis eyes from his binocular microscope) \nPut up the dish. \n(CONTINUED) \nCON'!'I~ruED \n' .... llile .~.nton1o and Mar1a :;;l<e a seat in front of a telev1s:,:::,. \nmcn1tor, the Nurse puts a :abelled petri dish under a ·,:.deo­\neq1..apped m1crosccpe. The Geneticist sW1ngs around ~n n~5 ::,.a~r \nto greet his clients. \nFour magnified clusters of cells -e1ght cells on each clus:er \n-appear on the television screen. \nGENETICIST \nYour extracted eggs ... \n(noting the couple's names from \ndata along the edge of the screen) \n\" .Maria, have been fertilized with ... \nAntonio's sperm and we have performed an \nanalysis of the resulting pre-embryos. \nAfter screen1ng we're left with two healthy \nboys and two healthy girls. Naturally, no critical pre-dispost10ns to any of the major \ninheritable diseases. All that remains is \nto select the most compatible candidate. \nMaria and A.\"1tonio exchange a nervous smile. \nGENETICIST \nFirst, we may as well dec1de on gender. \nHave you g1ven it any thought? \nr-<.ARIA \n(referring to the toddler \non her knee) \nWe would like Vincent to have a brother ... \nyou know, to play with. \n:.The Geneticist nods. He scans the data around the edge of the \n. screen. \nGEl'-IETICIST \nYou've already spec1fied blue eyes, dark \nhair and fair skin. I have taken the liberty \nof eradicating any potentially prejudicial \nconditions -premature baldness, myopia, \nalcoholism and addictive susceptibility, \npropens1ty for violence and obesity--\nMARIA \n(interrupting, anxious) \n--We didn't want--diseases, yes. \n(CONT:::~ruES : \n. I \n• I .!oJ'::\": N I 0 \n!more j~P:::lMt~ci \n'lie '\",ere wonder~:-.g ~: ''''e should leave some \nthir,gs to char.ce. \nSE!,,\"E7ICIST \n(reassur:ngi \n'{ou want to -;:'/e your child the best possible start. Bel:eve rne, we have enough irnperfectlcn \nbuilt-ln already. '{our child doesn't need \nany additlonal burdens. And keep in mind, \nthis chlld is st:ll you, simply the best of you. \n'{ou could concel'Je naturally a thousand times \nand never get such a result . \n. ;.N'Tt.1 NI 0 \n(squeeClr.g Marla's handi \nHe's rlght, Marla. That's rlght. \nMaria·is only half-convlnced but the Geneticist swiftly.moves \non. \nGENETICIST \nIs there any reason you'd want a left-handed \nchild? \nANTJNIO \n(blank) \nEr, no .... \nGE.\"JE':'IGST \n(explalnlng) \nSome believe lt :s associated with creativity, \nalthough there's no evidence. Also for \nsports like baseball lt can be an advantage. \nANTONIO \n(shrugs) \nI like football. \nGENETICIST \n(inJecting a note of levity) \nI have to warn you, Mr Luca, he's going \nto be at least a. head taller than you. \nPrepare for a crick in the neck in \nsixteen years tlme. \nAntonio beams proudly. \n(CONTItIUED) \n, \nI \nI . CONTINUED \nGE:'rETICIST \n:scanning the data on the screen) \nAnything I' 'Ie :crgot ten? \nl\".ARIA \n(hesitant about broaching the subject) \nWe want h~m--we ',.ere hoping he would get \nmarried and have children. We'd like \ngrandchildren. \nGENETICIST \n(ccnspiratorial smile) \nI understand. 7hat's already been taken \ncare of. \n(an afterthought) \nNow you appreciate I can only work with \nthe raw material I have at my disposal but \nfor a little extra ... I could also attempt to \ninsert sequenceS associated with enhanced \n~ :hematical or musical ability. \nMAAIA \n(suddenly enthused) \nAntonio, the choir ... \nGENETICIST \n(interjecting, covering himself) \nI have to caution you it's not fool-proof. , -.' \nWith multi-gene traits there can be no guarantees. \nANroNIO \nHow much extra? \nGENETICIST It would be five thousand more. \nAntonio's face falls. \nA.'ITONIO \nI'm sorry, there's no way we can. \nGENETICIST \nDon't worry. You'll probably do just \nas well singing to him in the womb. \n(rising to end the appointment) \nWe can implant the most successful \npre-embryo tomorrow afternoon. \n(CONTINUED) \nI \nI \n. ' CONTINUE':) \n:1aria is staring at the :our ~gn.l.fied cl'.ll11ps on :he screen. \nMARIA \nWhat will happen to the others? \nG~TICIST \nireassur.l.ng) \nThey are not babies, Maria, merely \n\"human possibilities\". \nRemoving the petri dish from beneath the lens of the m.:.crescope, \nhe po.:.nts out the feur minuscule specks. \nGENETICIST \nSmaller than a grain of sand . \nDISSOLVE TO "
    },
    {
      "id": 18,
      "title": "INT. TRACT HOME. DAY.",
      "location": {
        "primary": "TRACT HOME. DAY.",
        "type": "int"
      },
      "text": "INT. TRACT HOME. DAY.\nA red penc.:.l draws a ~4rk on a doorway at the height of a \nchild's head. The child moves away and the name, \"ANTON 11\" .l.S \nwritten beside the mark by proud father, ANTONIO. \nJEROME (VO) \nThat's how my brother, Anton, came into the \nworld -d son my father considered worthy \nof his name. \nThere is little physical similarity between ll-YEAR-OLD ANTON \nand 13-YEAR-OLD VINCENT standing beside him, apart from their \n._ height. In fact Vincent is mortified to see that his younger \n-brother's mark is a fraction of an inch higher than the mark \nbeside his own name, 'VINCENT 13.'. V.:.ncent runs from the room. "
    },
    {
      "id": 19,
      "title": "EXT. BEACH. DAY.",
      "location": {
        "primary": "BEACH. DAY.",
        "type": "ext"
      },
      "text": "EXT. BEACH. DAY.\n13-YEAR-OLD VINCENT and ll-YEAR-OLD ANTON sit together on a \nwindswept beach. \nAnton picks up a broken shell and deliberately slices the t.:.p of \nhis thumb with the sharp edge. He hands the shell to 'Jincent \nwho hesitantly follows suit. \n(CONTINUED) \n[ \nI \"\" .... ERC! .. !E '~/O ) \nBy che C~xe we were plaYlng ac blood \nbrochers I ~nderscood chac there was somechlng \nver/ differenc flowlng chrough my veins. \nThe two brothers press their thumbs together, merg~ng the blood. \n_-E.'WME (VO) \nAnd I'd need an awful loc more chan \na drop if I was gOing eo gee anywhere. "
    },
    {
      "id": 20,
      "title": "EXT. BEACH. LATER IN THE DAY.",
      "location": {
        "primary": "BEACH. LATER IN THE DAY.",
        "type": "ext"
      },
      "text": "EXT. BEACH. LATER IN THE DAY.\nWhile ANTONIO and MARIA doze under a beach umbrella, ANTON and \nVINCENT enter the water, div~ng through the waves. From above \nwe watch their two young bodies swimming beside each other \nbeyond the breakers. \nJEROME (VO) \nOur favorice game was 'chicken'; When our \nparencs weren'e waeching, we used to swim outside \nehe flags, as far oue as we dared. It was abouc \nwho would gee scared and cum back first. \nSuddenly VINCENT Stops sw~mming, pulling up sharply in the \nwater, exhausted and fearf'.ll. \"e watches ANTON swim on into the \ndistance. \nJ EP. CI'{E ( VO) \nOf course, ic was always me. Anton was by far \nche stronger swi.~er and he had no excuse to fail. \n\"INT. SCHOOL -CLASSROOM. DAY. \nA TEACHER gives a phys~cs lesson. \nVINCENT has his arm energetically \n1S never called upon. ~Jentually \nJEROME (VO) The bespectacled i3-YEAR-OLD \nraised at each opportunity but \nhe lowers his arm in defeat. \nMY genecic scarlet letter continued to follow \nme from school co school. When you're told \nYOLl're prone co learning disabilities, it's \nsometimes eaSler not to disappoint anyboqy. \nl EXT. S7REET. NIGHT. \n~3-YEAR-GLD VINCENT st3or.ds at a cul-de-sac at t~e end of a ~c~.~, \nstra~ght deserted street. He places a basketball 1n the ~~dd~e \nof the street to represent the SUN and begins ':.0 '.mw~nd c.he r .. ..;~e \nreel of string attached to the ball. ll-YEAR-OLD ANTON 'Nalks a \npace behind him. Several yards along the trail a bead 15 \nthreaded through the string to represent the planet !1ERC'JRY. \nANTON \nHow many astronauts are there, anyway? \nVincent ignores him and continues to reel out the string. \nANTON \nI bet I co~ld be one. \nVincent stops and regards his younger brother with contempt. \nVINCENT \nYou're standing on Venus . \n. Anton lifts his foot. There is a bead beneath it, \nINTI EXT. CAR I SATELLITE DISH. DUSK. \nVINCENT has developed into a handsome l7-YEAR-OLD. His \nspectacles hidden, he and a YOUNG WOMAN are necking in the front \nseat of a beat-up car, parked overlooking a huge satell~te dish. \nJEROME (VO) \nI was popular enough until it got around \nthat I wasn't a long-term propositlon. \n·.The love-making intensifies. The YOUNG WOMAN moves down \n.. Vincent's chest and unzips his fly. \nJEROME (VO) \nThose who didn't know already could easily \nfind out for themselves. It was certainly \nno problem coaxing the information out of me. \nWe remain on Vincent's face as he climaxes. The YOUNG WOMAN \nturns her head away from the spent Jerome and, out of his \nview, trickles semen from her mouth into a clear specimen '/lal. \nJEROME (VO) \nI didn't blame them. You need to know if a \nprospective husband can qualify for a mortcrage \nor life insurance or can hold down a dece: ;ob. \nI ::-:7 . HC:-1E. :AY. \n::1 the ~~':~::g r~em ~:: :r.e~= :c,edest home, the dark-haired, : -­\n'!ear-o~j, bespectacled ':::;:::::.rr s~ts opposl.t:e hl.s PARENTS. -:,r.e \ncrest::,,~~e!'l ':i:1cent r.as \" bcck en hl.s lap ent~tled \"-::AREE?S ::1 \nSPACE\" . \ni:rjl::; :0 break it gently) \nVlncent, you ~ave to be realistl.c. A \nheart cend~t:~c:1 \":ke yours--\n·:::;CE.'lT \n--I den't care. :'11 take the risk. \n!·~C7':iER It's net JUSt yeu they have to be concerned \nabout. Perhaps we could get you one of \nthose new pace~~kers. They're not perfect \nbut--\nF.!.TItER \n(let:~:1g hl.s frustration show) \nFat' God's sake, ','lncent, don't you understand. \nThe only way ycu'll see the inside of a space \nshl.p l.S If yeu're cleaning it~ \nVincent looks at hlS fat~er in disbelief. \nOn a dinner table on t~e ether side of the living room, is-YEAR­\nOLD ANTON, looks up frcm the bl.ological specimen he l.S studYlng \nwl.th a magnifying glass. \n~:.rr. PERSONNEL OFFICE -~AITING ROOM. DAY . \n. i7-YEAR-OLD VINCENT hl.des his glasses in his pocket as he enters \na WAITING ROOM. He ga=es around at other APPLICANTS. \n~·EROME (VO) \nMY father was right. It didn't matter how \nmuch I lied on ~ resume, my real C.V. was \nin my cells. ~y should anybody invest all \nthat money to Crain me, when there are a \nthousand other applicants with a far cleaner \nprofile? of course, it's illegal to discriminate -\n\"genoism\" it's called -but no one takes the \nlaws seriously. \nAs Jerome enters the o:::ice, \nJust touched. we focus on the doorhandle r.e r,as \n( CONTINUED I \nI \nt , . -CONTINUED \nJEP'C.'!E (VO) \nIf you refuse co d~sclose, chey can always \ncake a sample from a doorhandle ... \nVincent hesitates before shaking the PERSONNEL OFFICER's \noutstretched hand . \nJEROME IVO!' ... or a handsl1ake ... \nWe focus on Jerome's envelope attached to hls application for.n sitting on the Manager's desk. \n~~E;:<OME ( VO) .' . even the saliva off your application form. \nSitting opposite the manager, Jerome's face falls. The manager \nputs a clear, plastic cup In front of Jerome. \nJEROME {VOl \nBut for the most: part lYe know· who -we are-. \nAnd if all else fails, a legal drug test \ncan just as easily become an illegal peek \nat your future in the company. \nVincent saves the Manager the trouble and exits the office, \nleaving the cup where it SltS. "
    },
    {
      "id": 21,
      "title": "EXT. BEACH. DAY.",
      "location": {
        "primary": "BEACH. DAY.",
        "type": "ext"
      },
      "text": "EXT. BEACH. DAY.\n17-YEAR-OLD JEROME walkS up the beach to find lS-YEAR-OLD ANTON \nsittlng with the YOUNG WOMAN Vincent had previously dated. \nJEROME (VO) \nI didn't blame Anton for his free ride. You \ncan't blame someone for winning the lottery. \nThe Young Woman hastlly departs. \nLATER the two brothers face each other on the sand. Anton lS \nthe more statuesque of the two. \nANTON \n(cocky) \nYou sure you want to do this? \nVincent's answer is to walk towards the water. Anton smiles \nmockingly at his brother's grim \"game face\" and \nfollows. (CONTINUED) \n::-~m a:\"\\ aer~al 'JleW ''''e wac:!': ':I!ICENT and younger br::c~.e:-, .'-.:;:V::~l, \n3~lm teyc~d the breakers. \n~EF.OME I '.10 ) \nIe was the last time we swam :ogecher. \nOuc into che open sea, like always, \nknowing each scroke cowards the horizon \nwas one we had Co make back co the \nshore. Like always, che unspoken concesc. \n'ile watch the two young men swimming stroke for stroke, The\" \nswim Ear out, beyond the pOlont. Suddenly ANTON starts to 5 __ 'N, \nhis strokes becoming labored until he becomes rnotloonless In :~.e \nwater. He beglons to sl.nk ~ike a stone. VINCENT, :-eall.zl.ng \nAnton is no longer besl.de him, turns back to lend support. \nVincent takes hlom in a lifeguard hold and begins to nurse him \nback to shore. Finally the two boys are coughed up into the \nshallows. They collapse, Just beyond the waterline, exhausted, \ngasping for air. ANTONIO and MARIA arrive on the scene. ANTON \nis the: first to recover while VINCEN'I' clutches his side, his \nface screwed up In pain .. Maria' kneels down 'and starts to \nadminster to Vincent but his 'father, Antonio, is unable to \nconceal his anger and conta~pt for Vincent. \nAN'!'CNIO \nVincent, you damn fool! You could have killed \nAnton wloth your rl.diculous contest! Why should \nhe risk his life to save yours?~ When are you \ngoing to get it :hrough your thick head--you \ncan't compete with your brother! Why try?~ \nMaria takes Antonio aside. Anton and Vincent exchange a look. \nAN'roN \nWhy didn't you say anything? \nV!~<CE.'JT \nWhy didn't you? \n(starlong back at his father knowingly) It's okay. It'S the way they want it. \nJEROME IVO) \nIt confirmed everything in the minds of \nmy parents -that they had taken the right \ncourse with my younger brother and the \nwrong course with me. Ie would have been so \nmuch easier for everyone if I had slipped away \n-at day. I decided to grant them that wish. \n:::::r. HeME. !JIGHT. \n~VTCN stands at t~e ~ntlepiece i~ the dimly-lit llvlng room. \nHe ga::es at a framed :amlly portrait: -'hncent:' s face has ~een \nt8r:1 out of It. :i.e suddenly spies \\tINCENT exiting :he E::-or.t \ngat:e, carrying a su:.:case. M.ton goes to shout '/lnCent' s name \nbut: the words don't get out. "
    },
    {
      "id": 22,
      "title": "EXT. GATTACA. DAWN.",
      "location": {
        "primary": "GATTACA. DAWN.",
        "type": "ext"
      },
      "text": "EXT. GATTACA. DAWN.\nA pick-up truck, packed · ... i th a C:'EANING CREW, pulls lnto the \nrear of the bUllding. They are no longer strictly the mlgrant \nworkers we have come to expect but rather a mixture of \nethnlcities -all m~~ers of a genetic underclass that does not \ndiscriminate by race. \nAs VINCENT exits the truck and turns towards the camera, · ... e \ndiscover that he has now matured into the man we have come to \nknow as JEROME. The only vislble differences are the glasses he \nwears and his hair, still naturally dark. \nJEROME (VO) \nLike many others in \naround a lot in the \nwork where I could. \nhalf the tOllets ~n my situation, I moved' \nnext few years,' getting \nI must have cleaned \nthe state. \nWe follow VINCENT through the course of a day. Cleaning \nrest rooms , toilets, plcking up lltter, sweeping, washing \nwindows -gazing at the AEROSPACE WORKERS below. The building \nis part of the Gattaca faclllty, located near a shuttle launch \nsite. Throughout the day, wlth the regularity of 747's, Vincent \nspies rocket ships In the distance, launching into the sky. \nJerome's is the only head that turns and looks up. Long after \n. the sun has set, Vincent is still working. Another rocket ship \n.: lights up the darkness. Vlncent gazes forlornly into the \nheavens. "
    },
    {
      "id": 23,
      "title": "EXT. GATTACA -GLASS WALL. DAY.",
      "location": {
        "primary": "GATTACA -GLASS WALL. DAY.",
        "type": "ext"
      },
      "text": "EXT. GATTACA -GLASS WALL. DAY.\nVINCENT cleans a window from tr~ outside, staring in at the \narrogant GATTACA EMPLOYEES entering the security channelS -\na sample taken from their fingertips. Jerome, in a trance, \nconstantly cleans the same spot of glass. He fails to notlCe an \nOlder Janitor, CAESAR, appear beside him. \nCAESAR \n'dhen you clean the glass, \nclean it teo well. Vincent, don't \n(CONTINUED) \nI (confused) \n' ...... nat do you mean? \nCAESAR \n(glanc~ng co the Gatcaca workers) \nYou mighc get ideas. \nVDICENT \nBut if the glass ~s clean, ic'll be easier \nfor you to see me when I'm on the other \nside of iC. \nCaesar smiles aC Vincenc's cockiness. "
    },
    {
      "id": 24,
      "title": "INT. GATTACA. DAY. :5",
      "location": {
        "primary": "GATTACA. DAY. :5",
        "type": "int"
      },
      "text": "INT. GATTACA. DAY. :5\nVINCENT empties garbage into a dumpster adjacenc Co Gattaca. \nHis attention is drawn co something in the trash. A discarded \n.manual on Celescial Mec~.anlcs and Navigation. He .wipes·.f::lod· \nresidue off the corner. ' "
    },
    {
      "id": 25,
      "title": "INT. ASTRONOMY & TELESCQPE SHOP. DAY.",
      "location": {
        "primary": "ASTRONOMY & TELESCQPE SHOP. DAY.",
        "type": "int"
      },
      "text": "INT. ASTRONOMY & TELESCQPE SHOP. DAY.\nA forest of telescopes on cn.pods In an astronomy shop. 'JINCE~r. \nenters the store wich a bucket and squeegee and immediately goes \nco clean the storefront window. The STORE OWNER looks up from \nhis tabloid -'STAR\" magaz1ne. \nOWNER \nWhere's Earl? \nJEROME \nHe fell. Lucky 1C was only che second floor. \nThe owner nods and returns to his magazine. When he looks up \nagain one of his tripods 1S missing ics telescope and Jerome 1S \nnowhere to be seen. "
    },
    {
      "id": 26,
      "title": "INT. IN-VALID HOUSING PROJECT. NIGHT.",
      "location": {
        "primary": "IN-VALID HOUSING PROJECT. NIGHT.",
        "type": "int"
      },
      "text": "INT. IN-VALID HOUSING PROJECT. NIGHT.\nJEROME returns to his bare apartment. He removes the cloth \ncovering the bucket to reveal a dumpy-shaped telescope snugly \nwedged inside. He starts to pour over his collection of \ntextbooks. Other tact ered space paraphenalia adorns the ',.,;a ,,1. \n(CONTINUED) \n.. 8£ cou:-se t.~e tes: :es~ sccre i:1 the wcrld \n','y'asn I t gc~\" ..... g :~ ~e: ,-:-:e ':,,'1 t\"i-;e front deer \nr...:.nless :: .~ad :.':e t':':cd :esc: :0 go wic:.iJ. It . "
    },
    {
      "id": 27,
      "title": "EXT. GATTACA. NIGH\".",
      "location": {
        "primary": "GATTACA. NIGH\".",
        "type": "ext"
      },
      "text": "EXT. GATTACA. NIGH\".\nWhile his fellow · .... CRKERS 5~t. on t.he st.eps at t.he senllce \nentrance to Gattaca, ~ass~~g around an unlabeled bot.tle of ~iear \nliquor, VINCENT si~s sc~e d~st.ance away studying his text book. \nIn the absence of a ~::;::-.;::'..::er, he practises typl.ng commands cn a \nkeyboard handdrawn ::;~ :~e ::ap of a cardboard box. \nA tiny seedy-looking ::-.an, GEP.MAN, forties, appears from \nnowhere and takes a sea: =es~de him. \nGE:?_'W'J \nlofferlng his hand) \nVincent, I'm German--\nlanticlpatlog Vincent's response) \nThat's my name. . \nHe looks the apprehens 1 'Ie '!lncent up and down, \n'l:~CE~ \n;oJhat do yeu t.hlnk? \nG ::?~v.A.. '.J \n(shru.gs) \nI think I could do something \n(glanclng to t.he t.ext book) \nprovided you knew what you're doing \nand you can meet :he terms. \n'hncent pulls a plastic e-meney card from his overalls. \nGEru'.AN \nYou got a photo of yourself? \n'!lnCent produces a snapshot of hlmself -torn from the farnl.ly \nportral.t. German feeds the snapshot into the pocket-sl.zed \ncomputer he carries. \"he picture is instantly scanned and \nappears on the computer's small color screen. German returns \nthe photograph and hastily departs. \nI CONTI~ruE~ I \n. . ::NTlNUED \n:~£SAR, :~e elderly ~an~:=~, notices German's ex~t. \n:.;.ESAR \n(to Vlncent) \nI thought I told you not to get any ldeas . "
    },
    {
      "id": 28,
      "title": "EXT. GATTACA. NIGHT. -'",
      "location": {
        "primary": "GATTACA. NIGHT. -'",
        "type": "ext"
      },
      "text": "EXT. GATTACA. NIGHT. -'\nHigh up the side of a building, washing windows, 'IINCE~IT \"auses \noccasionally to practise typing commands on his cardboard keys -\nviewing a screen in his imagination -or the nlghtsky :tselE. \nHe hears his name belng called. \nGERMAN \n\"incent ... Vincent ... \n'/INCENT \n(staring' through his glasses) \nGer.c~n, is that you? \nGERMAN \nVincent, come down. I've found hlm. "
    },
    {
      "id": 29,
      "title": "INT. IN-VALID HOUSING PROJECT. NIGHT.",
      "location": {
        "primary": "IN-VALID HOUSING PROJECT. NIGHT.",
        "type": "int"
      },
      "text": "INT. IN-VALID HOUSING PROJECT. NIGHT.\nGERMAN leads VINCENT through a maze of corridors. \n\",-EROME (VO) \nFor the genetically superlor, success \nis easier to attain but is by no means \nguaranteed. After all, there is no gene \nfor fate. And when, for one reason or \nanother, a member of the elite falls on \nhard times, the1r genetic identity becomes \na valued commodi:y for the unscrupulous. \nOne man's loss 1S another man's gain. \nHe gives a conspiratorlal nod to another passing DNA BROKER, \nboth men carrying thelr palm-top computers. \nGERMAN \n(enthuslastically reading from data on \nhis portable screen as he walksl \nHe has the heart of an ox. He could run \nthrough a Goddamn wall--if he could still run. \nActually, he was a big college swimming star. \n( CONTItlUED ) \n.' ccmINUE:J \n......... .-..... -....... 1.-::. ••• \nI ~ope he's ~ct :~St a bcdy, \n\\3ER..~~ \nNo problem. Before he dropped out he ',.,as \nan honor student, the ~~ght majors--\n'I INC EN:' \nHow do I square the accident? \nGER.\"lAN !still reading data from his \npalm-top computer) \nIt happened ~n Australas4a. He checked \n4n yesterday. No family complications, no \nrecord he ever broke his neck. As far as \nanybody's concerned, he's still a walking, \ntalking, fully-productive member of sOC4ety. \nYou Just have to get him off the pipe and fill in the last two years of his life. \n(correcting hi~self) \nExcuse me, your 14fe. \nGerman has stopped walking as if they have arrived. \n'lI NC EN'! \n(looking around for a likely \ncandidate but finding none) \n'.-Jhere is he? :3 \nGerman reaches towards a PARAPLEGIC sitting in his wheelchair \nin the stairwell dlrectly 4n front of them, his head slumped, an \nincriminating bong nestled in his lap. German pulls the man's \n. head up by the hair. EUG~~. Despite the patchy, unkempt \n':beard and thick glaze over his eyes he bears a striking \nsimilarity to Vincent. '14ncent holds a mirror beside the face \nof the lethargic Eugene to compare his own reflection. \nGERMAN \n(smiling confidently) \nWhat did I tell you? Which one's the mirror? \nVINCE:N'I' (still not fully convinced) \nThat's the hair color in his profile? \nGerman checks an entry in his computer: • HAIR: BLONDE', \n( CONTI NUED I \n.. '{eah. \n(touch~~g h~s own dark strands) I'd have to bleach my hair. \nGERHAN \n(irr~tated, impatient) \nWhy are you inventing problems? You t'</O \nare a couple of goddam clones. You look \nso right togethpr, I want to double my fee. \n'JU1CENT \n(a thought occurs, address~ng the \nparaplegic for the first t~me) \nHow tall are you? \nEUGENE \n(deadpan) \nFour foot six. \nVincent gr~ns, realizing that Eugene is referr~ng to his seated \nheight. There ~s an instant connection between the two men. \nVI NCE!IT \nOkay, how tall did you ~sed to be? \nEUGENE \n(apathet~c, still under the \ninfluence of whatever he'S been smoking) \nSix one. \nVINCENT \n(to German, disappointed) \nHe's too tall. \nGER1-IAN \n(shrugs) \nYou can wear l~fts. \nVINCE.'IT \nEven with lifts I'm never that tall. \nVINCENT \nEvery ID he's ever had will say six one. \nGER.\"'.AN \n7here's a way. \n.. INT. 3ACKS7REET ,S'\\..,,?,GERY. ~::GHT . \nI:1 a. p::-i:nit;\"le operatir-.g t~eatre. V~NCENT lies on a ,:able. [\":':'.5 \ncower ~egs masked off for surgery. The SURGEON sw~~ches C~ ~ \nsurg~::~l saw and l:nes 1: '~p Wl~h handdrawn inc:slon :narks. \nMetal s~ruts are =eady to e:ongate h~s legs . "
    },
    {
      "id": 30,
      "title": "INT. IN-VAID HOUSING PROJECT -APARTMENT. DAY.",
      "location": {
        "primary": "IN-VAID HOUSING PROJECT -APARTMENT. DAY.",
        "type": "int"
      },
      "text": "INT. IN-VAID HOUSING PROJECT -APARTMENT. DAY.\nGE~~ wheels the dazed EUGENE into the apartment, c~ut:ered \nw~th space parapnenalia. One wheel of his rusting wheelcna:r :5 \nflimsily held on '..Jlth wire. VINCENT follows behind on crut:::--.es. \nboth lower legs ~n casts and cross-braces. Vincent signs che \ncontract German puts in front of him. "
    },
    {
      "id": 31,
      "title": "EXT. STREET OUTSI~E A BAR. DAY.",
      "location": {
        "primary": "STREET OUTSI~E A BAR. DAY.",
        "type": "ext"
      },
      "text": "EXT. STREET OUTSI~E A BAR. DAY.\nEUGENE, glassy-eyed, str~des out of a bar, past camera and into \nthe street. We hear a squeal of brakes and a sickening thud. "
    },
    {
      "id": 32,
      "title": "INT. HOUSING PROJECT -APARTMENT. DAY.",
      "location": {
        "primary": "HOUSING PROJECT -APARTMENT. DAY.",
        "type": "int"
      },
      "text": "INT. HOUSING PROJECT -APARTMENT. DAY.\nEUGENE awakens with a scream, bathed in sweat, arms bound to a \nbed -the only real piece of furnHure in the room. '1INCE.\"IT. \nsitting on a crate beside h~m, soaking a towel in a bowl of \nwater, is taken by surpise. Eugene continues to scream and \nthrash, fighting aga~nst h~s bindings. Vincent stuffs the towe~ \n~nto Eugene's mouth and holds onto his arms. \nJEROME (VO) \nI confess, ac :irsc I wondered if I had rescued \na man who was already dead. "
    },
    {
      "id": 33,
      "title": "INT. HOUSING PROJECT -APARTMENT -BATHROOM. NIGHT.",
      "location": {
        "primary": "HOUSING PROJECT -APARTMENT -BATHROOM. NIGHT.",
        "type": "int"
      },
      "text": "INT. HOUSING PROJECT -APARTMENT -BATHROOM. NIGHT.\nVINCENT holds EUGENE's head over the toilet bowl as he vomits \nviolently. Eugene's paralysis and Vincent's broken legs make \nthe operation doubly difficult. \nF:nally Eugene has nothlng left in his stomach to vomit. He \ndrops to the floor in exhaustion. Vincent, also exhausted frem \nthe effort of holding Eugene over the bowl, joins hlm on the \nbroken linoleum. Both men stare up at the ceiling that carries \na map of the constellatlon. \n\\'INCENT \nYou okay, Jerome? (CONTINt:E: 1 \nthel:::- ::-,ut' .... al l:r.mobill.ty) \nYeah. You ~a~~ :0 ~o danclng tonight? \n'hncent smiles. "
    },
    {
      "id": 34,
      "title": "INT. HOUSI~iG P?O-:EC:- -.!..::.'.R~El'IT·. NIGHT.",
      "location": {
        "primary": "HOUSI~iG P?O-:EC:- -.!..::.'.R~El'IT·. NIGHT.",
        "type": "int"
      },
      "text": "INT. HOUSI~iG P?O-:EC:- -.!..::.'.R~El'IT·. NIGHT.\nEUGENE turns his nose ~~ at :he plate of boiled meat and \npotatoes that V:;:~JCE~::- ~·..::s 1n :ront of him. Vincent catches ::-:e \nlook. \n':::!CENT \niJhat's wrong ''';l:h it? \n:::·\":3E:IE \nI think I'd betcer choose the menu, After all, \nyou're learn~ng how to be me, I'm not learnlng \nhow to be yeu. \n·./:~JCENT \n(shrugs) \nSui t yourself. \nEUGENE \n(c~/.ng :0 be more diplomatic) \nLlsten, I den'': · .... ant you to think I'm ungrateful \n--I know you and :hat llttle broker--what do you \ncall him? \nGerman, \nEUGENE \nYou're both go.ng to a lot of trouble--\n(trylng to be tactful) \nMaybe you can con somebody into believing \nyou're me to get your foot 1n the door--but \nonce you're ~ns1de, you're on your own, I'm \nsure you're Slncere .. , \nIglanc1ng to the space paraphenalla) ... but ! was being groomed for something like \nthis myself. Even without the accident I don't \nthink I would have made it. My point is--how the \nhell do you expect to pull this off? \n(CONT:~rCED I \nI , \n• \nJ I , \n. \" , \" .-\nC:)NTINUED \nJer::me merely stares back as lof the thought of Eal.L.:re r:as :'.e·:er \nsc=ur=ed to him. \nV:~lC=':~ \n(shrugs and states it simply) \nI don't know exactly, Jerome. \nEUGE.-rE \nIlaughlong) \nAt least you're honest. \n(a thought occurs) \nCall me by my mloddle name--Eugene--If you're \ngOing to be Jerome, you may as well start \ngetting used to it. \nNB: FOR THE REMAIllDER OF :-HE SCREENPLAY \"VINCENT\" IS REFERRED \nTO AS \"JEROME\". "
    },
    {
      "id": 35,
      "title": "INT. HOUSING PROJECT -\" APARTMENT. NIGHT.",
      "location": {
        "primary": "HOUSING PROJECT -\" APARTMENT. NIGHT.",
        "type": "int"
      },
      "text": "INT. HOUSING PROJECT -\" APARTMENT. NIGHT.\nJEROME 100;',\"\" through Eugene' s person~l,. ef fects, . including a \nphotograph album. He is drawn\" to a swimming medal lnside the \nalbum at a page displaYlng a photo of a wealthY, austere \nMOTHER -Eugene eVldently comes from money. \nEven as he wheels lnto tr-.e room in his rickety wheelchair · .. e see \nthat EUGENE has the bearl.ng of someone of good breeding. He has \na bag of blood on his lap. More blood loS being drawn from his \narm through an IV. Eugene catches Jerome looking at the alb~. \nJ:::ROME \n(guiltily closing the book) \nI have to know where you come from. \nE:JGENE If anybody asks, tell them the truth-­\nyour family disowns you. You are a \ndisappointment, Jerome. \nJEROME \nIreferrlng to Eugene's medal, impressed) \nWhat about this: \nEUGENE \nWrong color. :t's silver. \n(CONTINUED) \nEt:GE:-rE \n(tosSlng ~~e bag of blood to Jerome! :t's not easy llv:ng up to this. \nEugene ..... heels a ..... ay. "
    },
    {
      "id": 36,
      "title": "INT. HOUSING PROJECT -APARTMENT. DAY.",
      "location": {
        "primary": "HOUSING PROJECT -APARTMENT. DAY.",
        "type": "int"
      },
      "text": "INT. HOUSING PROJECT -APARTMENT. DAY.\nJEROME practises ..... riting ..... ith his right hand, trying to \nreplicate Eugene's slgnature. \nEUGENE \ni ..... heellng by, looklng over Jerome's \nshoulder at the signature) \nIt needs ..... ork. \nJERCME \n(rueful) \nYou had to be a right-hander. \nEUGENE· \nNoone orders southpa ..... s anymore, "
    },
    {
      "id": 37,
      "title": "INT. HOUSING PROJECT -APARTMENT. DAY.",
      "location": {
        "primary": "HOUSING PROJECT -APARTMENT. DAY.",
        "type": "int"
      },
      "text": "INT. HOUSING PROJECT -APARTMENT. DAY.\nA pair of spectacles lie on the bed. JEROME, still wear:ng hls \ntWln casts, sits behind an optometrist's portable examining \ndevice. GERMAN hovering ln the background, an OPTOMETRIST \ncustom-fits JEROME wlth gossamer thin contact lenses, \nJE.\"lOME (Va) \nMYopia is a dead glveaway -one of the earliest \nand most justifiable of the quality-of-life \ncorrections. Anybody with impaired vision is \ncertain to be suffering from all the other \ndeficiencies of a ·nonadvantaged· birth. \nGERMAN \n(inspecting the lens in Jerome's eye) It's no good. I can see all edge. He may as \nwell walk in there with a cane. \n.-INT. HCUS:NG PRO\";EC:- -.:'.P.!..-q~ENT. :AY. \nThe Optometn.st has been replaced in the livJ..ng room ,.,ith a \nBLACK MARKET DENTIST ,.,ho bonds JEROME's small, gapped teet:-t:o \nmatch EUGENE's perfect:y stralght, white plcket :ences. "
    },
    {
      "id": 38,
      "title": "INT. HOUSING PROJECT -APARTM~~. DAY.",
      "location": {
        "primary": "HOUSING PROJECT -APARTM~~. DAY.",
        "type": "int"
      },
      "text": "INT. HOUSING PROJECT -APARTM~~. DAY.\nHair already bleached and cut to match Eugene's hairstyle. \nJEROME sits in a chal:' against a hastlly erected whlte paper \nbackdrop. From his wheelchair, EUGENE puts the finlshing \ntouches to Jerome's hair. He wheels himself out of the way. \nThe final accomplice J..n Jerome's deception, a BLACK MARKET \nCOMPUTER GRAPHICS DESIG~~R, takes Jerome's photo with a video \ncamera. Manipulating the captured image, the Designer morpns \nJerome's face into the :ace of Eugene. The resulting photo that \nspits out of a printer 1S neither one nor the other but an \nacceptable combinatlon of the two. "
    },
    {
      "id": 39,
      "title": "INT. HOUSING PROJECT -APARTMENT. DAY ..",
      "location": {
        "primary": "HOUSING PROJECT -APARTMENT. DAY ..",
        "type": "int"
      },
      "text": "INT. HOUSING PROJECT -APARTMENT. DAY ..\nEUGENE is starting to prepare Jerome's specimen bags for the \nfirst time. He winces ln paln as he plucks several halrs from \nhis head. JEROME, new out of his casts, prepares Job \napplications. \nEtiGENE (still grlmacing, referring to the follicle3) \nYou really need that much? \nJEROME \nMore than that. You'll get used to it. \nEtiG~\"IE \n(yanklng out another hair) \nGod, what wouldn'c you do to leave this planet? \nJEROME \n(inspectlng a hair follicle) \nLeave? Just a few million years ago every atom in \nthis haJ..r--in our bodies--was a part of a star. \nI don't see 1t as leavlng. I see it as going home. \nEUGENE \n(marvelling at Jerome's earnestness) \nGod, you're serious, aren't you? \nJerome 19nores him. Having learnt his lesson, he hands the \nenvelopes to EUGENE to llCk the flaps. \n.. :~IT. HCUS:~;G PF.C\";:::C\":' -A?:\".F.~E~IT. CAY. \n';::RCME is dc~ng a las;:-m~:-.ute cram on a geriatric ccmpu:er ::::r:I \n,:~e ~ate 1990's. C::ecki:-.g ::-.e tlme, ';ercme hurriedly Pl::KS-\"P \n~~e s~~rt that EUG:::~~ tas been i=on~~g f~om a prone pcs~::=~ :~ \nthe floor. \nJEROME It's not too late to back out. \nEUGENE \nYou don't know '\",hat a relief it is not to \nbe me. Are you sure you want the Job? \nJerome contemplates the question for a moment. \nJEROME \nWhat about you? ~~at's ~n this for you, Eugene? \nElJGENE \n(referring to the bladder \nListen, I bag this stuff anyway. \n. as well pay. my rent. bag he wears) It may \nJerome hurries to the bathroom where, with some difficulty, ::e \ninserts his urine device for the first time. The new improved \nJerome emerges into the living room ready for his interv~ew. "
    },
    {
      "id": 40,
      "title": "INT. GATTACA CORPORATION -TESTING LAB. DAY.",
      "location": {
        "primary": "GATTACA CORPORATION -TESTING LAB. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA CORPORATION -TESTING LAB. DAY.\nJEROME emerges from a bathroom and hands a TECHNICIAN his \nplastic cup full of fraudulent ur~ne and inserts ~t into the \nanalyzer. \nTECHNICIAN \n(reading off the profile) \nCongratulations. \nJEROME \n(perplexed) \nWhat about the interview? \nTECHNICIAN \n(referring to the cup) \nThat '\",as ~t. \n::6 \n':E:ROME. SC3.!\"cely ab2..e ::: j:3-;;\":':'Se h~s delight. ex:.ts ,'::iattaca, \n'::\"\"/:r.g i.ot t.o st.a:-e at :he sl.;.per-b spec:.:nens \"..,.rho are r.O·nI :':'3 \n.::Q 1:' eagues •. \n...~=R':'.'-!E ; ·/C) \n7\"he :najcr~:y c: people are now made-co-crder. \n;./hat began as a :r.eans co rId society of \ninhericab~e i~seases has become a way co desl~n \nyour offsprl;;~--:.':e \":':':1e between healch and \nenhancemenc t1~rred forever. EYes can always be \nbrighter, a VOIce purer, a mind sharper, a body \nstronger, a ~.:.:e ~onger. ~Jeryone seeks co glve \ncheir Chl~d :,':e besc c.'lance but the most ski~led \ngenetiCIscS are cnly accessible to the pr~veleged few. \nIn a nearby park MODES ~~ILDREN from MODEL PARENTS play \ntogether, \n~-=:HCME (Va) \nAnyone who IS the product of an al.tered \nDNA is proud\":y refe~red co as a 'DAN', 'self -made ::-..3:1 or :NCirlCIIl', ':nan-child', \nINT, HOUS!NG ?RO~EC7 -A?AR~ENT. NIGHT, \nJEROME wheels EUGEtffi out of t~e~r housing project. He take~ ~n \nthe neighborhood :or che ~ast tl~e. ~e focus on a POOR COUPLE \ncradling an INFANT. \n, .. :'ERCME (VO) \nThose parents who, for moral or, more likely \neconomic reascns, refraIn from tampering wich \ntheir offsprIng's genetic makeup or who fail \nto abort a deprIved fetus condemn their children \nto a life of rcutine discrimination, \nWe glimpse other PEOPSE 1n the neighborhood. They appear poor \nbut, for the most part, physically normal. However a pall of \ngloom hangs over them. \n,,\"£HCME IVai \nOfficially they are called 'In-Valids'·, Also \nKnown as '~oddllldren', 'men-of-god', 'faith births', \n'blackjack bIrt.'s', 'deficients', 'defectives', \n'genojunk', 'ge-gncmes', 'the fucked-up people'. \n[. \"!N-vALIO' pronounced as ~n \"an invalid license\"] \n(CONTINUED) \n... 7E .. :;\"C .. 'IvfE !' ~/O) \n71'Jey are the \".'leal thy ill\". They den' t \nactually have anything yet -they .~y never. \nBut since few of the pre-conditicns can be \ncured or reversed, it is easier to treat them \nas if they were already sick. \nAs they enter a car, driven by \nyoung GIRL, 11, sitting on the \nstaring forlornly into space. \nany deficiency, she is somehow GERMAN, Jerome spl.es a beaut 1. :\".11 \nsteps of the houslng proJecc. \nWhile there is no outward slgn sE \naware that she is damaged goods. \nJerome glances in the rea~,iew mlrror. \nJEROME (VO) \nI am a member of a relatively new and \nparticularly detested segment of society. \n-one of those who refuses to accept my \ngenetic destiny. I am most commonly known \nas a \"de-gene-erate\" or a \"borrowed ladder\". \nJerome looks to Eugene, also lost ,in hi's ,own thoughts. \nJEROME (VOl \nBy means of a donor I have cheated the \nsystem for the last four years to open doors \nthat would otherwise be closed to me. \nJerome wheels Eugene into the palatial condominium complex where \nthe two men now resl.de. "
    },
    {
      "id": 41,
      "title": "INT. GATTACA. PRESENT DAY.",
      "location": {
        "primary": "GATTACA. PRESENT DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA. PRESENT DAY.\n':We return to JEROME's reflection in the glass. Other GATTACA \nEMPLOYEES are gradually gathering behind him. \nJEROME {VOl \nIn the guise of Jerome Morrow I have risen \nquickly through the ranks of Gattaca. Only one \nof the Mission Directors has ever come close \nto discovering my true identity. \nWe now see what Jerome has been gazing at through the window \nthe whole time -the sight that has brought a hush to the \ncomplex. Through an open office door lies the body of a large \nman -the MURDERED DIRECTOR, lying where he has just been \ndlscovered. in a pool of his own blood. \n(CONT!NUED) \nCONTINUE:) \n,,-ERC.'fE ','0) \nStrange to c:unk, he :nay have :nore success \nexposing .'TIe i.~ death ::han he d~d in ~ife. \nJerome wipes his eye and also goes to ~nvestigate. tie foc'.ls en \nan extreme close up of h~s EYELASH. Loosened by Jerome's ~and. it breaks free and floats gently down to the floor where \"t \ncomes to rest. "
    },
    {
      "id": 42,
      "title": "INT. GAT'!'ACA AEROSPACE CORPORATION. MORNING.",
      "location": {
        "primary": "GAT'!'ACA AEROSPACE CORPORATION. MORNING.",
        "type": "int"
      },
      "text": "INT. GAT'!'ACA AEROSPACE CORPORATION. MORNING.\nDETECTIVE HUGO, late-forties, wearing a cr~me-scene hygen~c su~t \nand gloves and a full clear mask -looklng more like a surgeon \nor a toxic waste worker than a detective -places a blood­\nspattered computer keyboard alongside the Director's shattered skull. The indentations match the blunt corner of the keyboard. \nHugo detaches the dangling keyboard from its parent computer and \nseals the likely murder '\"eapon in a marked, transparent plastlc \nbag. \nA CREW of similarly-suited homicide detectives systemat~cally \nvacuum the surrounding office area with metallic, industrlal­\nlooking mini-vacs. Once each work space has been vacuumed, the \ntransparent plastic vacuum bag ~s detached, sealed and labelled. \nOTHER DETECTIVES video the scene with camcorders. Video prints \nspit out of the cameras for instant inspection, "
    },
    {
      "id": 43,
      "title": "EXT. GAT'!'ACA -LANDSCAPED GARDENS. DAY.",
      "location": {
        "primary": "GAT'!'ACA -LANDSCAPED GARDENS. DAY.",
        "type": "ext"
      },
      "text": "EXT. GAT'!'ACA -LANDSCAPED GARDENS. DAY.\nA silicon police tape cordons off the crime scene. From the \n. landscaped garden, a crowd of GAT'!'ACA EMPLOYEES view the \n':proceedings through the glass walls. \nEMPLOYEE 1 \n(staring at the Director's body) \nAwful. \nEMPLOYEE 2 \nYeah, awful it didn't happen sooner, \nNervous smirks from nearby employees. We focus on JEROME. \nStanding slightly apart from the others, he does not appear to \nshare the joke, or perhaps even hear it. Jerome watches, wlde­\neyed, as a DETECTIVE approaches his work station with a minl­\nvac. A chill goes through Jerome as the detective's cleaner \n~asses over his desk. (CONTINUED) \nJerome ~s distracted by a smear on ~he window, obstructing h~s \nv~ew. ~~thout thi~king, he breathes on the glass and rubs che \nsmear 3.·\"ay ',,: th h:s elbow. Nearby, elderly : an~ tor, :.~SA.:~ \n~otlces Jerome's fast~dious act and reads the panlc ln Jerome's \neyes. DIREC7VR JOSEF suddenly appears at Jerome's shoulder. \nStanding a pace beh:nd the Director, computer notepad ~n hand, \nis IRENE. \nDIRECTOR JOSEF \nYou're lucky to be getting out of this. \nJEROME \nWe're stlll go~ng ahead as planned? \nDIRECTOR JOSEF \nThe launch window is only open unt1l week's \nend. Trag1c though this event may be, 1t \nhasn't stopped ·the planets turning. \nHe glances towards a group of Detectives headed by HUGO. \nDIRECTOR JOSEF \nYou'll have to excuse me, Jerome. 'I have to \nmeet with the author1ties--naturally, we're \nco-operating :n any way, although I won't \ntolerate a ~aJor disruption. \n(as he departs) \nI wish I was gOlng w1th you, Jerome. \nAs the pair depart, Jerome and Irene exchange a glance. Irene \n1S also aware of Jerome's unease. "
    },
    {
      "id": 44,
      "title": "INT. GATTACA -CORRIDOR. DAY.",
      "location": {
        "primary": "GATTACA -CORRIDOR. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -CORRIDOR. DAY.\nWe focus on JEROME's eyelash, still lying on the floor. \nA huge crescent-shaped hair that fills the screen. Suddenly \nthere is a roar of a m1n1-vac and the eyelash is sucked up. We \nfollow the eyelash's Journey, down the throat of the cleaner \ninto the specimen bag where it is sucked against the bag's \nclear, plastic wall. "
    },
    {
      "id": 45,
      "title": "INT. GATTACA -COMPUTER COMPLEX. DAY.",
      "location": {
        "primary": "GATTACA -COMPUTER COMPLEX. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -COMPUTER COMPLEX. DAY.\nThe DIRECTOR's corpse is sealed in a plastic bodybag and wheeled \naway on a gurney. The blood and other body matter from the \nmurder scene is sucked up by a portable wet-vac and the sample \nbag appropriately labeled. \n.. A chime sounds over the ?.;. :ollowed by an :lnnouncement. \n;'l~':Ct\"rNCER (OC) \nThank you :or your co-operat1on. Please \nreturn to your · ..... ork stations lmmediately. \nThe PROGRAMMERS get to t!1eir feet en masse and begin f illr.g l:-.~:J \nthe work room. \nEMPLOYEE 3 \n(sarcast1c aside) \nWhat, no counselling? "
    },
    {
      "id": 46,
      "title": "INT. GATIACA COMPUTER C8MPLEX -DIRECTOR'S OFFICE. DAY.",
      "location": {
        "primary": "GATIACA COMPUTER C8MPLEX -DIRECTOR'S OFFICE. DAY.",
        "type": "int"
      },
      "text": "INT. GATIACA COMPUTER C8MPLEX -DIRECTOR'S OFFICE. DAY.\nA WOMAN ASSISTANT whose keyboard was used in the attack has to \npause as a MAINTENANCE ~ORKER gives her work station a final \nspray to return it to its former pristlne condition. A new \nkeyboard is plugged into her mon1tor to replace the one taken as \nevidence. "
    },
    {
      "id": 47,
      "title": "INT. GATIACA COMPUTER COMPLEX. DAY.",
      "location": {
        "primary": "GATIACA COMPUTER COMPLEX. DAY.",
        "type": "int"
      },
      "text": "INT. GATIACA COMPUTER COMPLEX. DAY.\nJEROME opens his desk drawer to check his comb, now plucked \ncompletely clean. He carefully places two of Eugene's hairs t:J \nthe comb and scatters another bag of fraudulent matter around \nh1s work station. "
    },
    {
      "id": 48,
      "title": "INT. GATIACA -SIMULATOR ROOM. DAY.",
      "location": {
        "primary": "GATIACA -SIMULATOR ROOM. DAY.",
        "type": "int"
      },
      "text": "INT. GATIACA -SIMULATOR ROOM. DAY.\nIn a large, bare room a simulator does a slow dance back and \n':forth on its hydralic legs, miming the path of the space \ncraft Jerome will soon be aboard. The simulation ends and \nJEROME exits the simulator through a small door. IRENE \nhesitantly approaches, carrying a slim electronic tablet. \nIRENE \nExcuse me, Jerome. I'm sorry to bother you. \nJerome turns, not displeased by the interruption. \nJEROME \nNo bother. \n(CONTINUED) \nCSNTnlt:ED \n(~efe~~:~q to her ~otepad) \nI've been aSKed :::: ::::::r+Jlle a :og for the \ninvestigato~s --::-.ey · .... ant to know everyone's \nwhereabouts last ~lqht . \n.JERCXE \nLast night? ~ · ... as at home. \nIrene makes a note wlth her stylus. \nCan that be, e~. '1erlf::.ed? :-Jere you alone? \nJERCME \nNo it can't be 'Ie~lfied. Yes I was alone. \nIrene makes another ~ote. \nJEROME \n( ..... ry smile) \nLooks bad, doesn't·l:t, Irene? What about \nyou? Where were i'OU last night? \nI was at home. \nJERCME \nWere you alone' \nYes. IRENE \n(hesitant) \nJEROME \n(teasl.ng) \nSo we don't know for sure about you, either. \nNo. IRE..\"'lE \n(wary, wondering where the \nconversatl.on is headed) \nJERCME \nWhy don't we say we were together? , , \n~. \nIRENE \n(confused) \nWhy would we do that? (CONTINUED) \n. . CONTINUED \n-'::::?,Cr1E \nI have better ~hlngs to do thlS week than \nanswer the fOO:~5h questions of some flat:Qct, \ndon't you? \nIrene contemplates the question . \nJEROME \n(gently pressing) \nWell, shall we say we spent the evening together\" \nIrene 1S still unsure whether or not Jerome is serious. \nIRENE \nTo be convinc1ng, Jerome, I would have to know \nwhat that was like. \nIrene turns and departs: Jerome watches her go. "
    },
    {
      "id": 49,
      "title": "INT. EUGE~.~·S CONDOMINIUM. NIGHT.",
      "location": {
        "primary": "EUGE~.~·S CONDOMINIUM. NIGHT.",
        "type": "int"
      },
      "text": "INT. EUGE~.~·S CONDOMINIUM. NIGHT.\nThe paraplegic EUGENE. seated by the window, meticulously cuts \na long fingernail lnto n~~erous clippings. He places the \nclippings in small plastic bags and seals them. He then begins \nto fill tiny sachets with blood. He turns as he hears. JEROME \nenter down the spiral stalrcase wlth the groceries. \nE:JGENE \nYou didn't forget the truffles? \nJEROME places the items In the refrigerator in the bathroom and \nretrieves a bottle of vodka -the vodka incongruous-looking \nbeside the blood and urine specimens. Joining Eugene at his \n':workbench, he pours them both a drink. \nEUGENE \n(senslng something amiss, trying \nto keep his humor) \nWho died? \nJEROME \nThe Mission Director. \nEUGENE \n(misinterpreting the deadpan remark) \nYou wish. \n(CONTINUED) \n.. CONTINUED \n,hey fou~d hlID In his office this morn~ng-­\nbeaten so bad :hey had to check his name~ag. \nEugene takes in the news, a smile broadening across hlS :3ce. \nWhat an act \ncoImtunl.ty. \nbetween you EUGENE \nof benevolence--a service to the \nSo that's It. Now there's nothlng \nand ignition. \nJEROME \nHe was stlll warm when they confirmed. \nEUGENE \n(confused by Jerome's attitude) \nThis calls for a celebration. Doesn't it? \nJEROME \nThe place is crawling with Hoovers. \nEUGENE \nSo what? You didn't kill him, did you? \nJerome shoots hlm a glance for the inappropriate remark. \nJEROME \nThat's not the point. \nEUGE..\"IE \n( scofflng) \nHey, how much of you can be there? Even if the \n\"J. Edgars\" do find something, in a week-­\n(glancing up to the night sky) \nyou'll be slightly out of their jurisdiction . \n(gently chiding) \nCome on, we've got to get drunk iImtediately. \nJEROME (still tempering Eugene's enthusiasm) \nYou're going to have to earn your supper. I've got \nmy final physical tomorrow. \nJerome wheels Eugene's chair to a specially constructed platform \nthat allows the wheels to spin in mid-air. Jerome tapes an \nelectrode to Eugene's chest and attaches the wire to a slim \nrecording device. Eugene begins to spin the wheel of the chair \n.faster and faster. Jerome monitors Eugene's steady heartbeat \nthrough a set of headphones. "
    },
    {
      "id": 50,
      "title": "INT. GA,TI'ACA AERCSPAC::: CJRPCRA\"rrCN -CCMPUTER CCMPLEX. ,;IGHT.",
      "location": {
        "primary": "GA,TI'ACA AERCSPAC::: CJRPCRA\"rrCN -CCMPUTER CCMPLEX. ,;IGHT.",
        "type": "int"
      },
      "text": "INT. GA,TI'ACA AERCSPAC::: CJRPCRA\"rrCN -CCMPUTER CCMPLEX. ,;IGHT.\nThe complex ~s vi\"tually empty -only a handful of the hund\"eds \nof PROGRAMMERS wo~king late into the night. IRENE app~oaches \nJEROME's wo~k stat~cn on the p~etext of delive~~ng some \ndocuments. Trying to act casually, she looks unde~ che papers \non h~s desk, then opens the top desk drawer. \nWe see an EXTREME CLOSE UP of the comb lying there -the t· .... o \nhairs trapped between the teeth of the comb. Irene removes one \nof the follicles and drops it into an envelope she ~s carrying. "
    },
    {
      "id": 51,
      "title": "INT. 24-HOUR SEQUENC!NG LAB. NIGHT.",
      "location": {
        "primary": "24-HOUR SEQUENC!NG LAB. NIGHT.",
        "type": "int"
      },
      "text": "INT. 24-HOUR SEQUENC!NG LAB. NIGHT.\n\"SEQUENCING-WHILE-U-WAIT\". Similar to a l-hour photo lab, the \nstore -little more than a booth -displays a price list on the \nwall. \"FULL SEQUENCE -S80\". IRENE waits in line with a cross­\nsection of other CUSTOMERS. She checks the contents of the \nenvelope that conta~ns the hair. \nThe YOUNG WOMAN in l~ne ahead of her allows the TECHNICIAN to \ntake a swab from her full lips with a Q-tip. \nHow old? \nMe? TECHNICIAN \nYOUNG WOMAN \n(confused) \nTECHNICIAN \n(mustering patience, referring \nto the Q-tl.p) \nThe specimen. \nYOUNG • .... OMAN \n(proudly) \nI kissed him five minutes ago. A real good one. \nOverhearing, several PEOPLE in line snicker. \n':'ECHNICIAN \n(long-suffering) I'll see what I can do. \nThe technician hands the swab to an ASSISTANT. The Young Woman \nis handed a number and takes a seat. Irene hands her envelope \nover the counter. She too is handed a number. We follow \nJerome's follicle as another TECHNICIAN places it in an \nanalyzing machine. \n.. 1NT/EXT. SEQUENC!~;G L;\"3 / E'.;RK:~G LOT. NIGHT. \nThe TEC:tNIC:::.!u'l returr.s t:-.e envelcpe to IRENE along · .... i:h a \nmlniature compact dlSC. \nTECHNICIAN \n(r~~arking on the profile result) \n9.4 ... ve~/ nlce. \nIrene does not appear to share the technician's enthuslasm. \nShe emerges from the sequencing lab and enters her car. Tak:ng \na palm-top computer from her purse, she inserts the disc :nto \nthe computer. Jerome's counterfeit genetic profile appears on \nthe screen. The details confirm her worst fears. "
    },
    {
      "id": 52,
      "title": "EXT. MICHAEL'S DINNER CLUB. NIGHT.",
      "location": {
        "primary": "MICHAEL'S DINNER CLUB. NIGHT.",
        "type": "ext"
      },
      "text": "EXT. MICHAEL'S DINNER CLUB. NIGHT.\nJEROME and EUGENE, dressed to the nines, pull up in the car \nto a darkened doorway l~ a poorly lit street. A VALET appears \nout of the shadows. Familiar with the car, he goes immediately \nto the trunk to retrieve Eugene's collapsible wheelchair. \nJerome tips the valet - a credit card wiped through a device. "
    },
    {
      "id": 53,
      "title": "INT. MICHAEL'S DINNER CLUB. NIGHT",
      "location": {
        "primary": "MICHAEL'S DINNER CLUB. NIGHT",
        "type": "int"
      },
      "text": "INT. MICHAEL'S DINNER CLUB. NIGHT\nThe chic, elegant establishment inside belies its dark,ened \nexterior. JEROME wheels EUGENE into a decadent dinner club \nfull of an odd assortment of people. They are immediately \ngreeted respectfully by MICHAEL, the owner and maitre d'. \nJerome and Eugene are obviously regulars. \nMICHAEL \nGood evening, gentlemen. Your table is ready. \n(referring to Jerome's mission) \nNot long now, Sir. You'll be upstairs \nbefore you know it. We're going to miss you. \nJEROME \nNot as much as I'll miss your Stroganoff. I'd like to take one of your chefs with me. "
    },
    {
      "id": 54,
      "title": "INT. MICHAEL'S DINNER CLUB. NIGHT.",
      "location": {
        "primary": "MICHAEL'S DINNER CLUB. NIGHT.",
        "type": "int"
      },
      "text": "INT. MICHAEL'S DINNER CLUB. NIGHT.\nIn a secluded booth JEROME and EUGENE toast from a bottle of \n1999 vintage Bordeaux. Eugene drinks longer than Jerome. \nJerome dabs his mouth with a napkin. He fails to notice a \nminute FLAKE OF SKIN dislodged from his chin. We follow the \nflake as it comes to:rest beneath the table. (CONTINUED) \n~6 \nC:JNT!!1UED \n:'ATER, Eugene and Jer::me · .... atch CO(j?LES dancing a samba on :!1e \n::iance f :oor. A WAITER '/ac·.l\\.,r\",s the table with a discreet, \n!1andheld miniature '/ac.l\\.:Il\\ wh~le a WAITRESS clears ohe places. \nShe accidentally drops a Kn~fe onto Eugene's leg. \n~'JAI7R:::SS \n(aghast at the sight of his lifeless ~egsl \nI'm so sorry. :;~d: hurt you? \n(sm~l~ng, a trace of bitterness) \nHoney, if you'd hurt me, I'd be cured. \nEugene, the worse for dr~nk, gropes for the wa~tress's leg but \nshe easily avoids h~s cl~~y pass. \n::UGE:JE \nYou want to meet a real-life spaceman? \nJerome, always aware, scanning the club,_ suddenly spies \nNAPOLEON, his Gattaca colleague, on the other side of the \nroom. Napoleon is ta)ung -a hit -from a vial ·concealed in his· \nhand. Jerome abruptly turns his back to avoid being recognlzed. \nJERCME \nLet'S get out of here. \nEUGEI'<E \n(knock~ng back his drink, \nm~sinterpretlng the hasty departure) \nYou're right, there's more atmosphere \nwhere you're going. \n\", INT/EXT. CAR. NIGHT. \nDriving along the freeway, Jerome's car suddenly dives down an \nescape road. EUGENE looks s~deways at JEROME. \nJEROME \nYou drive. \nINT/EXT. CAR. NIGHT. \nThe car careens around and around a small circular building -\na cloud of dust billowing up behind the car. We focus on a \nBRICK wedged against the car's gas pedal. \n(CONTINUED) \n: CONTINUED .~ \n\" \nEUGENE is at the wr.eel. ';:::?CHE In : he passenger seat. \nThe hard t'-1rn lS repeated with lncreaslng recklessness. ::'~:;er.e \nflghtlng to control :he buck~ng car. \nEUGEo'<E \n(screaming in both fear and exhilaratlonl \nI gotta stoP!! r gotta Stop!. \nJERCME \nKeep going!! Keep going!! \nFinally the car spins to a halt in a cloud of dust. When the \ndust settles it is revealed that they have been circling the \nbase of a huge satellite dish in a desolate locat~on. "
    },
    {
      "id": 55,
      "title": "EXT. SATELLITE DISH .. NIGHT.",
      "location": {
        "primary": "SATELLITE DISH .. NIGHT.",
        "type": "ext"
      },
      "text": "EXT. SATELLITE DISH .. NIGHT.\nEUGENE lies on the hood of the car. leaning against the \nwindshield.· :irinking from a bottle of vodka. In the \nbackground~ the unmanned satellite dish.' JEROME relieves \nhimself against the bUl.lding at the base' of the satellite. \nEUGENE \n(gently chiding Jerome over the joyride) \nYou idiot. You could ruin everything \nwith a stunt like that. \nEugene spies a spacecraft launching from Gattaca city. \nEUGENE \n(gazing into the night sky) \nAt least up there your piSS will be worth something. \n(smiling ~t the thought) \nYou'll all be showering in it. right? \nJEROME \n(zipping his fly) \nAnd drinking it. It's like Evian by the \ntime it's filtered. \nEUGENE \n(referring to the rocket ship) \nWhat is that one? \nJerome doesn't bother to look l.n the direction of the craft but \nmerely glances to his watch. He joins Eugene on the hood of the \ncar. (CONTINUED) \nCCNTINUED \n11.15 -:EROME \n(looking ac \nco che porco \nEUGENE his wacch) \nA maincenance crew. \nHow long do you scay up there before you go? \n-:EROME \nA day or so. \nEUGENE \n(beaml.:lg) \nI still can't believe theY're sending you to \nthe Belt--you of all people--never meant co be \nborn, on a ml.ssion to discover the origin \nof life. -i8 \nEugene laughs to himself and passes the bottle to Jerome. \nJEROME \nYou should be going instead of me. \nJerome taps Eugene's lifeless legs with his foot. \nJEROME \nUp there they wouldn't be a problem. \nEUGENE \n(glancing heavenwards, shaking his head) \nYou know I'm scared of heights. "
    },
    {
      "id": 56,
      "title": "INT. CRIME LABORATORY -AUTOPSY ROOM. NIGHT .",
      "location": {
        "primary": "CRIME LABORATORY -AUTOPSY ROOM. NIGHT .",
        "type": "int"
      },
      "text": "INT. CRIME LABORATORY -AUTOPSY ROOM. NIGHT .\n. : The body and clothing of che MISSION DIRECTOR, lying on a metal \nexamining table is scanned with a blue-light magnifying \ninstrument. Fingernail specimens are taken for analysis. In \nanother area of the laboratory, the labelled vacuum bags are \nattached to analyzers and the contents sucked out and \nautomatically identified. ID names and photographs of GATTACA \nEMPLOYEES begin appearing on a computer screen at high speed \nalong with other personal details -all data aucomatically \nlogged for later review. \nThe photographs and personal details of JEROME and IRENE flash \npast, amongst the faces of other employees. \n(CONTINUED) \n: CONTINUED \nWe focus on a magnified close up of JEROME'S EYELASH, still \nclinging stubbornly to the side of its specimen bag. We \ncontinue to follow its journey as it ~s finally sucked ~r.to the \nanalyzer. "
    },
    {
      "id": 57,
      "title": "INT. CRIME LAB -ANALYZER MACHINE. NIGHT.",
      "location": {
        "primary": "CRIME LAB -ANALYZER MACHINE. NIGHT.",
        "type": "int"
      },
      "text": "INT. CRIME LAB -ANALYZER MACHINE. NIGHT.\nInside the machine, a minute, cell-thin sliver ~s sl~ced :rom \nJEROME'S EYELASH and analyzed. "
    },
    {
      "id": 58,
      "title": "INT. INVESTIGATOR'S CRIME LAB. NIGHT.",
      "location": {
        "primary": "INVESTIGATOR'S CRIME LAB. NIGHT.",
        "type": "int"
      },
      "text": "INT. INVESTIGATOR'S CRIME LAB. NIGHT.\nA severed HUMAN TONGUE sits on a tray in a sterile, sealed \nchamber. Using gloves that protrude through the chamber's glass \nwall, face buried in a binocular eyepiece, the INVESTIGATOR \ntakes a swab from the tongue. \nINVESTIGATOR \n(to the tongue, as he inserts the \ntip of the swab into an analyzer) \nLet's see what you' vegot to say fO.r yourself. \nA FEMALE ASSISTANT, looking on, hardly has time to smile at the \nremark before informat~on begins to appear on a nearby computer \nterminal. The computer gradually builds a portrait of the owner \nof the tongue using genetic predictors. The Investigator \nwanders over to the w~ndow as his Assistant reads the \ninformation from the screen. \nASSISTANT \nThe tongue is male. Mature. Blonde hair. \nBrown eyes. Light complexion, Between \n5'11 and 6'1. Pronounced Caucasian nose. \nThin lips. Weak chin. Lobeless ears. \nPrematurely balding. Slightly bow-legged. \nBroad shoulders. Barrel chest ... \nBlind. \nBlind? Ipause) \nINVESTIGATOR \n(interest piqued) \n(mildly amused, checking the \nmonitor for himself) \nThe tongue is blind? \n(CONTINUED) \nCONTINUED \nASSIS7A.'IT \n(confused) \nWho cuts out the tongue of a blind man? \nINVEST::GATOR \n(shrugs) \nSomeone who is mindful that the blind still speak. \nThe INVESTIGATOR is alerted by the chime of his nearby computer. \nOn the screen, he discovers the face of 20-YEAR-OLD VINCENT \nand the accompanying flashing message: TRACKING IN-VALID \n883000181105-10 -NEW DATA -"
    },
    {
      "id": 59,
      "title": "INT. CONDOMINIUM COMPLEX -PARKING GARAGE. NIGHT.",
      "location": {
        "primary": "CONDOMINIUM COMPLEX -PARKING GARAGE. NIGHT.",
        "type": "int"
      },
      "text": "INT. CONDOMINIUM COMPLEX -PARKING GARAGE. NIGHT.\nHaving plugged his car into an overnight charger, JEROME pushes \nEUGENE in his wheelchair to the elevator. Bottle in hand, \nEugene leans over and vomits on the ground. Jerome shakes his \nhead resignedly. Eugene looks drunkenly up at Jerome. \nEUGENE \n(sarcastically referring to the pool of vomltl \nI'm sorry. Did you want it? \nJerome meets EUgene's gaze. There is a trace of bitterness \nin Eugene's drunken smile. \nEUGENE \nLet me get it for you. \nEUgene bends down to scoop up some vomit with his hand but the \nelevator arrives and Jerome quickly wheels him away. Eugene's \n: head flops to the side as he passes out. "
    },
    {
      "id": 60,
      "title": "INT. EUGENE'S CONDOMINIUM. NIGHT.",
      "location": {
        "primary": "EUGENE'S CONDOMINIUM. NIGHT.",
        "type": "int"
      },
      "text": "INT. EUGENE'S CONDOMINIUM. NIGHT.\nJEROME unlocks EUGENE's condo and wheels his chair inside. We \nsee their reflection in a full-length mirror as Jerome pushes \nEUgene to the bedroom. After removing Eugene's soiled clothing, \nhe heaves the tall man from the chair and onto the bed. \nEUGENE \n(maudlin, gently sobbing like a child) \nI'm sorry. I'm sorry. \n(CONTINUED I \nCmlT:::~ruED \nJERC)1E \nlattemptl:-.g to comfort) \nIt's okay, Eugene. \nEUGENE \nYou know I 'wasn't drWlk--I knew what I was \ndoing when I walked in front of that car--\nJEROME \n--What car?--Go to sleep. \n--I walked rlght ~n front of it. I was never \nmore sober In my l~fe. \nJerome looks at Eugene's lifeless legs, trying to cover his \nshock at the revelat~on. \nJEROME It's all nght. \nEUGENE . \nIgrabb~ng Jerome by the collar) \nI'm proud of you, Vincent. \nEugene's head falls back onto the pillow. \nJEROME \n(smiling to himself) \nYou must be drunk to call me Vincent. \nBut Eugene does not reply, drifting into sleep once aga~n. \nJerome pulls a blanket over him. \nOn the verge of leaving, Jerome's attention is drawn to a wall 'on the far side of the room. Approaching the wall, near \nEugene's mirrored closet, he detects a faint mechanical whir \ncoming from inside the adJacent condominium. Jerome \ncontemplates investigating but exits the condominium instead \n-climbing the spiral staircase to his own condominium. "
    },
    {
      "id": 61,
      "title": "INT. JEROME'S CONDO -LIVING ROOM. NIGHT.",
      "location": {
        "primary": "JEROME'S CONDO -LIVING ROOM. NIGHT.",
        "type": "int"
      },
      "text": "INT. JEROME'S CONDO -LIVING ROOM. NIGHT.\nJEROME fastidiously vacuums with an upright cleaner. Using a \nhose attachment he cleans aroWld a picture frame that contains \nJerome's original computer keyboard handdrawn on the flap of a \ncardboard box. \nS2 "
    },
    {
      "id": 62,
      "title": "INT. GATTACA -COMPUTER CCMPLEX. DAY.",
      "location": {
        "primary": "GATTACA -COMPUTER CCMPLEX. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -COMPUTER CCMPLEX. DAY.\nIn the vast room of COMPUTER PROGRAMMERS we pull-focus to \ndiscover that we have been filming the complex through the \ntransparent specimen bag containing JEROME'S EYELASH. \nOn the mezzanine floor overlooking the scene of the crime, \nthe INVESTIGATOR holds the bag, transfixed by the lash. The \nlead homicide detective, DETECTIVE HUGO, finishes interv~ew~ng \na GATTACA SECURITY GUARD and approaches the Investigator. \nA large telescope in the background. \nAlthough Hugo is deferential to his more youthful superior, h~s \nbody language betrays his displeasure. Hugo clearly does not \nrelish the Investigator's involvement in his case. \nDETECTIVE HUGO \nI don't understand why you were dragged out \nhere, Sir. It's hardly worth wasting your \ntime--a no-nothing case like this. \nINVESTIGATOR \n(gently rebuking his subordinate) \nA ~n's dead, Detective. \nDETECTIVE HUGO \nOf course, Sir. We're checking the entry log, \nalibis, grudges ... \nINVESTIGATOR \nGrudges? \nDETECTIVE HUGO \n(looking out over the balcony) \nI look around, I see a lot of dry eyes. \nThe Director was not ... \n(search~ng for the words) ... universally loved. He was leading the \ncut-backs in the program. You're looking at \na room full of motives. \nINVESTIGATOR \n(shaking his head adamantly, \nreferring to the bag in his hand) \nNo, this is your man. \nDETECTIVE HUGO \n(not so convinced) \nWith respect, Sir--it may be the only \nunaccountable spec~men but the profile \nsuggests-- (CONTINUED) \n.. CONTINUED \nINVESTIGATOR \n--Whac about his profile? 53 \nHugo refers to a print-out of 20-YEAR-OLD VINCENT's proflle \nlncluding his Genetic Quotient. (The fifteen-year-old photo of \nVincent now bears little resemblance to his assumed identity. I \nDETECTIVE HUGO \nAccording to thlS, he's a sick man. Congenital \nheart condition. Who knows how long the specimen \nhas been here but there's an 80 percent chance \nthe owner of that eyelash has already died \nhimself from natural causes. \nINVESTIGATOR \n(terse) \nSo there's a 20 percent chance he's not dead. \nDetective Hugo goes to comment further, then revises his \nremark in his head before speaking. \nDETECTIVE HUGO \nEven if this Vincent Luca is alive, is it \nlikely he could bludgeon a man to death? \nINVESTIGATOR \nNo. Not likely. \nThe Investigator's tone suggests that the identity of the \nculprit is no longer a matter for debate. There is an awkward \npause before the Detectlve falls into step with his superior. \nDETECTIVE HUGO \nI take it you're thinking along the lines of a \nrobbery gone sour--a thief disturbed in the act? \nThe Investigator merely shrugs. \nDETECTIVE HUGO \n(skeptical) \nOf course that doesn't jibe with what we \nfound. This was an angry killing. \nINVESTIGATOR \n(glancing to the profile in Hugo's hand) \nWho knows with these \"deficients\"? His profile \nindicates a proclivity for violence. \n(CONTINUED) \n,. CONTINUED \nCE7ECTrJE HUGO \n(tryi~g to appear co-operative) I'll run a crossover on the eyelash for \nany Eam~ly or assoclate ccnnect~ons--\nINVESTIGATOR \n--I've already run it. There's no record \nof any living relative. \n:JETECTlVE HUGO \nWhat a pity. \nIt<VESTIGATOR 54 \n(irritated, glancing to the sample bag) \nDetective Hugo, it's a simple case of lost and \nfound. All we have to do is locate the man who's \nminus an eyelash and this murder will solve itself. \nWe focus on JEROME at his work station. Although he continues \nto work, he clearly feels the presence of the INVESTIGATORS on \nthe mezzanine floor behind him. \nA MEDICAL DIRECTOR approaches the programmer in the neighboring \nwork station -NAPOLEON, the programmer Jerome encountered in \nthe nightclub the previous evening. \nMEDICAL DIRECTOR \nNapoleon, you're late for your substance test. \nNapoleon looks up, ashen-faced. Jerome intervenes. \nJEROME \nDirector, Napoleon's helping me today. \n-The Director regards both men suspiciously. \nMEDICAL DIRECTOR \nWell, you take lt for him, Jerome. \nThe Medical Director departs. Napoleon, stunned by the \nrepr~eve, approaches Jerome's work station and pretends to \nstudy the program on h~s computer screen. \nNAPOLEON \nWhy did you do that? \nJEROME \n(exitl~g to the testing lab) \nDon't worry about it. \n. ' \n, , INT. GATTACA -TESTING LAB. ~AY. \nfrom behind we observe JEROME standing in front of LAMAR, \nissuing forth his steady stream of fraudulent urlne. 55 "
    },
    {
      "id": 63,
      "title": "EXT. GATTACA AEROSPACE CORPORATION -WORKOUT CENTER. DAY .",
      "location": {
        "primary": "GATTACA AEROSPACE CORPORATION -WORKOUT CENTER. DAY .",
        "type": "ext"
      },
      "text": "EXT. GATTACA AEROSPACE CORPORATION -WORKOUT CENTER. DAY .\nTwenty GATTACA EMPLOYEES, identically-outfitted men and women, \nrun in a perfectly straight line towards the tranquil lake oE \nthe picturesque grounds, never getting any closer to their goal. \nThey run at a steady lOmph on twenty identical state-of-the-ar: \ntreadmill machines sunken into the floor and arranged in a \nuniform row facing a floor to ceiling window. The strain is \nbeginning to shaw on many of the faces. The heartrate of each \nemployee is monitored via a wireless electrode attached to the \nchest. \nOutside 1n the sunshine the next batch of twenty EMPLOYEES \nlimbers up in readiness for their physical. JEROME's only \npreparation consists of dragging thoughtfully on a \ncigarette while staring out at the man-made lake. His \nnonchalant attitude disheartens nearby collleagues, including \nIRENE who is amongst 'a group of workers \"exc,used from the run \nby benevolent, over-protective TRAINERS. \nTRAINER \nYou're excused, Irene. You may resume your duties. \nOn the way into the work-out facility Jerome'stubs out his \ncigarette in a stainless steel ashtray. Only we are aware of \nthe slim credit card-sized recording device that he furtively slips out of his cigarette pack and secrets in his hand. As he \ntakes his place on one of the treadmills and adheres the \ncordless electrode to his chest, Jerome surreptitiously attaches '. h1S device to the underside of the running machine's control .. panel. "
    },
    {
      "id": 64,
      "title": "INT. GATTACA -WORK-OUT OBSERVATION ROOM. DAY.",
      "location": {
        "primary": "GATTACA -WORK-OUT OBSERVATION ROOM. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -WORK-OUT OBSERVATION ROOM. DAY.\nFrom a mezzanine floor above the work-out room, LAMAR, the \nmedical officer, monitors computer read-outs displaying the \npace and pulse of the runners on each treadmill machlne. "
    },
    {
      "id": 65,
      "title": "INT. GATTACA -WORK-OUT CENTER. DAY.",
      "location": {
        "primary": "GATTACA -WORK-OUT CENTER. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -WORK-OUT CENTER. DAY.\nOne by one the GATTACA EMPLOYEES drop out until JEROME is the \nsale remaining runner. Several of the other employees stand \naround and watch Jerome run as they towel off. (CONTINUED) \n56 \nCONTINUED \nHe appears under lit~le stress, staring directly ahead, \nseemingly in a trance. As 'oNe focus on his chest, only 'oNe ~re \naware of ::.he sound of his :'..:.riously pounding heart making a l~e \nof his calm exterior. "
    },
    {
      "id": 66,
      "title": "INT. GATTACA -WORK-OUT ~3SERVATION ROOM. DAY.",
      "location": {
        "primary": "GATTACA -WORK-OUT ~3SERVATION ROOM. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -WORK-OUT ~3SERVATION ROOM. DAY.\nJerome's heart registers a far more measured beat on the \ncomputer in the obserJation room. The DIRECTOR ~s at LAMAR's \nshoulder, beaming proudly. \nLAHAR \nlmarJellng at Jerome's heartrate) \nSix miles later ~t's still beating like a \nGoddamn metronome. I could play piano by that \nheartbeat of hls. \nThe INVESTIGATOR and DETECTIVE HUGO enter the observation room, \nescort~d by IRENE. \n. DETECTIVE HUGO \nDirector Josef, this is our lead Investigator, \nThe two men exchange a polite handshake. However the \nInvestigator is immediately taken with the SOLE RUNNER.with his \nback to him, on the treadrrull below. \nI}l'IESTIGATOR \nHow often do you test, Director? \nOften. DIRECTOR JOSEF \nINVESTIGATOR \nI intrigued) \nSurely you know what you have. \nD!RECTOR JOSEF \nWe have to be certain. Once they're up, we \ncan hardly turn the baat around. \nOn the treadmill below, Jerome glances to his watch as he runs, \nthe distress starting to show. Caught up in the conversation, \nLamar has forgotten to end the work-out. Remembering, he \nfinally presses the \"WARM-DOWN\" button, slowing the treadmill. \n(CONTINUED) \n,. CONTINUED \n~'1AR (still marveling at Jerome) \nI swear if ! went to lunch and came back, he'd still be there. 57 \nWe focus on Jerome's recording device attached to the bottom of \nthe control panel. It clicks to a stop, indicating that the \nbogus heartbeat recording has ended before the workout. \nThe heartbeat monitor in the observation room suddenly races \nfrom 80 to 250 beats per minute. Lamar catches the discrepan~1 \nout of the corner of his eye but before he can take a second \nlook, Jerome has whipped the electrode from his chest. The \nphysician shrugs it off as a glitch in the machine. \nThe Investigator has turned his back on Jerome to face the \nDirector. \nINVESTIGATOR \nWe believe we have a suspect. \nDIRECTOR JOSEF \nWhat a relief. \nINVESTIGATOR \n(referring to the profile of VINCENT \non Hugo'S computer notepad) \nThis unaccountable specimen was found in \nthe south wing corridor. \nIn the room below, Jerome nonchalantly steps off the treadmill, \nstealthily retrieves the recording device from beneath the \ncontrol panel and returns it to his cigarette pack. \n\" He casually wipes off drops of sweat from the machine with a \ntowel, briefly glances to Irene with the Investigators and ex~ts \nto the locker room. \nThe Director idly regards the image of VINCENT on Hugo'S \nhandheld screen. He does not recognize the face. \nDETECTIVE HUGO \nAn age enhancement is being prepared as \nwe speak. \nDIRECTOR JOSEF \n(referring to his assistant) \nIrene will make it available to security. \n. . sa "
    },
    {
      "id": 67,
      "title": "INT. GATTACA -LOCKER ROOM. CAY.",
      "location": {
        "primary": "GATTACA -LOCKER ROOM. CAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -LOCKER ROOM. CAY.\nJEROME · ... ears his assured smile all the way along the corrldor \nand into the now empty locker room. He exchanges a cheery \ngreetlng with an exiting COLLEAGUE, enters a shower stall, . \ncloses the door behlnd him and promptly collapses on the shower stall floor . \nThe effects of the gruelling work-out are only now apparent. No \nlonger sucking up the pain, he gulps air into his oxygen-starved \nlungs, his heart looking for a way through his tlghtened chest. \nHe writhes in agony on the white-tiled floor - a brutal remlnder \nof the physical frailty he seeks to disguise "
    },
    {
      "id": 68,
      "title": "EXT. GATTACA -GARDEN. LUNCHTIME.",
      "location": {
        "primary": "GATTACA -GARDEN. LUNCHTIME.",
        "type": "ext"
      },
      "text": "EXT. GATTACA -GARDEN. LUNCHTIME.\nIn Gattaca's perfectly landscaped gardens JEROME, dressed and \nrecovered from his ordeal, joins his COLLEAGUES for lunch at one \nof the umbrella-covered tables. While most of the others pick \nat unappetizing salads and take their individualized medication, \nJerome carries a steak sandwich on his tray. \nThe sight of the juicy steak is greeted with enVlOUS looks frbm \nhis colleagues. Jerome pretends not to notice and rubs it in by \nliberally sprinkling salt onto the meat. \nHowever when Jerome looks over towards IRENE, she avoids eye \ncontact. When she abruptly gets up and leaves, Jerome follows -\nthinking twice before depositing the napkin in the nearby \ntrashcan. A janitor reaches for the napkin. It is the Old \nJanitor, CAESAR, from Jerome's former life. \nCAESAR I'll take care of that for you, Mr Morrow . \n• The two men exchange a conspiratorial smile. "
    },
    {
      "id": 69,
      "title": "EXT. GATTACA -WIND FARM. AFTERNOON.",
      "location": {
        "primary": "GATTACA -WIND FARM. AFTERNOON.",
        "type": "ext"
      },
      "text": "EXT. GATTACA -WIND FARM. AFTERNOON.\nA forest of wind turbines, supplying energy to the aerospace \ncomplex. However the blades of the turbines are motionless in \nthe still afternoon. JEROME finally catches up with IRENE. She \nturns, unsurprised by his appearance. Standing beside her, he \nlooks out over the complex as if he too has come for the view. \nWe were JEROME \n(eyes fixed on the view) \nlooking at each other. You stopped. \n(CONTINUED) \n, \n• , \n• \nt CONTINUE;D \nIrene, also keeps her gaze ahead. \n:\"E~'E \nI'm sorry. I didn·t ~ean anything . \n.JEROME \n(shrugging as if it makes \nno dif:erence to him) \nWe were Just look~ng. \nIRENE \nI know about you . 59 \nJerome turns to her, startled, trying to read her face. Irene \ntakes a deep breath and abruptly plucks a long, dark hair from \nher head. \nIRENE \n(offering the hair to Jerome) \nHere, take it. \nJerome, confused, takes the hair -more in reflex than intent. \nIRENE \n(a challenge) \nIf you're st~ll interested, let me know. \nJerome contemplates the hair in his fingers for a moment, then \ndeliberately lets it fall to the ground. \nJEROME \n(never taking his eyes from her) \nSorry, the wind caught it . \n• Irene meets his gaze. There is not a breath of wind. The \nhair lies, plainly visible on the ground. "
    },
    {
      "id": 70,
      "title": "EXT. GATTACA AEROSPACE COMPLEX. AFTERNOON.",
      "location": {
        "primary": "GATTACA AEROSPACE COMPLEX. AFTERNOON.",
        "type": "ext"
      },
      "text": "EXT. GATTACA AEROSPACE COMPLEX. AFTERNOON.\nAs JEROME and IRENE walk between the wind turbines, Jerome \npretends not to notice that Irene keeps furtively checking the \npulse on her wrist. They pause in the shade. \nJEROME \n(as if making conversation) \nHave they found our friend? \n(CONTINUED) \nCONTlNUE'D \nFriend? IRENE \nJEROME \n( shrugs) \nIt was a mercy-killing after all. \nIRENE \nThey found an eyelash. \nJEROME \nWhere? \nIRENE \nIn the South wing. \nJEROME \nDoes it have a name? \nIRENE \nJust some In-Valid. Vincent--· \n(trying to come up with the last name) \n--somebody. 50 \nJerome turns away to disguise his alarm. He quickly .recovers. \nJEROME \nPerhaps we ought to celebrate, Irene. \nIRENE \n(a smile playing around her lips) \nYou celebrate, Jerome? \n• INT. EUGENE'S CONDO. NIGHT. \nEUGENE talks irritably on the phone, examining a container from \na newly opened case of hair bleach. \nEUGENE \n(into phone) \n--I know what I ordered. I ordered \"Honey \nDawn\" and you sent me \"Summer Wheat\". \nJEROME descends the staircase, taking the steps two at a time. \nHe immediately goes to the refrigerator, removing trays of \nsamples. Eugene abruptly hangs up the phone. \n(CONTINUED) \n• \n[ \n.. CONTINUED \nJ'ERGME lOCI \nCall Gennan. \nEUGENE \nAny particular reason? \nJEROME \n(collect~ng up sample bags from \nthe work bench) \nWe can't stay here. \nEt:GENE \nWhat are you talk~ng about? \n':EROME \nThey think I offed the Director. 61 \nEugene wheels himself over to Jerome, unconcerned. \nEUGENE \nWhat makes them think that? \n..JEROME \nThey found my eyelash. \nEUGENE \n(a flicker of anxiety) \nWhere? \nJEROME \nIn a corridor. \nEUGENE \n(blase once again) \nCould be worse. They could have found it in your eye. \nJerome half-smiles despite the situation. \nJEROME \n(resuming his collection of samples) \nCome on--we're taking off. \nEUGENE \nI'm not going anywhere. Less than a week to go. \nNot on your life--\n(CONTINUED) \nCONTINUED \nJEROME \n--You don't understand, they'll make the \nconnection, they'~~ hoover aga~n. We should \ncut our losses. \nEUGENE 62 \n(angrily grabbing a tray from Jerome's hands) \nWhere ~s your head, Jerome? You're acting \nlike a guilty man. They won't marry the eyelash \nto you. They won't believe that one of their elite navigators could have suckered them for the last five years . \n.JEROME \nThey'll recognize me. \nEUGENE \n(scoffing) \nHow could they recognize you? \n(referring to the torn photo of \n20-year-old Vincent ot:! the wall) \nI don't recognize you. Anyway, you don't ·have a \nchoice. You run, you may as well sign a confession, \nturn us both in right now. No, we stick this out-­\nfind out what we can but change nothing. This is \na minor inconven~ence is all it is. We've taken \nworse heat than this. \n(angry now) \nJesus, if I'd known you were going to go \nbelly up on me at the last fucking gasp, I \nwouldn't have bothered. You can't quit on me \nnow. I've put too much into this. \n(returning the samples to the fridge) \nBesides, this stuff is mine. I had other offers, \nyou know. I could've have rented myself out to \nsomebody with a spine. vou want me to wheel in \nthere and finish the job myself? \n(meeting Jerome's gaze) \nWe'll take off all right, from pad 18 just like \nwe planned. \nJerome slumps down in a chair, Eugene's tirade starting to get \nto him. \nAnd keep your \nthey belong. EUGENE \nlashes on your lids \nHow could you be so where \ncareless? \n(CONTINUED) \nCONTINUED \nJEROME \nI'm sorry. \n(reluctant admisslon! \nI think I was crying. \nEugene 1S uncomfortable at the notion. \nEUGENE \nWell save those tears. 63 \nJerome shrugs awkwardly and pours them both a drink. \nJEROME \nYou really had other offers? \nEUGENE \n( shrugs! \nI'm sure I could have. "
    },
    {
      "id": 71,
      "title": "INT. CONDOMINIUM -INClNERATO!'.. NIGHT.",
      "location": {
        "primary": "CONDOMINIUM -INClNERATO!'.. NIGHT.",
        "type": "int"
      },
      "text": "INT. CONDOMINIUM -INClNERATO!'.. NIGHT.\nThe naked JEROME scrapes away at his skin with even greater \nferocity than usual. After exiting the incinerator, he deposits all the incr1minating trash he has collected during the day into \nthe furnace and ignites the gas. "
    },
    {
      "id": 72,
      "title": "INT. EUGENE'S CONDOMINIUM. NIGHT.",
      "location": {
        "primary": "EUGENE'S CONDOMINIUM. NIGHT.",
        "type": "int"
      },
      "text": "INT. EUGENE'S CONDOMINIUM. NIGHT.\nfrom outside, a car horn sounds. JEROME, ln \nspectacles, abruptly enters the condominium. \ncloset and starts searching through Eugene's \nJEROME \nMind if I borrow a tie? a formal suit and \nHe goes to a \nclothes. \nEUGENE is more interested in the car parked outside the \ncondominium. IRENE sits in a convertible Citroen OS, dressed 1n \na classic but provocative black suit. Unaware that she is being \nobserved she touches up her lipstick in the rearview mirror. \nEUGENE \nSo it's not just the Hoovers who've got \nyou rattled. \nJEROME \nYou're the one who said not to change \nShe's my ear to the investigation. anything. \n(CONTINUED! \nCONTlNUF;D \nEUGENE \n(skeptical) \nIs that all? \nJEROME \nI've got enough on my m~nd without that. \nEUGENE \nIf you say so. \n(referring to the ties in Jerome's hand) \nThe stripe. \nJEROME \n(agreeing with the selection) \nGood choice. 64 \nJerome fumbles with the knot. From his chair, Eugene knots \nJerome's tie for him. Jerome is intrigued that for once Eugene \nis abstaining -he has not touched his drink. \nJEROME. \nNot thirsty? \n(referring to the fridge) \nWe've got enough virgin samples to last us the week. \nEUGENE \nI don't feel too good. I think I'm still \ndrunk from last night. \nJEROME \nNever stopped you before. \n(regarding Eugene's head) \nAnd for God's sake stop plucking your hair. \nSomeone went to a lot of trouble to make sure \nyou wouldn't go bald. \nEUGENE \nIf I were you I'd worry about myself. \n(nodding to Jerome's spectacles) \nHaven't you forgotten something? \nJerome pockets the spectacles and enters the bathroom for his \ncontact lenses. The horn sounds outside the window a second \ntime and Jerome hastily exits. We stay with Eugene. Irene \ncatches a glimpse of h~m before he moves away from the w~ndow. \nJerome emerges from the building. \n(CONTINUED) \nt \n. . \nr \nr 65 \nCONTINUED \nAs the couple drive away, Eugene wheels himself to the full \nlength mirror. He regards his own reflection for a moment and \nopens the mirror - a disguised door opening into the adjacent \napartment. A cloud of condensed water vapor billows out. \nGERMAN, the DNA Broker, emerges with an ENGINEER. \nHe sends the englneer on his way and joins Eugene at his desk . \nEugene hands German a credit card that he wipes through hls \ncomputer. \nGERMAN \nWe still need to overhaul the back-up generator. \n(fixing Eugene with a penetrating stare) \nWhat's going on, Eugene, I thought he was gOlng \naway, not you--you going on vacation? \nEUGENE \n(looking away) \nYou got it, German. \nGERMAN \n{nodding thoughtfully}·· \nYou deserve it. "
    },
    {
      "id": 73,
      "title": "INT. CONCERT HALL -AUDITORIUM. NIGHT.",
      "location": {
        "primary": "CONCERT HALL -AUDITORIUM. NIGHT.",
        "type": "int"
      },
      "text": "INT. CONCERT HALL -AUDITORIUM. NIGHT.\nJEROME and IRENE step over feet, apologizing as they go, \neventually finding their seats in a box in a sold-out concert \nhall. \nOn the stage below, a YOUNG PIANIST - a teenage prodigy -has \nalready taken his place at the keys of a grand piano. The \n·,pianist removes his white gloves and begins to play -an \n. 'extremely complex and beautiful piece we have never heard \nbefore. IRENE looks to JEROME. He is clearly caught up in the \nmusic. "
    },
    {
      "id": 74,
      "title": "EXT. IN-VALID HOUSING PROJECT. NIGHT.",
      "location": {
        "primary": "IN-VALID HOUSING PROJECT. NIGHT.",
        "type": "ext"
      },
      "text": "EXT. IN-VALID HOUSING PROJECT. NIGHT.\nThe music from the piano recital continues under the following \ncontrasting action. A huge, brooding housing project. PEOPLE \nhang around on street corners. Menace in the air - a feeling of \nimpending violence. \nSuddenly unmarked police cars appear from all directions, \nblocking any escape route. Dozens of PLAINCLOTHES DETECTIVES \np·our out of the cars and onto the street. (CONTINUED) \n.. 66 \nCONTINUED \nPeople scaccer, many r~nn~ng scra~ght into the arms of the \nDecect~ves. OTHERS, sp:ll:ng ouc of the houslng proJecc, are \nalso immediately apprehended. \nThe Detectives quickly weed out those suspects not ficting \nJerome's description -WOMEN, OLD MEN and TEENAGERS. They are \nshepherded off the streec. A line of IN-VAL IDS is fo=med \nseveral hundred yards long. Detectives begin to laboriously \nmove along the line, caklng finger-prick blood samples from each \nsuspecc -instantly con£:r.n~ng their identities with portable \nanalyzers worn on their hlpS. \nAs if having the ldea ac the sarne time, TWO SEPARATE MEN \nsuddenly bolt from che llne, knowing that their blood will \nincriminate them. Ocher Detectives, watching for such escape \nattempts, easily apprehend them and escort them to a waiting \npolice van. \nWith the raid under cencrol, DETECTIVE HUGO indicates to the \nINVESTIGATOR that it is safe to exit his car. The Investigator \nappea:-s irritated, only half -glancing a.t the 'iWO MEN already· in \ncustody, apparently certain that neither one is his suspect. \nDETECTIVE HUGO \n(enchuslastic) \nNot our fish, buc something stuck in the net. \nThe Investigator clearly does not share Hugo'S enthusiasm. The \nDetective offers the Investigator an age enhanced photograph, \ncomputer-generated from the last existing photo of VINCENT as \na 20-year-old. \nDETECTIVE HUGO \nThis is the age enhancement we're working with. \nThe Investigator 19nores the photo, preferring instead to trust \nhls own eye as he wanders along the line of suspects. \nDETECTIVE HUGO \n(referring to the line-up) \nAs you requested, we've Kept the parameters \nwider than usual. \nThe MEN they scrutinize are hardly mutants -the differences \nbetween an IN-VALID and a DAN are subtle at best. Some shorter, \nsome wearing glasses, some with receding hairlines or bald, many \nwith no discernible physical difference at all. The \nInvestigator is only halfway down the line before he turns and \nstarts walking back to his car. (CONTINUED) \n67 \nCONTINUED \nThe mystified Detective Hugo follows his superior. \n::-J\\r:;S7I GATOR \nWe're in the wrong place. We're wast~ng time. \nDETECTIVE HUGO \nThis is the most likely location--\nThe Investigator wheels on Hugo, suddenly angry, clearly unused \nto having his judgement questioned. \nINilES:'IGATOR \n--There's that word again. I have a feeling \nthis man doesn't play the odds, Detect~ve. Not \nexactly a slave to probability. Is it 'likely' \nthat a man who has successfully eluded authorities for \nfifteen years--a brutal killer--is going to come \nto us now like a' lamb? \nDETECTIVE HUGO \n(taken aback by the outbUrst) \nIs there something more we should know about this \nsuspect, Sir? I mean besides what's on his sheet. \nINVESTIGATOR \nSince going underground, traces of this In-Valid \nhave shown up at the scene of four serious \nfelonies. Do you need any more than that? \nDETECTIVE HUGO \nWith respect, Sir, many perfectly innocent \ncitizens have left specimens at as many crime \nscenes. Maybe he'S just unlucky. \nINVESTIGATOR \nI don't like anybody this unlucky. \n(pause) \nWiden the sweep. The West side. Draw a five mile \nradius around Gattaca. Hoover some of the classier \nestablishments. Random car stops. \nDETECTIVE HUGO \nWe're already getting complaints about \nfrivolous search. \nINVESTIGATOR \nThis is a murder investigation. The public \nshould be happy to co-operate, to get this \ndisease off the streets. \n68 "
    },
    {
      "id": 75,
      "title": "INT. CONCERT HALL. NIGHT.",
      "location": {
        "primary": "CONCERT HALL. NIGHT.",
        "type": "int"
      },
      "text": "INT. CONCERT HALL. NIGHT.\nA standing ovation. 7he YOUNG PIANIST on the stage bows deeply, \nsoaking up the applause of the AUDIENCE. The p~~nist tosses one \nof his white gloves into the front row where it LS caught by an \nadoring FAN. The second glove he tosses up to the box where \nJEROME and IRENE are standing. Jerome snares the glove out of \nthe air and immediately hands it to Irene. She promptly slips \nthe glove on her own hand. \nThe glove fits snugly over her five fingers. However one finger \nof the glove remains unfilled. Jerome is stunned to realize that it is a six-fingered glove. \nIRENE \n(catching his look of astonishment) \nYou didn't know? \nJEROME \n(trying too hard to convince) \nYes ... yes ... \nIRENE \n(picking up a resentment, confused') \nYou're angry--\nJEROME \nWhy would I be angry? It was beautiful. \nHe quickly turns away to lead the applause. On stage, the \npianist raises his hands to acknowledge the crowd. Both his \nhands contain a perfectly formed extra finger. "
    },
    {
      "id": 76,
      "title": "INT. IN-VALID HOUSING PROJECT -PROSTITUTE'S BOUDOIR. NIGHT .",
      "location": {
        "primary": "IN-VALID HOUSING PROJECT -PROSTITUTE'S BOUDOIR. NIGHT .",
        "type": "int"
      },
      "text": "INT. IN-VALID HOUSING PROJECT -PROSTITUTE'S BOUDOIR. NIGHT .\n. From an upstairs window we observe the INVESTIGATOR's car \ncruise slowly back into the squalid housing project. A MAN LS \nbuckling his pants at the window. \nJOHN \nShit! One of those Hoovers is back. \nA prostitute, VALERIE, a slender, sylphlike beauty, joins him at \nthe window. \nVALERIE It'S alright. He's here to see me. \nHer client looks at her askance. \nhurries into his clothes anyway. Despite her assurances, he \n(CONTINUED) \n• \nl \n. . CONTlNUE;D \nVALERIE \n(to an unseen woman in the next room) \nSonja, I can't see anyone else tonight. 69 "
    },
    {
      "id": 77,
      "title": "INT. IN-VALID HOUSING PROJECT -PROSTITUTE'S BOUDOIR. NIGHT .",
      "location": {
        "primary": "IN-VALID HOUSING PROJECT -PROSTITUTE'S BOUDOIR. NIGHT .",
        "type": "int"
      },
      "text": "INT. IN-VALID HOUSING PROJECT -PROSTITUTE'S BOUDOIR. NIGHT .\nThe INVESTIGATOR, sits up in the bed, glass in his hand. \nVALERIE lies on the tangled sheets, naked, making no effort to \ncover herself. She regards the Investigator curiously. \nVALERIE \nI don't understand you, Investigator. \nThe Investigator glances idly in her direction. \nVALERIE \n(teasing good-naturedly) \nYou hunt us by day and fuck us by night. Do \nyou only get it up for In-valids? \nThe Investigator .smiles and rejoins her on the bed: \nVALERIE \nWouldn't you be happier with one of your \nmade-to-order whores? \nINVESTIGATOR \n(gently stroking her hair) \nYou are so beautiful, are you sure you weren't \naltered? This is not the face, the body, of \na Godchild. How could something so lovely \nbe a product of chance? \nVALERIE \nIs that what keeps you coming back? \n(meeting his gaze) \nLook at you. Such angry, beautiful, perfect eyes. \nDo you ever wonder what they would see if they \nweren't quite so perfect? They will never see \nwhat I see. \nThe Investigator tries to laugh off her assertion but his \ntight-lipped smile betrays his displeasure. \nINVESTIGATOR \n(a cruel edge to his voice) \nYou have so much wrong with you, you'll \nbe lucky to see next year. (CONTINUED) \n70 \nCONTINUED \nHe roughly forces h~mself on top of her but she remains defiant. \nVALERIE \nAre you so much more alive, Investigator? \nINVESTIGATOR \n(parting her legs) \nI'm not pay~ng you to talk. \nINTI EXT. IRENE'S CAR. NIGHT. \nIRENE drives, JEROME at her side. Cars are being flagged down \nby uniformed POLICE OFFICERS. Irene slows down behind the car \nin front. Spying an OFFICER shine a flashlight in the eyes of \nthe MALE DRIVER up ahead, Jerome wipes the contact lenses from \nhis eyes and flicks them out of the passenger window when Irene \nis not looking. \nAn OFFICER approaches Jerome and, without a word, opens an \nelectronic testing kit worn on his hip. He. removes a sterilized \nQ-tip and motions for Jerome to ·open his' mouth so he can scrape \na culture. uerome waves his hand in front of his mouth, \nfeigning embarrassment. \nJEROME \n(conspiratorial wink to the Officer) \nBetter net. \nInodding in Irene's direction) \nDon't want to give you a cont~nated \nspecimen ... if you get my meaning. \nIRENE plays along, shrugging coyly at the cop. \n·:we see an EXTREME CLOSE UP of Jerome's hand as he furtively \nretrieves a hair follicle attached to his shirt cuff. With the hair already in his fingers, he pretends to pluck a hair from \nhis head, faking a wince at the appropriate moment. \nThe cop, wearing transparent latex gloves, takes the follicle \nand places it in a receptacle in his kit. After a short moment \nthe hair confirms JEROME's driving ID which appears on the kit's \nelectronic screen. As the cop departs, Irene looks \nquestioningly at Jerome. \nJEROME \nThanks. \n(answering her unasked question) \nYou never know where those swabs have been. (CONTINUED) \nCONTINUED \n:rene nods, however c~early ~ot convinced. She shakes t~e deubt \nf::-om her ml.nd. \n:RE.'ffi \nI want to show you something. \nShe accelerates away. ~e see the road ahead from Jerome's ?OV. \nWithout his contact lenses, it is a blur. "
    },
    {
      "id": 78,
      "title": "INT. MICHAEL'S CLUB. NIGHT.",
      "location": {
        "primary": "MICHAEL'S CLUB. NIGHT.",
        "type": "int"
      },
      "text": "INT. MICHAEL'S CLUB. NIGHT.\nAfter closing time, suited DETECTIVES vacuum the club in · .... hl.ch \nJerome and Eugene d~ned the previous evening. MICHAEL, the \nowner, looks on disda~nfully. Waiting in the baCkground, the \nregular CLEANERS -most ll.kely In-valids themselves -smirk to \neach other, enjoying watching the cops do their work for them. "
    },
    {
      "id": 79,
      "title": "EXT. OCEAN HIGHWAY. NIGHT.",
      "location": {
        "primary": "OCEAN HIGHWAY. NIGHT.",
        "type": "ext"
      },
      "text": "EXT. OCEAN HIGHWAY. NIGHT.\nWith no place to turn .the car around, IRENE parks on the cliff \nside of the six-lane highway. In the darkness she dashes from \nthe car and, without a second thought, runs directly out into \nthe heavy commuter traffic. Easily negotiating the on-coming \ncars, she emerges safely on the other side of the highway. \nJEROME, rounding the car from the passenger side, is about to \nfollow, when he suddenly pulls up sharply at the curb. We focus \non his eyes, deprived of the benefit of their contact lenses. \nFrom Jerome's POV, we see that the headlights rushing ~owards \nhim are nothing but a series of fast-moving blurs -blurs that \nmerge together. He is unable to distinguish between the \nvehicles or judge their distance. \nIRENE \n(calling back urgently from the \nother side, mindful of the light \nbeglnning to leak into the sky) \nCome on! We'll miss it! \nIrene stares expectantly back at Jerome with her 20/20 vision, \nunaware of his predicament. Jerome puts a foot off the curb at \nthe wrong moment and is almost collected by an on-coming car. \nIrene is taken-aback at his mistiming. Does she detect a squint \non Jerome's face? To Jerome, the figure of Irene on the other \nside of the highway is merely a featureless shape but he feels \nher expectation. He touches the spectacles, still in his \npocket, but they are an unthinkable option. (CONTINUED) \n.--~ '-\nCONT!NUE,D \nHe shakes ehe idea from his head and eurns back co ehe sw~ft:y­\nf :ow~ng highway. He makes up his ml.nd -he cannoe allow h~::1Sel f \nco be shamed, even ae c~e risk of life and limb. Hardly even \nglancing ae ehe eraffic, he suddenly boles blindly across ~~e \nroad. Headlighcs hurcling cowards him, cars forcuieously \nbrushing pasc his heels, horns blaring. Jerome makes a f~nal \nleap co che haven of che far curb, che rush of air from a large, \nfasc-moving cruck blowing him che final inches co che sidewalk. \nIrene is scunned by che near miss. She is abouc co commenc buc \nJerome cakes her by che arm and ushers her cowards che dunes. \nJEROME \nCome on. We'll ml.SS ic. "
    },
    {
      "id": 80,
      "title": "EXT. BEACH. DAWN.",
      "location": {
        "primary": "BEACH. DAWN.",
        "type": "ext"
      },
      "text": "EXT. BEACH. DAWN.\nJEROME and IRENE huddle beneach an overcoac as che sun crescs \nche horizon. scaining che sky wich an ochre blush. \nIRENE \nWhac did I cell you? \nJerome nods. However, co his eyes che rising yolk is noching \nbut an ouc-of-focus, abscracc ink blot. \nIRENE \nI envy you, ~ercme. \n~EROME \nYou'll be nexc. \nIRENE \nI don't chink so. The only crip I'll make \nl.n space is around che sun--\n(leccl.ng a handful of sand \nslip ehrough her fingers) \n--on chis sacellice right here. \nIrene curns co Jerome. \nIRENE \n(blurcl.ng ouc what's really on her mind) \n--Listen, I don't want to waste your time \nand I really don't want you to waste mine. \nI don't know whac you're after but I have \na feeling I'm noc lC. \n(CONTINUED) \n. . CCN'I'INUED \nIrene suddenly takes .jercme's hand and puts 1t up her \nsweater, onto her breast. Although taken aback, .jerome makes \nno effort ~o w1thdraw h1s hand. \n:?ENE \n(enjoY1ng his unease) It's here. My heart . \n(adding quickly) \nI'm careful--weekly check-ups. \ndrug maintenance program, blood \ndiet--I'm on a \nthinners, \n(slowly removing his hand) \nI just want you to know what you'd be gett1ng \nyourself. into. \nJEROME \nWhat exactly ~s wrong? \nIRENE \nNothing yet. I'll start experiencing \nsymptoms in my late-fifties .. \n(matter-of-fact) \nBut unless they come up with something between \nnow and then, ::: won't live much past 67. \nJerome's mouth drops. a little, betraying his surprise at the \nstatement from a woman plainly still in her twenties. \n:RE.\"<E \nOf course I th1nk about it every day . \n.JEROME (still not quite recovered from his surprise) \nOf course. "
    },
    {
      "id": 81,
      "title": "INT. POOL. MORNING.",
      "location": {
        "primary": "POOL. MORNING.",
        "type": "int"
      },
      "text": "INT. POOL. MORNING.\nThe INVESTIGATOR SW1ms h1S race with the unseen opponent. The \nInvestigator's ASSISTANT, carrying a phone, tries to attract h1S \nattention. "
    },
    {
      "id": 82,
      "title": "EXT. JEROME'S POOL. MORNING.",
      "location": {
        "primary": "JEROME'S POOL. MORNING.",
        "type": "ext"
      },
      "text": "EXT. JEROME'S POOL. MORNING.\nJEROME sits at his own pools ide in his robe, feet dangling over \nthe edge, smok1ng a clgarette. EUGENE, from his wheelchalr, ~s \napplying bleach to Jerome's hair and eyebrows with gloved \nhands. (CONTINUED) \n-CONTINUED \nAt the same t:me, ~ercme ~lays a sle~ght-of-hand game w~th a \nsyrlnge. \nEUGE.\"lE \nHow was your even~ng? \nJEROME \nComplicated. I couldn't stop her apologiz~ng. \nEUGENE \n(teasing) \nYou are a catch. No doubt she's worried that \nshe would lower the standard of your offspring. \nEverybody wants to \"breed up\". \n(idly cur~ous) \n'Hhat's wrong with her? \nJEROME \n(trying to be blase) \nYou know how it is with these altered births \n--somebody told her she's not .going to li~e \n. forever and she's been preparing t9 die ever \nsince. \nEUGENE \nYou're not thinking of telling her, are you? \nJERCME \nOf course not. Sut she'd have to know eventually. \nEUGENE \n(adamant) \nShe doesn't have to know. She doesn't want to know. \n-the camera travels down ~erome's scarred legs to find that the \npool is completely dra~ned. We now realize that it never \ncontained water. \nA BARREN WASTELAND. \nA desolate landscape, resembling the surface of the planet Mars. \nWe pull back to find that we are peering at this forbidding \ndesert through a circular aperture. "
    },
    {
      "id": 83,
      "title": "INT. CR::ME LAB. :AY.",
      "location": {
        "primary": "CR::ME LAB. :AY.",
        "type": "int"
      },
      "text": "INT. CR::ME LAB. :AY.\n~he INVESTIGATOR li:~s hlS head from the eyepiece of an \nelectron microscope :hrough whlch he has been examlning a ~~ny \nfragmenc of skin -che skin is idencified as belonglng ~o 20-\nYEAR-OLD VINCENT. CETECTIVE HUGO scands a~ ~he Inves~ 19a~or' s \nside -his acclcude more respeccful In lighc of t:he dlscover/. \nDecective Hugo pOlncs out a location on a computer-genera~ed \nmap. \nDETECTIVE HUGO \n(chagrined) \nThe skin flake was found in Michael's Rescaurant. \nThe employees are all accounted for. \n:NVESTIGATOR \nA customer? Does this Michael's cater to misfits? \nDETECTIVE HUGO \n(shiftin,g the view of the map \nto include the Gattaca complex) \nNo. Buc one or two \"borrowed ladders\" have \nshOwn up there in the pas,t. \nThe Investigator understands the significance. They wander over \nto a blow-up photograph of the 20-YEAR-OLD VINCENT. \nDETECTIVE HUGO \nWe have to consider the possibility' that he's \nplaYlng somebody else\"s hand. \nA smile gradually broadens across the Investigator's face. \nINVESTIGATOR \n(taking a perverse pleasure in the \nslowly dawning revelation) \nOf course. He's a \"de-gene-erate\". \n(glanclng to a photo of the \nGattaca crime scene) \nHe works ac Gatt:aca. Why else would we find \nthe eyelash near the washroom? Nobody stopS to \ntake a leak durlng a murder. \nDETECTIVE HUGO \n(quickly covering himself) It's still possible the eyelash specimen came \nfrom a janitor, delivery man--it could have blown \nin through an open window. \n(CONTINUED) \n, \n.. ~6 \nCONTINUED \n':'l\":e Investigator appears ~.ot ::D be listening, hlos mJ.nd _de up. \n:!iVESTIGATOR \n(mi:\\d ::ac~ng) \nHe was afralod Dr belong exposed. That's why he did ~t. \nCE:-ECTI'VE HUGO \n(puzzled) It loS hard to believe he could be one of their ellote workers. You've seen their \nsecurity sySt~~. They know who works there. \n(referr~ng to 20-year-old Vincent's profile) \nEven if you lognore the man's expiration date, \nhis profile suggests that he doesn't have the \nmathematlocal prcpensloty let alone the stamJ.na \nto pass theJ.r physlocals. \n:tNESTIGATOR \nDon't underest:mate these imposters. \nOE7ECTIVE.HUGO \n(skePtl.cal, referring to a file of \nGattaca employee ID photos) \nNone of the IO photos match the enhancement. \nINVESTIGATOR \n(smJ.ling to himself) \nA man can change his face--but blood is forever. \nSample every ~'1lployee within the parameters r gave you. \n(pause) \nIntravenous. \nHugo's mouth drops open at the mention of ·intravenous·. \nCE':'ECTI'{JE HUGO \n(immediately protesting) \nYou know their · ... orkforce. Two-thirds at \nleast fall into the category. We'll be \nclosing down thelr operation for days. \n(seeking a compromise) \nAt least go wloth a fir4ertip sample or urlne. \nINVESTIGATOR \n(shaking his head) \nBlood. From the veJ.n. \nThe Investigator turns on his heel to prevent further protest. \nThe Detective and his ASSISTANTS exchange looks of exasperatlCn \nbehind the Investigator's back. "
    },
    {
      "id": 84,
      "title": "INT. G~T7ACA. DAY. ~­,",
      "location": {
        "primary": "G~T7ACA. DAY. ~­,",
        "type": "int"
      },
      "text": "INT. G~T7ACA. DAY. ~­,\nJEROME, drlnk~ng water, stands in front of a large \"ldeo \nbulletin board. Among other things, it displays the elect=onlc \nmugs hot of 20-YEAR-OLD VINCENT alongside the recent computer \ngenerated age enhancement of his face. \nSome distance away, CAESAR, the elderly janitor, discusses the \nmugshots with a YOUNGER JANITOR. \nCAESAR \nLook like anybody to you? \nYOUNGER JANITOR \nNot to me. \nCAESAR \nUgly sonofabitch though, isn't he? \nJerome half-smiles, realizing that the conversation is for his \nbenefit. Having made it clear that they do not intend to expose \ntheir former colleague, the two Janitors continue their rounds. \nJerome crushes his paper cup. Forgetting himself ,. he \ndrops the cup into the wastebasket. "
    },
    {
      "id": 85,
      "title": "INT. CRAFT. DAY.",
      "location": {
        "primary": "CRAFT. DAY.",
        "type": "int"
      },
      "text": "INT. CRAFT. DAY.\nJEROME familiarizes himself with the interior of a spacecraft \nunder the supervislon of DIRECTOR JOSEF and the MISSION \nCOMMANDER. The screen that Jerome sits at is identical to the \none he operates in the computer complex -displaying asterold \n951 Gaspra. \nDIRECTOR JOSEF \n--Somewhere in the dust of Gaspra is the key. \n(warming to his theme) \nBack to the beglnning of the book--the life we \nbecame. With the original building blocks who \nknows how far we can take ·the godding·. \n~ISSION COMMANDER \n(wry smlle) \nEven someone as advanced as Jerome will be \nlast year's model by the time we're done. \nJEROME \n( smi 1 ing back) \nI wouldn't get your hopes up, Commander. \n(CON'I'INUEDl \n.. CONTINUED \n:rene enters the craft. \n: RENE \nExcuse me, ~r ~orrow. The invesc~gacors have \nbegun cheir tesc~ng. \nDIRECTOR JOSEF \nThis ~s so inconvenient, Irene. They can \nmake an exception for Jerome. \nIRENE \nI'm af::aid noc. \n~IRECTOR JOSEF \nI apologize, Jerome. \nJEROME It's noc your fault, Direccor. \n(afcerchought) \nIf your predecessor were still around \nwe may not be going to Gaspra at all. \nThac's whac I would call inconvenient. \nJerome exits the craft ' .. ith Irene. "
    },
    {
      "id": 86,
      "title": "INT. GA'l\"!'ACA CORPORATION -CORRIDOR. DAY. 78",
      "location": {
        "primary": "GA'l\"!'ACA CORPORATION -CORRIDOR. DAY. 78",
        "type": "int"
      },
      "text": "INT. GA'l\"!'ACA CORPORATION -CORRIDOR. DAY. 78\nA line of MALE GA'l\"!'ACA EMPLOYEES snakes out the door and down \nthe corridor. The INVESTIGATOR walks slowly down the line, \ntrying to eyeball his suspecc. Concentrating on the shorter, \ndark-haired men in che l~ne, he looks scraighc pasc JEROME. \nHowever, as the Investigator ignores him and walks by, we see a \n:.haunted look in Jerome's eyes. "
    },
    {
      "id": 87,
      "title": "INT. GA'l\"!'ACA -TESTING ~AB. DAY.",
      "location": {
        "primary": "GA'l\"!'ACA -TESTING ~AB. DAY.",
        "type": "int"
      },
      "text": "INT. GA'l\"!'ACA -TESTING ~AB. DAY.\nEvery available TECHNIC:AN is working to accommodate che tescing \nof the thousand or so PROGRAMMERS. Twelve testing scacions \noperace s~multaneously. A HOMICIDE DETECTIVE supervises each \nstacion. JEROME reaches the head of the line. He notes an \nex~c~ng COLLEAGUE holding a cotton ball to his arm. \nA NURSE direccs Jerome to LAMAR's testing station. Lamar \ndeposits the previous pacienc's labeled vial into a blood \ncarousel under che watchful eye of a large DETECTIVE, clearly \nnot ::elish~ng his ass~g~~enc. Jerome rolls up his sleeve. \n(CONTINUED) \nCONTI!ruED \n';:::RCME \n(referr~ng co che cable lined wlch syr~~ges) \n'dhac's wlch che plungers, Lamar? 'dhac are \nyou doing, openlng a blood bank? \nThe syringes are c~early noc Lamar's ldea. \nL;..'1AR \n(sarcaSC1C) \nThe gentl~~en of law enforcement are concerned chac \nmy testing methods may have been compromlsed. \nLamar inserts a fresh syringe lnto Jerome's arm. As Lamar draws \nche blood, Jerome suddenly flinches and flexes his arm \nviolently, causing che needle co bend and buckle, exiting che \nskin from a second punccure point. \nJEROME \nDamn! ! \nHaving pulled away from Lama+'s grasp, Jerome withd+aws.the bent \nneedle himself, blood stlll'squirting from his vein. . \nLAMAR \n(grabbing a nearby wad of gauze) \nJesus--r'~ sorry, Jerome. \nThe large Homicide Detective winces and curns away from che red \narcing spray, a splash of blood spattering his shoes. rn the \nmidst of the commotlon, with his practised sleight-of-hand, \nJerome removes the vial from the syringe and replaces lt with \nanother concealed 'Ilal. \nJEROME \n(unfazed, putting Lamar at his ease) \nYou must be out of practise, Lamar. \nLamar hurriedly takes the syringe from Jerome. \nLAMAR \n(ex~ning and removing the \nsWltched vial from the bent syringe) \nr've got enough here. \nJEROME \n(regarding the squimish detective, \nas he holds the gauze to his arm) \nNeed c~y more, you can always get it off his shoes. \n(CON'I'INUEDI \n,-80 \nCONTINUED \nThe Detect~'/e r.ot~::es ,::-:e spatter of blood across hlS brcg'..les \nand, w~th a look 0: j~sdaln, wipes it clean. He tosses the \nlncrimlnat~ng t:sS'..le down a hygenically sealed garbage shoot. \nLamar places Jerome's :abelled v~al in \n~mmediately analyzed by the computer. \nEmployee ID code appears on the screen \nEMPLOYEE enters the testing lab. "
    },
    {
      "id": 88,
      "title": "INT. GATTACA. DAY. the carousel '\",here ~t 1S",
      "location": {
        "primary": "GATTACA. DAY. the carousel '\",here ~t 1S",
        "type": "int"
      },
      "text": "INT. GATTACA. DAY. the carousel '\",here ~t 1S\nJerome's \"legltlmate\" \n-\"VALID\". Another \nJEROME exits the testlng lab with the gauze held to his arm. \nIRENE lS standlng cutslde the door. \n:?ENE \nSo you didn't do ~t after all. \nJEROME \n( J ok~ng darkly) \nr guess sOmebody' beat me to il: .. "
    },
    {
      "id": 89,
      "title": "INT. GATTACA -MEZZANINE FLOOR. LATER IN 'mE DAY.",
      "location": {
        "primary": "GATTACA -MEZZANINE FLOOR. LATER IN 'mE DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA -MEZZANINE FLOOR. LATER IN 'mE DAY.\nFrom above, the I~.~ST:~ATOR and HUGO observe the flnal EMPLOYEE \neXlt the testing lab. \nLAMAR, following the employee out of the lab, throws a look oE \nv~ndl.Catlon to the t· .. o cops. \nDETECTIVE HUGO \nThat's the last. \n::NESTIGATOR \nSomething's not rlght. \n::ETECTIVE HUGO \n(los~ng his patience) \nHe'S not here, It'S a blind alley. \n:NVESTIGATOR \n(resolute) \nNo, we've mlssed something. We Hoover agal.n. \nDETECTIVE HUGO \nWe don't have the manpower. \n:!J'\\\"ESTIGATOR \nGet it. F~~m cutside, if you have to. \nFrom what budget? \nINVESTIGATOR \n(angered by Hugo'S excuses) I'll take 1t ~ut of your damn pension 1f \nyou quest10n my authority one more time! 31 \nThe INVESTIGATOR tur~s h1S back on his subordinate and idly \ncontemplates the nearby telecope. Hugo resignedly relays the \nnews to D1rector Josef · .. ho 1S standing some distance away .. \nJosef's immediate react:on 1S to march towards the Investlgator, \nHugo tra1ling beh1nd. DIRECTOR JOSEF collects himself as he \nnotices the Invest1gator's hand on the telescope. \nDIRECTOR JOSEF \nWould you care to look--in the telescope? \n~ :NVESTIGATOR \n. . Thank you, no. \nDIRECTOR JOSEF (std;' referring to the telescope) \nOne look through there and you would know why \n! can't posslbly allow you to disrupt operations \nany further. \nINVESTIGATOR \n(unfazed) \nYou're so unconcerned that you have a killer \nin your midst . \nDIRECTOR JOSEF \nRight now, your presence is creating more of \na threat. I don't think you have any concept \nof what we do here--how meticulous our \npreparations must be. We are about to send \ntwelve people through 140 million miles of \nblackness to rendezvous with an object the Slze \nof a house and the color of coal. So it's rather \ncritical to point them in the right direction. \nAnd we certainly don't need you looking over our \nshoulders. Bes1des, I don't believe there is \nany eVldence that the killer is amongst us. I \ndon't see too many other dead bodies litterlng \nthe ~lace. (CONT:NUEDI \nCON'!'INUEP 52 \n!~;VEST!GATCR \n(surJey~ng the mostly empty fac~lity) \nNo, but since there aren't too many live ones \ntonight either, you won't mind us conducting one \nfurther sweep. If he does not work here, then \nthere should be no other trace of him. \n(to Hugo) \nI think you'd better get some people out of bed. \nDetective. \n(a thought occurs) \nIn the meant~me we can re-check his favorite \nhaunt. Even murderers have to eat. \nDirector Josef quietly seethes. \nINVESTIGATOR \n(to Josef, referring to the telescope) \nYou see, Director, I prefer my microscope. \nIN'!'. EUGENE\" S CONDOMINIt.'M. DAY. \nJEROME readies himself for an evening out -a bandage around his \narm from the needle puncture. EUGENE wheels himself in. \nEUGENE \nWhere are we going? \nJEROME \n(slightly gu~lty) \nI'm sorry. I've got plans. \nAgain? EUGENE \n(feigning hurt) \n';ERCME \n(referr~ng to his bandage) \nShe's already got her doubts. I have to act \nlike nothing'S wrong. \nEUGENE \nI'm sure you'll be very convincing. \nJerome ignores the r~ark. \nEUGENE \n'~ere are you tak~ng her? \n(CONTINUED) \n.. 83 \nC:NT!!-ruED \n:1:.c:-:ael 's. \nEugene leoks ac ~lm askance. \nJEROME \nEve~1body goes there. \nEUGENE \n(incredulous, glancing around the room) \nYou may as well invlte her here. \n':EROME \nlafcerchought as he picks up his Jacket) \nWill you be okay? \nEUGENE \nDon't worr1 about your little pin cushion. \nTo be honest, I'm looking forward to having \nthe place to myself. \nJEROME . \n(seeing through the bravado) \nWe'll stlll be able to talk when I'm away. \nThe conversac:on w1ll Just keep gettlng longer. \nEUGENE \nHow long? \nJEROME \nBy the time I'm at the Belt, you phone and \nsay, \"How are yOU?\" Forty-five minutes \nlater I reply, \"Not bad. How are you?\" \nEUGENE \nI guess I'd bet:er have something 1mportant \nto say if it takes that long to get an answer. \n!N'!' . MICHAEL'S CLUB. ~lIGHT . \nIRENE and JEROME step off the dance floor of the smoky, decadent \ndinner club and take a seat at their table. Irene is agog at \nche strange assortment of PATRONS, the cigars, the laden dessert \ntrolleys. It 1S all slightly off from the pristine world she is \naccustomed to. \n!RENE \n.... 'hat lS this p~ace? (CON'!'INt:ED I \nCONTINUED \n-:EROME \n( . .,;ry smlle, enjoying her fasc:::atlonJ \nYou've never been here? \nia dessert trolley is wheeled up) \nLet me order for you. 34 \nJerome selects a chocolate torte from the trolley. Jerome \nsavors a spoonful. Irene is tempted but then remembers herself. \nIRENE I'd better not. \nShe reaches for her elegant pill box. -:erome takes another \nspoonful. \nJEROME \nSo sure of what you can't do. Do you even \nknow what it tastes like, Irene? \nIrene goes to deny it but cannot. \nMICHAEL suddenly approaches the' table w\"lth ·a. WAITER in tow. \nIrene is about to steal a taste of the dessert with her finger \nwhen their plates and glasses are whisked away and the table \nimmediately hoovered. X~chael whispers in Jerome's ear. \nXICHAEL \nTake the side door. \nJerome looks up in t~me to see DETECTIVE HUGO coming through the \nfront entrance with several other DETECTIVES. \nDETECTIVE \n(to his colleagues) \nCheck for lenses, hairpieces--\nA Detective shines a flashlight ~n the eyes of a MALE PATRON. \nA SECOND DETECTIVE tugs the hair of a SECOND PATRON. Jerome \ntakes Irene by the hand and escorts her out of the side ex~t. \nSeveral other COUPLES make for the parking lot. \nIRENE \n~y are we leav~ng? \nJEROME \n(attempting to explain the hasty exit) \nThose checks take forever. \n55 "
    },
    {
      "id": 90,
      "title": "EXT. MI::HAEL'S CLUB -S:SE .=..LLEY. NIGHT.",
      "location": {
        "primary": "MI::HAEL'S CLUB -S:SE .=..LLEY. NIGHT.",
        "type": "ext"
      },
      "text": "EXT. MI::HAEL'S CLUB -S:SE .=..LLEY. NIGHT.\nSpilling out of the eXlt, JEROME and IRENE find a burly \npialn clothes DETEC7:'/E barr ~ng their way. Before the C:etect ~ 'Ie \ncan say a word, Jerorr.e r:as ',;rapped hls fist in his Jacket sleeve \nand srra.shed hlm ~n the face. He contlnues to beat ':he Cetect: 'Ie \nunt::.l he lies motionless on the ground. \nJerome! ~RENE \n(stunned) \nSpying other Detectives some distance away in the parking lot, \nJerome leads Irene out of a hldden side gate. \nIRENE \nWhat about the car? \nJEROME \n(grabblng her by the hand) \nLet's walk. \n!RENE \nWho are they? \nJEROME \n(holding h::.s bruised knuckles) It's not safe. I shouldn't have brought you here. \nJerome drags Irene across a vast, desolate lot, lit only by \nmoonlight. ~eeling exposed, he breaks lnto a run. \nI can't. \nCome on. IRENE \nJEROME \n(anxious) \nIRENE \nMy medicatlon. I left it back there. \nJEROME \nWe'll get It later. \n(forclng her to look him in the eye) \nIrene, please. \nIrene realizes his seriousness. She begins to run with him. \n~e clearing is wider than Jerome anticipated. They are only \nhalfway across -extremely vulnerable if the Detectlves think to \nl'ook in their direction. \n36 \n:NT. ~ICHAEL'S. NIGHT. \nThe :NVESTIGATOR is grilling MICHAEL, the club's owner. 7he \n:nvestigator suspiciously regards the multitude of ml.nl.-vacs ~:1 \nthe kitchen and the l.nClnerator burnl.ng the refuse. \nINVESTIGATOR \n(an accusl.ng tone) \nYou run a clean establishment. \nMICHAEL \nAre you a health l.nspector? \n:~lVESTIGATOR \n(showl.ng Vincent's mugshot) \nDo you recognlze this man? \nMICHAEL \nMy eyes aren't so good. \nINVESTIGATOR \nI bet. \nHugo calls out from the sl.de door where he has disc::overed \nhis fallen colleague. \nHUGO \nSir. \nThe Investigator hurrl.es to hl.m. \n:NVESTIGATOR \n(to the still dazed Detective, \nexamining his injuries) \nDid he hit you wl.th his fist? \nDETECTIVE \n(head In his hands) \nMore like a hammer. \nINVESTIGATOR \n(reprlmanding the beaten Detective) \nDon't touch your face. Don't swallow. \nDon't spit. \n(to Hugo) \nQuick, clean hl.s teeth. \nHugo uses a flashlight and a small dental-like implement to tr/ \nCo pick skin from Jerome's knuckles from between the Detec':~'/e' s \nteeth. The Investigator finds the hidden side door. \n07 "
    },
    {
      "id": 91,
      "title": "EXT. DE~CLA7E LOT.",
      "location": {
        "primary": "DE~CLA7E LOT.",
        "type": "ext"
      },
      "text": "EXT. DE~CLA7E LOT.\nJEROME and :RENE cont:':1ue to sprint across the enormous vacant lot in the moonlight, splashing through deposlts of mud and \nwater. JUSt as the gate opens in the distance, Jerome hurls \n. Irene into the safety of the undergrowth on the other slde. \nIrene, out of breath, desperately feels for her pulse. \n:RENE \n(upset, a strangled protest) \nAre you trying to Kill me? Are you?! \nDon't you understand, I can't do that! \nJerome tenderly removes Irene's hand from her pulse. \nJEROME \nYou Just did. \nIrene lOOKS back across the vast clearing they have just \nnegotiated, realizlng ·\"\"hat she has just done. \nFrom across .~he other side of the clearing comes an echoing \ncry from the center FIG~~E. \nINVESTIGATOR (OC) \nVincent! 'Jincent! "
    },
    {
      "id": 92,
      "title": "EXT. MICHAEL'S. NIGHT.",
      "location": {
        "primary": "MICHAEL'S. NIGHT.",
        "type": "ext"
      },
      "text": "EXT. MICHAEL'S. NIGHT.\nThe INVESTIGATOR is about to cry out Vincent's name once again \nwhen he realizes DETEC-::::'lE HUGO and the other DETECTIVES are \nwatching him, askance. \nINVESTIGATOR \n(to Hugo, coverlng hlS frustration) \nWhat are you waiting for? \nCETECTIVE HUGO \nWhere do we start? \n:::~NESTIGATOR \nWe'll vacuum these streets if we have to. \nDETECTIVE \n(handing the Investigator Irene's pill box) \nWe caught them trying to flush these, Sir. \nThe Investigator carefully examines the heart pills. "
    },
    {
      "id": 93,
      "title": "EXT. :?ENE' 5 APAR'!:1E.\"IT. ~'::;nT .",
      "location": {
        "primary": ":?ENE' 5 APAR'!:1E.\"IT. ~'::;nT .",
        "type": "ext"
      },
      "text": "EXT. :?ENE' 5 APAR'!:1E.\"IT. ~'::;nT .\n,,·ERCME ..... alks IRENE co the seeps of her apartment. :erc:r.e :::~::ks \nabout ~epart~ng but Irene takes h~m gently by the hand. \n!RE.\"lE \nSo sure of what you can't do. \nJerome follows her inside. \nINT . IRENE'S BEDROOM. NI GHT . \nJEROME and IRENE climb a staircase to her bedroom. Without \nanother word they begin to make love. \nLATER THAT NIGHT JEROME cannot sleep. He rises quietly so as \nnot to disturb IRENE. He sllently opens the double-windows of \nthe upstairs bedroom. He carefully gathers his p1llow from the \nbed and shakes it out of the window. \nSlowly Jerome turns to gaze at the wood floor. In. the moonlight \nwe see an EXTREME CLOSE UP of a single ·hair lying on the' . \nfloorboards. Jerome bends and, picks up the hair. trying to \nidentify it in the dim light. On his hands and knees he tries \nto clean the floor with a towel. Irene turns over in the \nbed. Jerome freezes but she continues to sleep. He realizes he \nmay be spreading even more of his skin and hair over the .floor. \nOvercome with frustrat10n and the enormity of his task. he . \nbegins to quietly weep. "
    },
    {
      "id": 94,
      "title": "EXT. A FIELD. DAWN.",
      "location": {
        "primary": "A FIELD. DAWN.",
        "type": "ext"
      },
      "text": "EXT. A FIELD. DAWN.\nA light shroud of mist hangs over the trees that encircle a \n. grassy clearing beyond Irene's building. Something lies 1n the \n':center of the clearing. \nWe jump-cut to an EXTRE.~ CLOSE UP of two or three blades of \ngrass. Bristles rain down on the blades. Without access to his \n:ncinerator. the crouched, naked figure of JEROME disposes of \nhis wh1skers. skin and ha1r in an open field. His clothes Slt \nIn a neat pile at his side. He pours glycolic acid over h1S \nbody and scrubs at his back. feet and hands with a brush. There \n1S a haunted. tortured look in his eyes as he tries desperately \nto rid himself of h1mself. \n:NT. POOL. MORNING. \nThe :NVESTIGATOR swims obsessively in his aquatic treadm1l~. \n.. 39 "
    },
    {
      "id": 95,
      "title": "INT. :;:RENE'S APAR~NT. :\"ATER THAT MORNING.",
      "location": {
        "primary": ":;:RENE'S APAR~NT. :\"ATER THAT MORNING.",
        "type": "int"
      },
      "text": "INT. :;:RENE'S APAR~NT. :\"ATER THAT MORNING.\nBack In the bedroom. JEROME, partially dressed, holds IRENE \nIn bed. She softly touc~es the scars on hls shins. \n(referrlng to the scars) \nWhat happened? \nJEROME \nYou remember the '99 Chrysler LeBaron? It's the exact height of the front fender. \n( shrugs) \nLooked rlght lnstead of left. \n:RENE \n(comforted by the thought) \nSo you're not so smart after all. \nI want I'd be \nBank. (awkward about raising the subject) \nyou to know--if it ever came to it-­\nwilling .to get an ovum from the Egg \nIn fact, I'd raCher use a donor egg--\n(quickly covering herself. again) --if it came to it. \nJEROME \nBut \"if it came to it\" then it couldn't have your-­\n(searching for an appropriate body part) \n--nose. \n(stroking her face) \nHow perfect does your child have to be? \nIRE.\"IE \n(mlldly lrritated by what she \nperceives as his mocking) \nYou hypocrite. Do you think for one moment \nyou'd be doing what you're doing if it wasn't \nfor who you are--whac you are? Don't you get \nany satisfactlon knowing that your children \nwill be able to live to a ripe old age unless \nthey do somethlng foolish? \nJEROME \nThat's precisely what scares me--that they \nwon't do anythlng foolish or courageous or \nanyching--worth a Goddamn. \nIrene 1S taken aback by Jerome's passion, regarding him in a new \nlight. \n90 \n!NT. EUGENE' S CONDCM!~H:::M. MOR.NI~IG. . \nEVGENE urinates ~nto a large plastic container wh~:e drinkl,-q \nbottled water at the same tl~e. He already has several other \nccntalners of urine on the cable beslde h~m. "
    },
    {
      "id": 96,
      "title": "INT. GAT7ACA. MORNING.",
      "location": {
        "primary": "GAT7ACA. MORNING.",
        "type": "int"
      },
      "text": "INT. GAT7ACA. MORNING.\nThe INVESTIGATOR and DETECT!'/E HUGO keep a wary eye on che \noutfitted DETECTIVES re-vacuuming the empty computer complex \nwith their mini-vacs. \nHUGO \n(reading newspaper) \nMy wife and I--we're thinking of starting a family. \nINVESTIGATOR \n(shrugs, ambivalent) \nWhy not? \nHUGO \nThese new personality corrections I've been \nreading about. \nINVESTIGATOR \nYou worried about the cost? \nHUGO \nNot that. \nINVESTIGATOR \n(regarding Hugo with a condescending smile) \nThey said the same thing about myopia and \nobesity. You th~nk your Children would be \nless human if they were less violent, angry, \nspiteful? Maybe they'd be more human. rrom \nwhere I sit the world could stand a little \nimproving. \nWe dwell on one DETECTIVE in particular, snatching a garbage \nbag from CAESAR, the jan~tor. \nDE7ECTI'IE \nDon't touch that. It'S evidence. \nHe puts a pile of discarded paper cups aside for later testlng. \n:NT. GA~ACA CCRPC~;7:C:J. LA7ER 7~7 MCRNING. \nIn t:he 'last:, ernpt:y Gat: :aca complex I:he I!'NESTIGATOR ~nspec':. 5 3-\nspecunen bag conl:al.nu:g -:erome' s paper cup wl.l:h DIRECTOR -:CSEF \nand :ETEC'T!'/E HUGO. \nDE'TECTI'IE HUGO \nPosil:ive sall.va mal:ch. The cup was \ndefinit:ely used since I:he original sweep. \nIN'IESTIGATOR \nSo we have t:wo choices. Eil:her our suspect \ncame back 1:0 I:he murder scene for a drink of \nwal:er and I don't know anybody that thirsty or ... \nIlooking out over the empty complex) ... he is here. \n(resolul:e) \nWe test again. You're right, Hugo, this was a \ndesperate act. Someone had a lot to lose that \nnl.ght--perhaps ·their place in line. \nIto Dl.rector Josef) \nI'd like the profiles of everyone with an \nupc,;ml.ng ml.SSl.on. \nDIRECTOR JOSEF \n(nervous) \n~Nelve have a ml.ssion within the week. \nINVESTIGATOR \nThis I:ime I will supervise each test personally. \nINT/EXT. GATTACA. MORNING. \nJEROME and IRENE walk towards the entrance to Gattaca. Spying \nthe Homl.cide Investigatl.on trucks parked at the rear of the \n':building and the silhouel:te of t:he IN'lESTIGATOR in the doorway, \nJerome pulls up sharply. Irene notices his unease. \nIRENE \nWhat is it? \nJEROME \nI forgot somel:hing--something at home. I'll see you later. \nJerome kisses her. Irene, also aware of the trucks, \ninterrogates Jerome wl.l:h her eyes. \n:RE.'lE \n:'11 miss you. (CONTINUED) \nCONTINUE!;) \n~erome ~s sc~ll :ocussed en ~he entranceway. \nIRE..\"'JE \n(look~ng skywards) \n--when you go away. \nJEROME \nWe could go together one day. \nIrene considers the idea. She enters Gattaca alone. "
    },
    {
      "id": 97,
      "title": "INT. GATTACA AEROSPACE CORPORATION -COMPUTER COMPLEX. DAY.",
      "location": {
        "primary": "GATTACA AEROSPACE CORPORATION -COMPUTER COMPLEX. DAY.",
        "type": "int"
      },
      "text": "INT. GATTACA AEROSPACE CORPORATION -COMPUTER COMPLEX. DAY.\nIRENE prepares a stack of IO photos of CREW MEMBERS for the \nINVESTIGATOR. She closely inspects the doctored photo of \nJEROME, hesitating before adding it to the file. \nThe camera dwells on JEROME's vacant work station. The. \n'INVESTIGATOR curiously regards the empty ·chair. He' is \naccompanied by DETECTIVE HUGO, DIRECTOR JOSEF and IRENE. \nDETECTIVE HUGO \nHe's the only absentee. \nDIREC':'OR JOSEF \nA little nausea. Quite common. \nINVESTIGATOR \nAt least it's noth~ng contagious. \nDIRECTOR JOSEF \n(unduly agitated) \nI will not perm~t any further testing on the \neve of a ~SSlon. We're already counting \nbackwards. \nThe INVESTIGATOR ignores Josef and takes a pocket knife from his \nJacket. He prises out the \"ESC· key from Jerome's keyboard, \nplaces the key in a specimen bag and deposlts it in his Jacket. \n(CONTINUED) \n,. CONTINUED \n:RE!IE \n(~icK~ng up a phonel I'll call and ~et h~m know. 13 \nThe Investigator gently but firmly removes the phone from \nIrene's hand and replaces the receiver in the cradle. \n::wESTIGATOR \nLet's not spo~l the surprise. \nIto Irenel \nI understand you can show us the way. \nThe anxious Director Josef calls out to protest one further \ntime but the Invest:gator is on his way out of the door. "
    },
    {
      "id": 98,
      "title": "EXT. STREET OUTSIDE GATTACA. DAY.",
      "location": {
        "primary": "STREET OUTSIDE GATTACA. DAY.",
        "type": "ext"
      },
      "text": "EXT. STREET OUTSIDE GATTACA. DAY.\nOutside the entrance to Gattaca, trying to hail a taxi, JEROME is startled to see a car carrying the INVESTIGATOR,. DETECTIVE \nHUGO and IRENE roar out of the driveway. JEROME calls .on his \nportable wristphone. "
    },
    {
      "id": 99,
      "title": "INT. EUGENE'S CONDCMINIUM. DAY.",
      "location": {
        "primary": "EUGENE'S CONDCMINIUM. DAY.",
        "type": "int"
      },
      "text": "INT. EUGENE'S CONDCMINIUM. DAY.\nEUGENE, at his window, filling sachets as usual, hesitates \nbefore answerlng the phone. \nEUGENE \nHello? \nJEROME lOCI \nHow would you like to be yourself for the day? \nEUGENE \nI nonchalant I \nI was never very good at it, remember? \nIN'!'. EUGENE'S CONDCMINIUM / HALLWAY. DAY. \nWlth a look of resolve, EUGENE hangs up the phone. \nHe wheels his chair up to the sweeping staircase and regards the \nfirst of many dozen steps. The daunting staircase spirals away \nabove him. \n:m-. IN'VESTI:;ATOR' s .:.;.q. :AY. \nHt'GO dr~ves. The ::NES7::;';TCR looks to IRENE In the rear seat. \n:!,r;ESTIGATOR \n(':.aunting) \n'{au don':: know ''''no he is, do you, Irene? \nHe hands her the pill box found in Michael's. \nINVt:STIGATOR \n'{au think you have problems? "
    },
    {
      "id": 100,
      "title": "INT. EUGENE'S CONDO I JEROME'S CONDO. DA,{ .",
      "location": {
        "primary": "EUGENE'S CONDO I JEROME'S CONDO. DA,{ .",
        "type": "int"
      },
      "text": "INT. EUGENE'S CONDO I JEROME'S CONDO. DA,{ .\nHaving wheeled his chair out of sight, EUGENE eases himself out \nof his wheelchair and onto the floor. Using his elbows, \ncommando-style, dragging his lifeless legs behind him, he \nproceeds to crawl across the floor and up the first step of the \nlong spiral staircase. We observe his agonizingly slow progress \nup a staircase that, from Eugene's point of view, appears to \nhave doubled In length. "
    },
    {
      "id": 101,
      "title": "EXT. CONDOMINIUM COMPLEX. DAY.",
      "location": {
        "primary": "CONDOMINIUM COMPLEX. DAY.",
        "type": "ext"
      },
      "text": "EXT. CONDOMINIUM COMPLEX. DAY.\nThe INVt:STIGATOR and DETECTIVE HUGO emerge from their car with \nIRENE in tow. They take in the l.mpressive c,omplex -the \nInvestl.gator gets a glimpse of the empty pool. They approach \nthe intercom at the entrance. "
    },
    {
      "id": 102,
      "title": "INT. JEROME'S CONDOMINIUM. DAY .",
      "location": {
        "primary": "JEROME'S CONDOMINIUM. DAY .",
        "type": "int"
      },
      "text": "INT. JEROME'S CONDOMINIUM. DAY .\n. EUGENE, bathed in sweat, finally crests the landing of the \n':staircase. No respite. As he drags himself across the floor \nthe internal phone rl.ngs. He frantically stretches up and \nknocks the phone off ltS hook so he can talk from his prone \nposition on the floor. \n:NT. CONDOMINIUM -LOBBY. DAY. \n!RENE is on the phone, closely watched by the INVESTIGATOR and \nDETECTIVE HUGO. \nEUGENE (OCl \n(through intercom, no trace of his distress) \nHello. \n( CCNTI!JUED ) \nCDNTINUED \n:?E!';E \n(a :rLcment' s r.es~tation) \n\";ercrne--: \n=:'JGENE \nHello, sweet~eart. Come on up. "
    },
    {
      "id": 103,
      "title": "INT. JEROME' S CONDCM::~H liM. DAY.",
      "location": {
        "primary": "JEROME' S CONDCM::~H liM. DAY.",
        "type": "int"
      },
      "text": "INT. JEROME' S CONDCM::~H liM. DAY.\nWith no mean effort. E~GENE finally manages to replace the phone \non its cradle. He desperately crawls up onto the sofa. \nHowever, spYlng the ~pr~ght vacuum cleaner in the open closet. \nhe is forced to crawl :here and remove the '/acuwn bag. He \nfrantically crawls baCK towards the sofa and stuffs the bag \nbehind a cushion. "
    },
    {
      "id": 104,
      "title": "INT. JEROME'S CONDOM::mUM. DAY.",
      "location": {
        "primary": "JEROME'S CONDOM::mUM. DAY.",
        "type": "int"
      },
      "text": "INT. JEROME'S CONDOM::mUM. DAY.\nIRENE enters the door deliberately left ajar, closely followed· \nby the IN'.JESTIGA'roR and :lETECTIVE HUGO. EUGENE is propped up on \nthe sofa, TV remote control placed in his useless hand to cover \nhis paralysis. He has a stainless steel bowl next to him and \nhas crossed his llfeless legs for a more natural effect. Eugene \ncalmly motions the confused Irene towards him. \nE::GE..\"lE \nWhere's my K~ss? \nThe Investigator scrut~nizes Irene's reaction. With only the \nmerest hesitation she takes her cue from Eugene and kisses \nhim affectl.onately on the forehead. She perches herself on the \n. arm of the sofa. Eugene takes the opportunity to rest hl.s \n':hand on her leg. \n:RENE \nGood to see you're feeling better. \nEUGENE \nNow you're here. ·~o are your \"friends\"? \n:RENE It's about the Director. \nAgain? EUGENE \nIfel.gnlng boredom) \ni cONTnruED ) \n36 \nCON'I'INUEO \n,he Invest~gator slowly c~rcles Eugene, regarding h~m with che \nutmost scrut~ny. He compares his face to the doctored Gattaca :J ~hoto - a ~assable likeness. Eugene bends towards the bowl \nand dry retches. \nEUGENE \nForglve me for not getting up. \nIrene puts a comforting hand on Eugene's shoulder. \nIRENE \n(to the Investigator) \nCouldn't we do this another time? \nINVESTIGATOR \nI don't believe so. \nDetective Hugo takes a seat in the chair beside the sofa and \nunpacks a syringe from the kit he carries. \nDETECTIVE HUGO \nThis won't take a moment. \nDetective Hugo swabs Eugene's inner arm. All eyes are tralned \non the tip of the needle as it punctures the vein. \nEUGENE \n(reassuring to Irene, referring to \nthe blood flowing into the syringe) \nIt'S okay. Maybe they can find out what I've got. \nUnder the Investigator's watchful eye, Detective Hugo withdraws \nthe syringe and immediately inserts a small amount of the blood \n. into the portable analyzer he wears. Naturally, it confirms \n.: that Eugene is Jerome. \nIrene does her best to conceal her shock. Hiding his \nfrustration, the Investlgator distractedly tours the room while \nHugo packs up his gear. The Investigator idly toys with \nthe telescope pointed out of the window. \n~ext he wanders towards the closet and reaches for the doorknob. \nINVESTIGATOR \nMind if I take a leak? \nEUGENE \nAs long as you don't do it in my closet. \n(nodding to the other side of the room) \nOver there. \n.. INT. ';\"E:l'OME' S CONr:C!1IN:::M -3ATHROCM. CAY. \nThe INVESTIGATOR immediacely pulls a speClmen bag from his \nJackec pockec and closely inspeccs che stainless steel ~ol~et \nand sink. They are b::h spotless. The shower scali .s also \nscrupulously clean. He flushes the toilet and eXlts. \nLost in thought, the INVESTIGATOR approaches the closet agaln \nand wheels out Jerome's upright vacuum cleaner. He is \ndisappointed a second time to find no vacuum bag inside. The \nInvestigator returns the vacuum cleaner to the closet and \nproduces a mini-vac from Detective Hugo's crime bag. \nINVESTIGATOR \nIto Eugene, referring to the mlni-vac) \nMay I? \nEUGENE \nClean the whole house if you want. \nIRENE \n(taking Eugene's lead) \nActually, the Kitchen needs doing. \nThe Investigator switches on the mini-vac to take a speClmen \nfrom the floor, then promptly kills the machine. Looking down, \nthe Investigator notices the trail of Eugene's perspiration \non the highly polished floor leading to the spiral staircase. \nEugene, reading the Investigator's mind, goes to callout but \nthe words remain frozen on his tongue. Hugo follows his \nsuperlor as they start to descend the stairs. Irene and Eugene \nare left staring at one another. "
    },
    {
      "id": 105,
      "title": "INT. CONDO -STAIRCASE. CAY.",
      "location": {
        "primary": "CONDO -STAIRCASE. CAY.",
        "type": "int"
      },
      "text": "INT. CONDO -STAIRCASE. CAY.\nJEROME catches the merest glimpse of the INVESTIGATOR and \nDETECTIVE HUGO before he slips behind a doorway in Eugene's \ncondominium. \nJerome anxiously regards Eugene's empty wheelchair sitting \nthere. On the stalrs, Hugo'S phone rings. \nDETECTIVE HUGO (OC) \n(into phone. increasingly encouraged) \nYes? ... Yes ... yes ... \nThe Investigator is already at the foot of the stairs in \nEugene's condo when the Detective calls to him. \n(CONTINUED) \n. . CONTINUED \n(urgent, cO Investigator) \nCome quickly. ~e have h~m. \nThe Investigator's eyes light up. He retraces his steps \nup the staircase after Detective Hugo . "
    },
    {
      "id": 106,
      "title": "INT. JEROME'S CONDOMINIUM. DAY. 98",
      "location": {
        "primary": "JEROME'S CONDOMINIUM. DAY. 98",
        "type": "int"
      },
      "text": "INT. JEROME'S CONDOMINIUM. DAY. 98\nJEROME, white as \nown condominium. \non the sofa. a ghost, climbs the stairs, emerging into his \nHe embraces the beaming EUGENE, still s~tt~ng \nJEROME \n(numb) \nHow are you, Jerome? \nEUGENE \nNot bad, Jerome. \nJEROME \nHow the hell did you get here? \nEuGENE \n(deadpan) \nI could al· .... ays · .... alk. I've been faking it. \nJerome almost laughs, desp~te the situation. Only now does he \nnot~ce Irene on the other s~de of the room, her mind racing. \nShe looks at Jerome and Eugene together and runs from the \napartment. \nIrene. JEROME \n(calling after her) \nJerome goes to follow her but Eugene stops him. "
    },
    {
      "id": 107,
      "title": "INT. CRIME LABORATORY. CAY.",
      "location": {
        "primary": "CRIME LABORATORY. CAY.",
        "type": "int"
      },
      "text": "INT. CRIME LABORATORY. CAY.\nAn EXTREME CLOSE UP of dried blood -brittle and cracking -on \na pair of soiled latex gloves. A latex head mask, suit of \nclothes and shoe covers are similarly caked. The !NVESTIGATOR \nand DETECTIVE HUGO watch as a white-coated FORENSIC TECHNICIAN \nfeeds a minute sample of the dried blood into an analyzer. \n(CONT!NUED) \n?9 \nCONTINUED \n7he It~~S7:GATCR wanders over to a one-way glass wlndow t~rcugh \nWhlCh he can observe DIRECTOR JOSEF, Sittlng numb but strangely \nserene ln an interrogation room. The Investigator, :n a 3~ate \nof shock himself, cannot yet brlng himself to belleve whac :3 \nplalnly obvious. \nrNVESTIGATOR \n(gazing at the Director, struggllng \nto come to grips with the turn of events) \nThis can't be him. \nThe DeteCtlve regards hlS superior lncredulously, lntrigued that \nhe could still cling so stubbornly to his theory in the face of \nsuch overwhelming evidence. \nDETECTIVE HUGO \n(intr:gued) \n~e found his spit in the dead director's eye. \nHe's signed a confession--supplied us with the \nsuit he wore on' the night. What more do you \n,want? \nINVESTIGATOR \n(a trace of desperation. grasping at straws) \nLuca could stlll be an accomplice. \nThe Investigator wipes the perspiration from his brow with a \ntissue and drops the tissue into the trash. ' \nDETECTIVE HUGO \nThere is no one else. Josef acted alone. A \nconflict over the upcomlng mission. We can all go home. \n':The Investigator turns away, unwllling or unable to accept the \nexplanation. Hugo regards the Investlgator with a trace of \nsympathy. He furti,ely retrleves the Investigator's tlssue \nfrom the trash. \n:NT. GATTACA. DAY. \nJEROME sits in a formal briefing room with the other CREW \nMEMBERS of his mission, receiving their final pre-flight \ninstructions. LAMAR looks on approvingly. \n(CONTINUED) \n. \" CONTINUE~ :JG \nMISSION COMMANDER \n--Flnally, I'd :~Ke to welcome Navigator Morrow \non his debut miss10n--lf we get lost out there, \nnobody has a rrap of the heavens in his head llKe \nJerome. \nJerome looks up bashful:y . \nMISSION COMMANDER \n(adopt~ng a more serious tone) \nI'm gratified that there is no longer a cloud \nhang1ng over tomorrow's launch. Now we can put \nthis unpleasantness behind us and concentrate \non the task at hand. I don't have to tell you how \nimportant th1s mlssion is--the Belt could hold \nthe key to the origin of life -why we are what \nwe are. \n(inJecc~ng a note of levity) \nI know many of you have been asking that \nquestion about me for long enough. \n(referring to a projected photograph \nof a misshapen\"asteroid behind his head) \nGaspra--how could something so ugly hold so \nmany beautiful secrets? \nPolite smlles from h1s colleagues. \nMISSICN COMMANDER \nEnJOY your final evening with your families. \nWe'll all be a year older when they see \nus next. And don't be late tomorrow. You \ndon't want to m1SS thlS . \n. ~e focus on Jerome. He appears to have his head in the heavens ': already. "
    },
    {
      "id": 108,
      "title": "INT. CRIME LAB. NIGHT.",
      "location": {
        "primary": "CRIME LAB. NIGHT.",
        "type": "int"
      },
      "text": "INT. CRIME LAB. NIGHT.\nThe tormented INVESTIG~TOR lies on the floor of his lab, staring \nat the cel1ing. He W1nces 1n discomfort. He is lying on \nsomething. He rolls over and retrieves the irritation from his \npocket. It 1S the \"ESC' computer key he prized from Jerome's \nkeyboard. \nHe gazes at the key for a moment and then gets to his feet. He \nresurrects an cld fingerprint kit from a cupboard. Carefully \nremoving the key from che speclmen bag -marked. • MORROW , \nJerome' -he begins to dust it for a fingerprint. (CONTINUED) \nCONTINUED \nHe places ::-.e key '..:::der a camera. The enlarged print appears \non the lefthand slde of his computer screen. The word 'MATCH\" \nblinks onto the screen. However the face that appears from the \ncomputer's databank :s not that of 'MORROW, Jerome' but \n'LUCA, Vincent'. The Investlgator regards the photograph In \ndisbelief. \nDETECTIVE HUGO casually enters the lab, something odd in hls \nnonchalant demeanor. \nINVESTIGATOR \n(excited) \nHugo~ I've found him~ \nHUGO \nI've found him too. \nINVESTIGATOR \n(not listening, referring to his discovery) \nA fingerprint. There's something to be saij for nostalgia. \n. (realizing what Hugo has 'said) \nWhat did you find? \nHugo puts a specimen bag on the counter. It contains the \nInvestigator's discarded tlssue. The Investigator doe.s \nnot recognize it. \nDETECTIVE HUGO \nIt'S not exaccly him. \nINVESTIGATOR \n(interest piqued) \nWhere did you get this? \nThe Investigator immediately deposits the tissue into an \nanalyzer. \nDETECTIVE HUGO \n(referring to the tissue) \nBut this man does share some common \ncharacteristics with your suspect. Not so \nmany b~t enough. It appears the eyelash \ndoes have a brother--of a kind. \nThe Investigator realizes the significance and looks guiltily \nto Hugo. Hugo exits the lab, leaving the Investigator to stare \nat his own FACE in his analyzing machine. \n: INT. GArTACA -J~~I~R'S LOCKER ROOM. NIGHT. \nCAESAR, the old jan~tor, enters the locker room. ~e ~s about :0 \nwear~ly open his locker when he senses another presence ~n the \n~oom. \nHe turns to find JEROME sitting there on a bench. Although \nclearly delighted, CAESAR tr~es to disguise his pleasure. \nCAESAR \nSo you've finally seen sense and come back \nto your old Job, Vincent. \nJEROME \nNot yet, I'm afraid. \nCAESAR \nNo? What's keeping you? \nJEROME \nI guess I'm a slow learner. \nI guess so. \n(looking up through the \nsmall window) \nWell, while you're up there, maybe you could \ntidy the place up a bit. \nJEROME I'll see what I can do. \nThe two men embrace, Caesar breaking off before Jerome. \nCAESAR \nAnd don't go getting everybody lost out there. \nYou'll give us a bad name. You won't have \nme to keep an eye on you, you know. \nJEROME \n(glanclng to Caesar's locker) \nBy the way, I left some trash in your locker. \nCAESAR \n(happy to oblige) I'll take care of it. \nJerome departs. Caesar watches him go and turns back to his \nlocker. He opens it to find a brand new. high-tech telescope \nsltting inside. \n(CONTINUED) \n:'0] \nC::NTINUED \n\":\"'\":e old janieor gees over r.ls surprise and beams broadly -\nhe looks back in Jerome's d~recelon bue he has gone. The \nold janieor cannoe help hl~elf and reverenely reaches for :he \ntelescope's eyepiece. "
    },
    {
      "id": 109,
      "title": "INT. GATTACA -COMPUTER COMPLEX. NIGHT.",
      "location": {
        "primary": "GATTACA -COMPUTER COMPLEX. NIGHT.",
        "type": "int"
      },
      "text": "INT. GATTACA -COMPUTER COMPLEX. NIGHT.\nIn the dimly-lit, empey computer complex, JEROME takes a last \nlook around. He sits at his computer, one final t~me replaying \nthe graphic representation of h~s path through the cosmos that \nhe 'is on the eve of tak~:1g for real. \nHe notices the key missi:1g from his keyboard. Instantly \nrealizing the s~gnificance, he rises from his seat to flee. \nIN'JESTIGATOR \nVincent--\nJerome is stopped in his tracks by the sound of his given name \nand the voice that calls It. \nHe makes no further attempt to flee but turns to face his \npursuer. The Investigator steps out of the shadows. \nINVESTIGATOR \nVincent, what are you running from? \nJEROME \n(disturblngly calm) \nFrom Vincent. \nThe two men face each other for the first time in a long \n. tlme. The Investigator lS transfixed by Jerome's face -\n'~scarcely able to believe hlS eyes. \nINVESTIGATOR \nHas it been so long, you don't remember \nwho I am? \nJEROME \n(nodding to the Investigator's badge) \nMaybe it's you · ... ho's forgotten. \n(meetlng his gaze) \nWhat are you doing here, Anton? \nIt is finally apparent the Investigator \nbrother Anton [AS '~SHALL REFER TO THE \nREMAINDER OF THE FI!..'1J. is Jerome's younger \nINVESTIGATOR FOR 7HE \n(CONTINUED) \nCONTINUED \nANrCN \nI could ask you the same question. \n(glanc~ng to the impressive complex) \nI have a r~ght to be here, you don't. ~J4 \nJerome sm~les at condescendingly. \nJEROME \nYou almost sound like you believe that. \nANTON \n(ignoring the remark, extending his hand) \nCome with me n~~, Vincent. You've gone as Ear \nas you can go. \nJEROME \n(reEusing Anton's hand, glancing \nto the telescope above them) \nThere are a few million miles to go yet. \nAN'roN \n\"\"\" . (adamant) It's over. \nJEROME \n(shaking his head) \nIs that the only way you can succeed, Anton, \nto see me Eail? \nANTON It's for the best. \nJEROME \n(increasingly angered) \nGod, even you want to tell me what I can't do. \nIn case you hadn't noticed, Anton, I don't \nneed rescuing. But you did, once. \nAnton is clearly stung by the memory. \nJEROME \n(goading) \nWell? You have all the answers. How is that \nposs~ble? \nANroN \n(resolute) \nYou didn't beat me that day. I beat myself. \n(CONTINUED) \nCONTINUE!:) \n~o are you C~/lr.g co convlnce? \n~\",-rcN \nlangr/I \nI wlll prove It to you. Come swim with \nme now, Vincent. Now--tonlght. \nJerome regards Anton wlch a knowing smile. Somewhere In Gattaca \na phone rings. \nINT!EXT. IRENE'S CAR OUTSIDE CONDOMINIUM COMPLEX. NIGHT. \nIRENE, sltting ~n her car outside Jerome's condominium, hangs up \nher portable phone. In her agitation, her finger lnvoluntarlly \ngoes to her pulse. She catches herself and removes the finger \nfrom her wrist as If It has burned her. She eXlts the car. "
    },
    {
      "id": 110,
      "title": "INT. JEROME'S CONDOMINIUM! EUGENE'S CONDOMINIUM NIGHT.",
      "location": {
        "primary": "JEROME'S CONDOMINIUM! EUGENE'S CONDOMINIUM NIGHT.",
        "type": "int"
      },
      "text": "INT. JEROME'S CONDOMINIUM! EUGENE'S CONDOMINIUM NIGHT.\nIRENE quietly knocks on Jerome's door but there is no response. \nTrying the handle, the door opens. Her curiosity takes her \ninside. All is quiet. IRENE calls out. \nIRENE \nHello. \nNo reply. Irene hesltantly ventures further, drawn to the spiral staircase. She tentatlvely makes her way down the stalrs \nand into Eugene's dimly llt condominium. With wonder and \nreverence, she examines the instruments and samples laid out on \nEugene's work benches. She opens the refrigerator in the \n.... bathroom and inspects the samples and sachets. Finally she \nregards the empty inCinerator. \nEUGENE IOC) \nQuite somethlng, lsn't it? \nIrene turns. \nEUgene has entered through the mirrored door, not at all \ndispleased by her unexpected visit. \nEUGENE \n(referring to the incinerator) \nThat's · ... here · ... e get rid of the traces of him \nalthough we never truly succeeded. (CONTINUED) \n· -\n.. CONTINUE!:! \n:Ro.'E \nI've been looking for h~m. Do you know where \nhe is? \nEUGENE \n(unconcerned) \nHe's probably just leaving some more of me \naround the place before he goes. \nEugene idly inspects one of the blood sachets. \nEUGENE \nDon't be deceived, Irene. These are \njust the clothes. He has to wear them. \nSomething I could never do. \nIRENE \nWhat's wrong with him? \nEUGENE \n(sympathetic smile) \nYou nave more in common than you-know. \nIrene's hand involuntar~ly goes to her heart. \nEUGENE \nBut they say his is already ten thousand beats \noverdue. I have my doubts. \n(wry smile) \nFor all my g~fts, they could never engineer \nme a heart like Vincent's. \nIrene turns back to the incinerator, lost in thought . "
    },
    {
      "id": 111,
      "title": "EXT. BEACH. NIGHT. :06",
      "location": {
        "primary": "BEACH. NIGHT. :06",
        "type": "ext"
      },
      "text": "EXT. BEACH. NIGHT. :06\nJEROHEand ANTON walk down a dune together towards the beach not \nfar from Gattaca -an ocean beach pounded by an angry, black \nsea. Jerome picks up a sharp piece of shell and slices the end \nof his thumb. A drop of blood oozes out. He offers the shell \nto Anton but Anton does not take it. \nBoth men begin to disrobe. The brothers stand beside each other \non the sand once aga~n -Anton still the more athletically-bu~lt \nof the two. \nTogether, they enter the raging surf. \nbreaking waves, they begin to swim. Diving through the \n(CONTINUED) \n107 \nCONTINUE,D \nIn the moonlit n~ght. '\",e watch their two bodies sW1Imling slde by \nslde. They swim a long distance. Anton walting for h1S brother \nto tire. But the pace does not slacken. Anton pulls up In the \nwater. Sensing his brother is no longer bes1de h1m. Jerome also \npulls up. They tread water several yards apart. \nANTON \n(att~~ting to conceal his distress) \nHow are you delng this. Vincent? How \nhave you dene any of this? \n':EROME \nNow 1S your chance to find out. \nJerome SWlms away a second time. Anton is forced to follow \nonce again. Angry now, gritting his teeth, Anton calls \nupon the same determlnation we have witnessed during his \nconstant Swimming in the pool. He puts on a spurt, slowly· \nreeling in Jerome. \nAnton gradually draws alongside Jerome, certain that this effort \nwill demoralize his older brother. But Jerome ha.s. been. foxl.ng·­\nwaiting for him to catch up. Jerome smiles at Anton. With' \nalmost a trace of sympathy, he forges ahead again. Anton is \nforced to go with him. They swim again for a long distance. \nIt is Anton who gradually becomes demoralized -his strokes \nweaken, his will drainlng away. Anton pulls up, exhausted and \nfearful. Jerome also pulls up. However his face displays none \nof Anton's anxiety. \nThey tread water several yards apart. The ocean is choppier \nnow. The view of the lights on the shore is obscured by the \npeaks of the waves. \nANTON \n(panic starting to show) \nVincent, where's the shore? We're too far out. \nwe have to go back! \nJEROME \n(calllng back) \nToo late :or :hat. We're closer to the other slde. \nAnton looks towards the empty horizon. \n(CONTINUED) \no· \n• CONTINUED \n.!u.\"ITON \nw.hac other s~de? How far do you want to go?! \nDo you want to drown us both? \n(becom~ng hysterical) \nHow are we going to get back?! \nJerome merely smiles back at his younger brother. a disturbing:y \nserene smile. \nJEROME \n(eerily calm) \nYou wanted to know how I did it. That·s \nhow I did it. Anton. I never saved anything \nfor the swim back. \nAnton stares at Jerome. aghast. The two men face each other in \ns~lence. treading water several yards apart in the dark. rolling \nocean. \nJerome turns and heads back towards the shQre. Anton is left \nalone with the terrifying realization. The only sOund. the win~ \nand the water. "
    },
    {
      "id": 112,
      "title": "EXT. CONDOMINIUM. NIGHT.",
      "location": {
        "primary": "CONDOMINIUM. NIGHT.",
        "type": "ext"
      },
      "text": "EXT. CONDOMINIUM. NIGHT.\nJEROME. dishevelled and distressed. arrives back at the \ncondominium. He notices IRENE standing at the edge of the pool. \nShe turns. He approaches her. They stand several \nLooking into each other's eyes. they do not speak. \nabruptly pulls a hair from his head -for once one \nJEROME yards apart. \nJerome \nof his own. \n(wry smile. offering the hair to Irene) \nHere, take it. \nIrene takes the hair, the Significance not lost on her. \nJEROME \n(echoing Irene's words frcm \ntheir first encounter) \nIf you're still interested, let me Know. \nIrene contemplates the hair in her fingers for a moment. then \ndeliberately lets it fall to the ground. \n(CONTINUED I \n. . CONTINUED \nIRENE \n(never caking her eyes from him, echoing \nJerome's words from their first encounter I \nSorry, the wind caught it. \nOnce again there is not a breath of w~nd. The hair lies, \nplainly vis~ble on the edge of the pool . \nFrom an upstairs window, EUGENE observes the couple. "
    },
    {
      "id": 113,
      "title": "INT. JEROME'S CONDOMINIUM. NIGHT.",
      "location": {
        "primary": "JEROME'S CONDOMINIUM. NIGHT.",
        "type": "int"
      },
      "text": "INT. JEROME'S CONDOMINIUM. NIGHT.\nWe watch the silhouette of IRENE and JEROME making love in \nthe bedroom. "
    },
    {
      "id": 114,
      "title": "INT. EUGENE'S CONDOMINIUM. NIGHT.",
      "location": {
        "primary": "EUGENE'S CONDOMINIUM. NIGHT.",
        "type": "int"
      },
      "text": "INT. EUGENE'S CONDOMINIUM. NIGHT.\nEUGENE, sitting in his darkened room, unscrews the \nplastic container and places it on a nearby table. \non Eugene's face as he opens his fly. . "
    },
    {
      "id": 115,
      "title": "INT. JEROME'S CONDOMINIUM. NIGHT. cap of a",
      "location": {
        "primary": "JEROME'S CONDOMINIUM. NIGHT. cap of a",
        "type": "int"
      },
      "text": "INT. JEROME'S CONDOMINIUM. NIGHT. cap of a\nWe rema~n. \nIRENE and JEROME lie in bed together after making love. For \nonce Jerome is able to sleep unconcerned. It is Irene who lies \nawake, head against JEROME'S chest, listening to the sound of \nhis errat~cally beating heart. However it has a soothing \neffect on her. \nShe kisses Jerome and reluctantly r~ses from the bed. \nJEROME \n(awakenl.ngl \nA year ~s a long tl.me. \nIRENE \nNot so long--just once around the sun. \nJerome smiles. For once Irene appears to be looking forward \nto the trip. She eXl.ts the room. \n.. 1:'0 "
    },
    {
      "id": 116,
      "title": "INT. :::NC:::NERATOR. :10RNING.",
      "location": {
        "primary": ":::NC:::NERATOR. :10RNING.",
        "type": "int"
      },
      "text": "INT. :::NC:::NERATOR. :10RNING.\nInside the ~ncinerator, ~ERCME scrapes away at h~mself -fer :he :inal t~me. He w~stfully regards the brush ~n his hand. "
    },
    {
      "id": 117,
      "title": "INT. EUGENE' 5 CONOOMINIGM. MORNING.",
      "location": {
        "primary": "EUGENE' 5 CONOOMINIGM. MORNING.",
        "type": "int"
      },
      "text": "INT. EUGENE' 5 CONOOMINIGM. MORNING.\nJEROME, dressed for h~s departure, emerges down the spiral \nstaircase into Eugene's condo. Jerome notices several su~tcases \nat the foot of the sta~rs. \nEUGENE wheels into the room. \nEGG ENE \nI have your samples ready. \nJEROME \n(confused) \nHave you forgotten? I don't need any samples \nwhere I'm go~ng. \nEUGENE \n(meet~ng Jerome's gaze) \nNo, but you m~ght need some when you get back. \nEugene wheels across the room and opens the mirrored door. The \nwater vapor billows out. Jerome regards Eugene. \nEugene leads Jerome inside for the first time. \nInside are two rows of four identical, industrial refrigerators. \nThey contain thousands of blood and urine specimens. \nJerome regards them with awe and more than a little unease. \nEUGENE \nEverything you need to last you two lifetimes. \nEUGENE points out an extra specimen of semen in the first \nrefrigerator. \nEUGENE \nThere's an extra specimen. I wish I \ncould give it to her myself. \n(afterthought) \nBut then, you always were better at being me. \nEugene leads the way out of the refrigerated room. \n(CONTINUED) \nCONTINUEiD \nJERCME \n(struggling to come to terms \nw~th the d~scovery) \nWhy have you done th~s? \nEUGENE \n(as he seals the mirrored door) \nIn case you get back before I do. \nJEROME \nWhere are you going? \nEUGENE \n(glanclng to the suitcases) \nI'm travelling too. :':1 \nJerome goes to question Eugene's travel plans but thinks better \nof it. He kneels before his friend and embraces him. \nJEROME \nThank you. \nEUGENE \nI got the better end of the deal. I just \nlent you my body--you lent me your dream. \nJerome smiles and hugs Eugene a final time. Eugene s·tuffs an \nenvelope into Jerome's pocket. \nEUGENE \n(referring to the note, \nglancing heavenwards) \nNot until you're upstairs. \n'. Jerome exits. Eugene watches him go. "
    },
    {
      "id": 118,
      "title": "INT. GATTACA -DEPARTURE LOUNGE. NIGHT.",
      "location": {
        "primary": "GATTACA -DEPARTURE LOUNGE. NIGHT.",
        "type": "int"
      },
      "text": "INT. GATTACA -DEPARTURE LOUNGE. NIGHT.\nJEROME enters a large holding area along with his other eleven \nCREW MEMBERS. \nJerome's heart sinks as he recognizes LAMAR, greeting the crew \nfor one final unexpected substance test. His colleagues \ngroan good-naturedly but it is clearly far more than an \ninconvenience to Jerome. He looks towards the door he has just \nentered but there is no way back. One by one the crew are \nushered behind a screen. Sefore he can think of a way out, It \nis Jerome's turn. He enters the cubicle. (CONTINUED) \n• CONTINUED \nJEROME \n(as he takes the plastic cup from Lamar) \nWhat's this, Lamar? \nNew policy. 112 \nFrom behind, we see Jerome unzip his fly. However for once \nJerome does not urinate on cue -unused to operating his own \nequipment in front of the physician. \nLAMAR \n(intrigued by the \nout-of-character discharge) \nFlight got you nervous? \nJEROME \nThere's a problem, Lamar. \nLAMAR \n(apparently not listening) \nDid I ever tell you about my son, Jerome? He '.s \na b~g fan of yours. He wants to apply here. . \nJerome realizes he has no choice. Resigned to his fate, he \nbegins to fill the cup. \nJEROME \n(as he urinates) \nJust remember, Lamar, I could have gone up \nand back and nobody would have been the wiser--\nLAMAR (cutting him off) \n--Unfortunately my son's not all that they \npromised. But then, who knows what he could do. \nLamar takes the cup from Jerome in his gloved hand. Jerome \nanxiously watches his sample poured into the analyzer. \nConfirming Jerome's worst fears, the face of 20-YEAR-OLD VINCENT \nappears on the computer screen. However Lamar does not look at \nthe screen. He stares Jerome in the eye. \nLAMAR \nFor future reference--\n(a brief glance to where \nJerome has just zipped his fly) \n--righthanded men don't hold it with their left. It's just one of those things. (CONTINUED) \n·-\n• 113 \nCONTINUED \nNever looking at the screen. Lamar presses a button marked. \n·VALID- . \nLAHAR \n(knowing smile) \nHave a safe trip, Vincent. \nJerome exits up a long enclosed escalator, realizing that Lamar \nhas known all along. "
    },
    {
      "id": 119,
      "title": "INT. EUGENE'S CONDOMINIUM. NIGHT.",
      "location": {
        "primary": "EUGENE'S CONDOMINIUM. NIGHT.",
        "type": "int"
      },
      "text": "INT. EUGENE'S CONDOMINIUM. NIGHT.\nEUGENE knocks back a vodka. With a certain reverence he places \nhis silver medal around his neck. "
    },
    {
      "id": 120,
      "title": "INT. ESCALATOR. NIGHT.",
      "location": {
        "primary": "ESCALATOR. NIGHT.",
        "type": "int"
      },
      "text": "INT. ESCALATOR. NIGHT.\nAt the top of a lon~ escalator, the door to a craft is secured. "
    },
    {
      "id": 121,
      "title": "INT. EUGENE'S CONDOMINIUM._ -NIGHT.",
      "location": {
        "primary": "EUGENE'S CONDOMINIUM._ -NIGHT.",
        "type": "int"
      },
      "text": "INT. EUGENE'S CONDOMINIUM._ -NIGHT.\nEugene's wheelchair. empty, sits beside the door of the \nincinerator, also secured. "
    },
    {
      "id": 122,
      "title": "EXT. LAUNCHPAD. NIGHT.",
      "location": {
        "primary": "LAUNCHPAD. NIGHT.",
        "type": "ext"
      },
      "text": "EXT. LAUNCHPAD. NIGHT.\nA CLOSE UP of the flame of a rocket's engines igniting -the \nball of fire engulfs the launchpad -filling the screen. "
    },
    {
      "id": 123,
      "title": "INT. EUGENE' 5 CONDOMINIUM -INCINERATOR. NIGHT .",
      "location": {
        "primary": "EUGENE' 5 CONDOMINIUM -INCINERATOR. NIGHT .",
        "type": "int"
      },
      "text": "INT. EUGENE' 5 CONDOMINIUM -INCINERATOR. NIGHT .\nInside the incinerator another ball of \nengulfing the unseen figure of EUGENE. \naround his neck, melting In the fierce "
    },
    {
      "id": 124,
      "title": "EXT. GATTACA -LAUNCHPAD. NIGHT. fire -this",
      "location": {
        "primary": "GATTACA -LAUNCHPAD. NIGHT. fire -this",
        "type": "ext"
      },
      "text": "EXT. GATTACA -LAUNCHPAD. NIGHT. fire -this\nWe glimpse \nblaze. time \nthe medal \nAs we have seen so often in the past, a rocket launches into \nthe sky over Gattaca -however on this occasion it carries \nJerome. \n• 114 "
    },
    {
      "id": 125,
      "title": "INT. SPACECRAFT. NIGHT.",
      "location": {
        "primary": "SPACECRAFT. NIGHT.",
        "type": "int"
      },
      "text": "INT. SPACECRAFT. NIGHT.\n~e focus on JEROME's face -seeing little if any of the craft. \nJerome's eyes are closed. His head is still -alarrrungly stlil. \nCould the launch itself have been too much for him? He hear the \nthoughts in his head. \nJEROME (VO) \nWe came from che scars so chey say, now ic's cime co go back. If I was conceived \ncoday, I would noc gec beyond eighc cells, \nand yec here I am. In a way chey were \nrighc, I don'c have che hearc for chis world. \n(pause) \nThe quescion is, why I am having so much \ntrouble dying? \nJerome's eyes blink open. He holds the letter from Eugene in \nhis hand. It contains no words, merely a lock of EUGENE'S hair \n-for once preserved solely for its sentimental value. The \nhair, weightless, floats off the page. \nWe focus on a porthole 'looking out upon a starscape. \nA STARSCAPE \nAs we pan across the constellations, a title is superimposed \nupon the starscape: \nIn a few short years, scientists will \nhave completed the Human Genome Project, \nthe mapping of all the genes that make \nup a human being. \nAfter 4 billion years of evolution by the \nslow and clumsy method of natural selection, \nwe have now evolved to the point where we \ncan direct our own evolution. \nThe first title is replaced in the heavens by a second title. \nIf only we had aquired chis knowledge \nsooner, the following people would never \nhave been born: \nA succession of portraits and photographs of RENOWNED and \nHISTORIC FIGURES fades in and out of the constellations -the \naccompanying titles list their affliction rather than their \naccomplishments. \n(CONTINUED) \n.. \n, CONTINUED \nHOMER \n51~\"'ld from blrch \n:;A?OLECN SONAPARTE \nEpllepc~c \nCOLE'!'I'E \nArr:hrir:ic \nLOU GERHIG \nAmyor:rophic Lateral Sclerosis \n(~cu Gerhl g 's Di sease) \nRITA HAYWORTH \nA~zhelmer's Disease \nHELEN KELLER \n51 ~nd and deaf \nSTEPHEN HAWKING \n~ou Gerhig's Disease \n-JACKIE JO.YNER-KERSEE \nAsthmatic \nCHARLES DARWIN \nChronic invalid 1:5 \nThe face of Charles Darwin fades off and anoeher eiele appears \noue of ehe sears. \nEven Charles Darwin, che man who told of \nthe survival of che fictest, numbered \namongst our frailest. \n~e title fades off and is replaced by one final eitle in the \nnl.qht sky. \nOf course. the ocher birth that would \nsurely never have taken place is your own. \nCUT TO BLACK \n"
    }
  ]
}